#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_ru_glaunch1

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_ru_glaunch1.AnimBP_ru_glaunch1_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");

// ScriptStruct AnimBP_ru_glaunch1.AnimBP_ru_glaunch1_C.AnimBlueprintGeneratedConstantData
// 0x0127 (0x0128 - 0x0001)
struct AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_28;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_29;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_30;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_31;                                   // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_32;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_33;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_34;                                // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_35;                                // 0x0040(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_36;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_37;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_39;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_40;                             // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_41;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_42;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_43;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_44;                                 // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0090(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0110(0x0018)()
};
static_assert(alignof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData) == 0x000128, "Wrong size on AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __NameProperty_28) == 0x000004, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__NameProperty_28' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_29) == 0x000010, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_29' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __BlendProfile_30) == 0x000018, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__BlendProfile_30' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __CurveFloat_31) == 0x000020, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__CurveFloat_31' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __EnumProperty_32) == 0x000028, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__EnumProperty_32' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __EnumProperty_33) == 0x000029, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__EnumProperty_33' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __ArrayProperty_34) == 0x000030, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__ArrayProperty_34' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __ArrayProperty_35) == 0x000040, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__ArrayProperty_35' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __StructProperty_36) == 0x000050, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__StructProperty_36' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __ByteProperty_37) == 0x000070, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__ByteProperty_37' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __BoolProperty_38) == 0x000071, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__BoolProperty_38' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __FloatProperty_39) == 0x000074, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__FloatProperty_39' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_40) == 0x000078, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_40' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __BoolProperty_41) == 0x000080, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__BoolProperty_41' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __EnumProperty_42) == 0x000081, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__EnumProperty_42' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __ByteProperty_43) == 0x000082, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__ByteProperty_43' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, __NameProperty_44) == 0x000084, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::__NameProperty_44' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000090, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000110, "Member 'AnimBP_ru_glaunch1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

