#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_player_bh

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimBP_player_bh_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_player_bh.AnimBP_player_bh_C
// 0x2040 (0x34C0 - 0x1480)
class UAnimBP_player_bh_C final : public UAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_player_bh::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1488(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x14C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x14C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x14F0(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x15B8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x1680(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x16C8(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x1790(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x1860(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x1930(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1978(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1A40(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x1A88(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x1B68(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1C70(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1D50(0x0108)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x1E58(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1F28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1F70(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x1FB8(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x1FC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2010(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x2058(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x20A0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x20E8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x2130(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x2170(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x21B0(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x2290(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x22D8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2320(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2428(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2450(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2478(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x24A0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x24C8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x2510(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2538(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x2560(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2640(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2688(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2790(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x27B8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x27E0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2828(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2850(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x2878(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2958(0x0028)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2980(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2A70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2A90(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2AB0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x2AD8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x2B18(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x2B60(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2BA0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x2BE8(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2BF8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x2C40(0x0010)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2C78(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x2CA0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2CB0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2CD0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2D10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2D30(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x2DF8(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x2ED8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2FA0(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x3080(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3148(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x3228(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x32F0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3318(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3360(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3468(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3490(0x0028)()

public:
	void AnimGraph(const struct FPoseLink& Idle, const struct FPoseLink& Moving, const struct FPoseLink& Look, const struct FPoseLink& Additional, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_player_bh(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_player_bh_C">();
	}
	static class UAnimBP_player_bh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_player_bh_C>();
	}
};
static_assert(alignof(UAnimBP_player_bh_C) == 0x000010, "Wrong alignment on UAnimBP_player_bh_C");
static_assert(sizeof(UAnimBP_player_bh_C) == 0x0034C0, "Wrong size on UAnimBP_player_bh_C");
static_assert(offsetof(UAnimBP_player_bh_C, UberGraphFrame) == 0x001480, "Member 'UAnimBP_player_bh_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, __AnimBlueprintMutables) == 0x001488, "Member 'UAnimBP_player_bh_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimBlueprintExtension_PropertyAccess) == 0x0014C0, "Member 'UAnimBP_player_bh_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimBlueprintExtension_Base) == 0x0014C8, "Member 'UAnimBP_player_bh_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Root) == 0x0014D0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LinkedInputPose_3) == 0x0014F0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LinkedInputPose_2) == 0x0015B8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot_5) == 0x001680, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LinkedInputPose_1) == 0x0016C8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyMeshSpaceAdditive_2) == 0x001790, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyMeshSpaceAdditive_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyMeshSpaceAdditive_1) == 0x001860, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyMeshSpaceAdditive_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot_4) == 0x001930, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LinkedInputPose) == 0x001978, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot_3) == 0x001A40, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_7) == 0x001A88, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_7' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SaveCachedPose_4) == 0x001B68, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_6) == 0x001C70, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_6' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SaveCachedPose_3) == 0x001D50, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x001E58, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_9) == 0x001F28, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequencePlayer_2) == 0x001F70, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_IdentityPose_3) == 0x001FB8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_IdentityPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_8) == 0x001FC8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequencePlayer_1) == 0x002010, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_7) == 0x002058, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequencePlayer) == 0x0020A0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_6) == 0x0020E8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequenceEvaluator_4) == 0x002130, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequenceEvaluator_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequenceEvaluator_3) == 0x002170, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_5) == 0x0021B0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_5) == 0x002290, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot_2) == 0x0022D8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SaveCachedPose_2) == 0x002320, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_14) == 0x002428, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_14' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_13) == 0x002450, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_13' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_12) == 0x002478, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_11) == 0x0024A0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_4) == 0x0024C8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_10) == 0x002510, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_9) == 0x002538, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_4) == 0x002560, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot_1) == 0x002640, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SaveCachedPose_1) == 0x002688, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_8) == 0x002790, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_7) == 0x0027B8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_Slot) == 0x0027E0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_6) == 0x002828, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_5) == 0x002850, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_3) == 0x002878, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_4) == 0x002958, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_CopyBone) == 0x002980, "Member 'UAnimBP_player_bh_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LocalToComponentSpace) == 0x002A70, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ComponentToLocalSpace) == 0x002A90, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_3) == 0x002AB0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequenceEvaluator_2) == 0x002AD8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_3) == 0x002B18, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequenceEvaluator_1) == 0x002B60, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_2) == 0x002BA0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_IdentityPose_2) == 0x002BE8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_IdentityPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool_1) == 0x002BF8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_IdentityPose_1) == 0x002C40, "Member 'UAnimBP_player_bh_C::AnimGraphNode_IdentityPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_TransitionResult_1) == 0x002C50, "Member 'UAnimBP_player_bh_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_TransitionResult) == 0x002C78, "Member 'UAnimBP_player_bh_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_IdentityPose) == 0x002CA0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_StateResult_1) == 0x002CB0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SequenceEvaluator) == 0x002CD0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_StateResult) == 0x002D10, "Member 'UAnimBP_player_bh_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_StateMachine) == 0x002D30, "Member 'UAnimBP_player_bh_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_2) == 0x002DF8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyAdditive_2) == 0x002ED8, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyAdditive_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend_1) == 0x002FA0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyAdditive_1) == 0x003080, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_LayeredBoneBlend) == 0x003148, "Member 'UAnimBP_player_bh_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_ApplyAdditive) == 0x003228, "Member 'UAnimBP_player_bh_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_2) == 0x0032F0, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_BlendListByBool) == 0x003318, "Member 'UAnimBP_player_bh_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_SaveCachedPose) == 0x003360, "Member 'UAnimBP_player_bh_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose_1) == 0x003468, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_player_bh_C, AnimGraphNode_UseCachedPose) == 0x003490, "Member 'UAnimBP_player_bh_C::AnimGraphNode_UseCachedPose' has a wrong offset!");

}

