#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Bandage

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Bandage.AnimBP_Bandage_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct AnimBP_Bandage::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_11;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   m_StructProperty_12;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           m_ByteProperty_13;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_14;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_15;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_16;                             // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_17;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_18;                                 // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_19;                                 // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_20;                                 // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Bandage::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on AnimBP_Bandage::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_NameProperty_11) == 0x000004, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_NameProperty_11' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_StructProperty_12) == 0x000010, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_StructProperty_12' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_ByteProperty_13) == 0x000030, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_ByteProperty_13' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_BoolProperty_14) == 0x000031, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_BoolProperty_14' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_FloatProperty_15) == 0x000034, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_FloatProperty_15' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_16) == 0x000038, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_16' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_BoolProperty_17) == 0x000040, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_BoolProperty_17' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_EnumProperty_18) == 0x000041, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_EnumProperty_18' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_ByteProperty_19) == 0x000042, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_ByteProperty_19' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, m_NameProperty_20) == 0x000044, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::m_NameProperty_20' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Bandage::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'AnimBP_Bandage::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

