#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Medkit_fp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Medkit_fp.AnimBP_Medkit_fp_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_11;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           m_ByteProperty_12;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_13;                                 // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_14;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_15;                             // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_16;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_17;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_18;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_19;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   m_StructProperty_20;                               // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_NameProperty_11) == 0x000004, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_NameProperty_11' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_ByteProperty_12) == 0x00000C, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_ByteProperty_12' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_BoolProperty_13) == 0x00000D, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_BoolProperty_13' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_FloatProperty_14) == 0x000010, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_FloatProperty_14' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_15) == 0x000018, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_15' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_BoolProperty_16) == 0x000020, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_BoolProperty_16' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_EnumProperty_17) == 0x000021, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_EnumProperty_17' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_ByteProperty_18) == 0x000022, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_ByteProperty_18' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_NameProperty_19) == 0x000024, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_NameProperty_19' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, m_StructProperty_20) == 0x000030, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::m_StructProperty_20' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'AnimBP_Medkit_fp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

