#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_player_bh

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_player_bh.AnimBP_player_bh_C.AnimBlueprintGeneratedConstantData
// 0x01A7 (0x01A8 - 0x0001)
struct AnimBP_player_bh::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_350;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_351;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          m_StructProperty_352;                              // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         m_FloatProperty_353;                               // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_354;                               // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      m_AnimSequenceBase_355;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_356;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_357;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      m_AnimSequenceBase_358;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_359;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	ERefPoseType                                  m_ByteProperty_360;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_361;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_362;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_363;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           m_ByteProperty_364;                                // 0x00AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_365;                                // 0x00AD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_366;                                // 0x00AE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_367;                                // 0x00AF(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_368;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_369;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_370;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          m_BlendProfile_371;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            m_CurveFloat_372;                                  // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_373;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             m_EnumProperty_374;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      m_EnumProperty_375;                                // 0x00DA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_376;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   m_StructProperty_377;                              // 0x00F0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0110(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0190(0x0018)()
};
static_assert(alignof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_player_bh::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData) == 0x0001A8, "Wrong size on AnimBP_player_bh::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_NameProperty_350) == 0x000004, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_NameProperty_350' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_351) == 0x000010, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_351' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_StructProperty_352) == 0x000020, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_StructProperty_352' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_FloatProperty_353) == 0x00004C, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_FloatProperty_353' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_354) == 0x000050, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_354' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_355) == 0x000060, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_355' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_356) == 0x000068, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_356' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_357) == 0x000070, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_357' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_358) == 0x000080, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_358' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_359) == 0x000088, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_359' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ByteProperty_360) == 0x000098, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ByteProperty_360' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_NameProperty_361) == 0x00009C, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_NameProperty_361' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_IntProperty_362) == 0x0000A4, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_IntProperty_362' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_FloatProperty_363) == 0x0000A8, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_FloatProperty_363' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ByteProperty_364) == 0x0000AC, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ByteProperty_364' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_BoolProperty_365) == 0x0000AD, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_BoolProperty_365' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_EnumProperty_366) == 0x0000AE, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_EnumProperty_366' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ByteProperty_367) == 0x0000AF, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ByteProperty_367' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_NameProperty_368) == 0x0000B0, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_NameProperty_368' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_NameProperty_369) == 0x0000B8, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_NameProperty_369' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_IntProperty_370) == 0x0000C0, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_IntProperty_370' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_BlendProfile_371) == 0x0000C8, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_BlendProfile_371' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_CurveFloat_372) == 0x0000D0, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_CurveFloat_372' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_BoolProperty_373) == 0x0000D8, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_BoolProperty_373' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_EnumProperty_374) == 0x0000D9, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_EnumProperty_374' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_EnumProperty_375) == 0x0000DA, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_EnumProperty_375' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_376) == 0x0000E0, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_376' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, m_StructProperty_377) == 0x0000F0, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::m_StructProperty_377' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000110, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000190, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_player_bh.AnimBP_player_bh_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct AnimBP_player_bh::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          m_BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_5;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_6;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_7;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_8;                                  // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_9;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_10;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_11;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_12;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_13;                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_14;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on AnimBP_player_bh::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on AnimBP_player_bh::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty) == 0x000001, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_0) == 0x000002, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_0' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_1) == 0x000003, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_2) == 0x000004, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_2' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_FloatProperty_3) == 0x000008, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_FloatProperty_3' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_FloatProperty_4) == 0x00000C, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_FloatProperty_4' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_5) == 0x000010, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_5' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_6) == 0x000011, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_6' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_FloatProperty_7) == 0x000014, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_FloatProperty_7' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_8) == 0x000018, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_8' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_FloatProperty_9) == 0x00001C, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_FloatProperty_9' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_10) == 0x000020, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_10' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_11) == 0x000021, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_11' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_FloatProperty_12) == 0x000024, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_FloatProperty_12' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_AnimSequenceBase_13) == 0x000028, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_AnimSequenceBase_13' has a wrong offset!");
static_assert(offsetof(AnimBP_player_bh::FAnimBlueprintGeneratedMutableData, m_BoolProperty_14) == 0x000030, "Member 'AnimBP_player_bh::FAnimBlueprintGeneratedMutableData::m_BoolProperty_14' has a wrong offset!");

}

