#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_AK74

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Player_AK74.AnimBP_Player_AK74_C.ExecuteUbergraph_AnimBP_Player_AK74
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74) == 0x000004, "Wrong alignment on AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74");
static_assert(sizeof(AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74) == 0x000004, "Wrong size on AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74");
static_assert(offsetof(AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74, EntryPoint) == 0x000000, "Member 'AnimBP_Player_AK74_C_ExecuteUbergraph_AnimBP_Player_AK74::EntryPoint' has a wrong offset!");

// Function AnimBP_Player_AK74.AnimBP_Player_AK74_C.AnimGraph
// 0x0040 (0x0040 - 0x0000)
struct AnimBP_Player_AK74_C_AnimGraph final
{
public:
	struct FPoseLink                              Idle;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Moving;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Look;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_Player_AK74_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_Player_AK74_C_AnimGraph");
static_assert(sizeof(AnimBP_Player_AK74_C_AnimGraph) == 0x000040, "Wrong size on AnimBP_Player_AK74_C_AnimGraph");
static_assert(offsetof(AnimBP_Player_AK74_C_AnimGraph, Idle) == 0x000000, "Member 'AnimBP_Player_AK74_C_AnimGraph::Idle' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_AK74_C_AnimGraph, Moving) == 0x000010, "Member 'AnimBP_Player_AK74_C_AnimGraph::Moving' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_AK74_C_AnimGraph, Look) == 0x000020, "Member 'AnimBP_Player_AK74_C_AnimGraph::Look' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_AK74_C_AnimGraph, AnimGraph_0) == 0x000030, "Member 'AnimBP_Player_AK74_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

