#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_viper_tp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_viper_tp.AnimBP_viper_tp_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_106;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_107;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_108;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_109;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_110;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_111;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_112;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_113;                               // 0x0050(0x0010)(BlueprintVisible)
	class UBlendProfile*                          __BlendProfile_114;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_115;                                  // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_116;                                // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_117;                                // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_118;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_119;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_120;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_121;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_122;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_123;                            // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_124;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_125;                                // 0x00B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_126;                                // 0x00BA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_127;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000004, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_107) == 0x000010, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_107' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_108) == 0x000018, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_108' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_109) == 0x000028, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_109' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_110) == 0x000030, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_110' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_111) == 0x000038, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_111' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_112) == 0x000040, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_112' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_113) == 0x000050, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_113' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __BlendProfile_114) == 0x000060, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__BlendProfile_114' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __CurveFloat_115) == 0x000068, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__CurveFloat_115' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __EnumProperty_116) == 0x000070, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__EnumProperty_116' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __EnumProperty_117) == 0x000071, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__EnumProperty_117' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_118) == 0x000078, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_118' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __StructProperty_119) == 0x000088, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__StructProperty_119' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ByteProperty_120) == 0x0000A8, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ByteProperty_120' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __BoolProperty_121) == 0x0000A9, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__BoolProperty_121' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __FloatProperty_122) == 0x0000AC, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__FloatProperty_122' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_123) == 0x0000B0, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_123' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __BoolProperty_124) == 0x0000B8, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__BoolProperty_124' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __EnumProperty_125) == 0x0000B9, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__EnumProperty_125' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __ByteProperty_126) == 0x0000BA, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__ByteProperty_126' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, __NameProperty_127) == 0x0000BC, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::__NameProperty_127' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_viper_tp.AnimBP_viper_tp_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000003, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'AnimBP_viper_tp::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

}

