#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lever_Vertical

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Lever_Vertical.AnimBP_Lever_Vertical_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_44;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_45;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_46;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_47;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_48;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_49;                                // 0x0038(0x0010)(BlueprintVisible)
	bool                                          __BoolProperty_50;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_51;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_52;                               // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_53;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_54;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_55;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_56;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_57;                                 // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_58;                               // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __BlendProfile_44) == 0x000010, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__BlendProfile_44' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __CurveFloat_45) == 0x000018, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__CurveFloat_45' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __EnumProperty_46) == 0x000020, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__EnumProperty_46' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x000021, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __ArrayProperty_48) == 0x000028, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__ArrayProperty_48' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __ArrayProperty_49) == 0x000038, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__ArrayProperty_49' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __BoolProperty_50) == 0x000048, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__BoolProperty_50' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __FloatProperty_51) == 0x00004C, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__FloatProperty_51' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __StructProperty_52) == 0x000050, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__StructProperty_52' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __FloatProperty_53) == 0x00007C, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__FloatProperty_53' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __BoolProperty_54) == 0x000080, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__BoolProperty_54' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __EnumProperty_55) == 0x000081, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__EnumProperty_55' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __ByteProperty_56) == 0x000082, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__ByteProperty_56' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __NameProperty_57) == 0x000084, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__NameProperty_57' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, __StructProperty_58) == 0x000090, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::__StructProperty_58' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Lever_Vertical.AnimBP_Lever_Vertical_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'AnimBP_Lever_Vertical::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");

}

