#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_Shadow

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Player_Shadow.AnimBP_Player_Shadow_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_Player_Shadow_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_Player_Shadow_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_Player_Shadow_C_AnimGraph");
static_assert(sizeof(AnimBP_Player_Shadow_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_Player_Shadow_C_AnimGraph");
static_assert(offsetof(AnimBP_Player_Shadow_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_Player_Shadow_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_Player_Shadow.AnimBP_Player_Shadow_C.ExecuteUbergraph_AnimBP_Player_Shadow
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow) == 0x000004, "Wrong alignment on AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow");
static_assert(sizeof(AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow) == 0x000004, "Wrong size on AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow");
static_assert(offsetof(AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow, EntryPoint) == 0x000000, "Member 'AnimBP_Player_Shadow_C_ExecuteUbergraph_AnimBP_Player_Shadow::EntryPoint' has a wrong offset!");

}

