#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Human

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Human.AnimBP_Human_C.AnimBlueprintGeneratedConstantData
// 0x040F (0x0410 - 0x0001)
struct AnimBP_Human::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2505;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2506;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2507;                               // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2508;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2509;                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2510;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2511;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2512;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2513;                               // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2514;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2515;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2516;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2517;                               // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2518;                              // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2519;                               // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2520;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2521;                              // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2522;                              // 0x0090(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2523;                              // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               __EnumProperty_2524;                               // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2525;                               // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2526;                              // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2527;                              // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2528;                              // 0x00E0(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2529;                              // 0x00F0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2530;                               // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2531;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2532;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2533;                              // 0x0118(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2534;                              // 0x0128(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2535;                               // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2536;                               // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2537;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2538;                              // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2539;                              // 0x0160(0x0010)(BlueprintVisible)
	TArray<int32>                                 __ArrayProperty_2540;                              // 0x0170(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_2541;                              // 0x0180(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_2542;                              // 0x0190(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2543;                              // 0x01A0(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_2544;                               // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2545;                               // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2546;                               // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2547;                                // 0x01C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2548;                               // 0x01CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2549;                                // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2550;                               // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2551;                                // 0x01E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2552;                               // 0x01E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2553;                                // 0x01EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2554;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2555;                               // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2556;                                // 0x0200(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2557;                              // 0x0208(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2558;                              // 0x0218(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_2559;                              // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2560;                              // 0x0230(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2561;                              // 0x0240(0x0010)(BlueprintVisible)
	ERefPoseType                                  __ByteProperty_2562;                               // 0x0250(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2563;                              // 0x0258(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_2564;                             // 0x0268(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_2565;                              // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2566;                              // 0x0298(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_2567;                              // 0x02A8(0x0010)(BlueprintVisible)
	ESequenceEvalReinit                           __ByteProperty_2568;                               // 0x02B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2569;                               // 0x02B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2570;                              // 0x02BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2571;                               // 0x02C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_2572;                               // 0x02C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2573;                               // 0x02C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2574;                             // 0x02D0(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_2575;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2576;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_2577;                               // 0x0300(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2578;                               // 0x0301(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2579;                               // 0x0302(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x5];                                      // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2580;                              // 0x0308(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0318(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x03F8(0x0018)()
};
static_assert(alignof(AnimBP_Human::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Human::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Human::FAnimBlueprintGeneratedConstantData) == 0x000410, "Wrong size on AnimBP_Human::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2505) == 0x000004, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2505' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2506) == 0x00000C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2506' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2507) == 0x000014, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2507' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2508) == 0x00001C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2508' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2509) == 0x000024, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2509' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2510) == 0x00002C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2510' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2511) == 0x000030, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2511' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2512) == 0x000038, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2512' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2513) == 0x00003C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2513' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2514) == 0x000044, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2514' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2515) == 0x00004C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2515' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2516) == 0x000054, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2516' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __EnumProperty_2517) == 0x00005C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__EnumProperty_2517' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2518) == 0x000060, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2518' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2519) == 0x000070, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2519' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2520) == 0x000078, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2520' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2521) == 0x000080, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2521' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2522) == 0x000090, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2522' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2523) == 0x0000A0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2523' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __EnumProperty_2524) == 0x0000B0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__EnumProperty_2524' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2525) == 0x0000B4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2525' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2526) == 0x0000C0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2526' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2527) == 0x0000D0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2527' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2528) == 0x0000E0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2528' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2529) == 0x0000F0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2529' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2530) == 0x000100, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2530' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2531) == 0x000108, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2531' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2532) == 0x000110, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2532' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2533) == 0x000118, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2533' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2534) == 0x000128, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2534' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2535) == 0x000138, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2535' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2536) == 0x000140, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2536' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2537) == 0x000148, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2537' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2538) == 0x000150, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2538' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2539) == 0x000160, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2539' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2540) == 0x000170, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2540' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2541) == 0x000180, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2541' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2542) == 0x000190, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2542' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2543) == 0x0001A0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2543' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2544) == 0x0001B0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2544' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2545) == 0x0001B8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2545' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2546) == 0x0001C0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2546' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2547) == 0x0001C8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2547' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2548) == 0x0001CC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2548' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2549) == 0x0001D4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2549' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2550) == 0x0001D8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2550' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2551) == 0x0001E0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2551' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2552) == 0x0001E4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2552' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2553) == 0x0001EC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2553' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2554) == 0x0001F0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2554' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2555) == 0x0001F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2555' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __IntProperty_2556) == 0x000200, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__IntProperty_2556' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2557) == 0x000208, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2557' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2558) == 0x000218, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2558' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __FloatProperty_2559) == 0x000228, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__FloatProperty_2559' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2560) == 0x000230, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2560' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2561) == 0x000240, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2561' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ByteProperty_2562) == 0x000250, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ByteProperty_2562' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2563) == 0x000258, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2563' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __StructProperty_2564) == 0x000268, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__StructProperty_2564' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __FloatProperty_2565) == 0x000294, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__FloatProperty_2565' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2566) == 0x000298, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2566' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2567) == 0x0002A8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2567' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ByteProperty_2568) == 0x0002B8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ByteProperty_2568' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __BoolProperty_2569) == 0x0002B9, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__BoolProperty_2569' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __FloatProperty_2570) == 0x0002BC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__FloatProperty_2570' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __EnumProperty_2571) == 0x0002C0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__EnumProperty_2571' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ByteProperty_2572) == 0x0002C1, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ByteProperty_2572' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __NameProperty_2573) == 0x0002C4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__NameProperty_2573' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __StructProperty_2574) == 0x0002D0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__StructProperty_2574' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __BlendProfile_2575) == 0x0002F0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__BlendProfile_2575' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __CurveFloat_2576) == 0x0002F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__CurveFloat_2576' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __BoolProperty_2577) == 0x000300, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__BoolProperty_2577' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __EnumProperty_2578) == 0x000301, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__EnumProperty_2578' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __EnumProperty_2579) == 0x000302, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__EnumProperty_2579' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2580) == 0x000308, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2580' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000318, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0003F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Human.AnimBP_Human_C.AnimBlueprintGeneratedMutableData
// 0x016F (0x0170 - 0x0001)
struct AnimBP_Human::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_10;                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __Object_11;                                       // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __Object_13;                                       // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_14;                             // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_15;                             // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_20;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_22;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_23;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0071(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_25;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_27;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_29;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_30;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_31;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_32;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_33;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_35;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_37;                                 // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_38;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_40;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_42;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_43;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_45;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_46;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_48;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_49;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_50;                                 // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_51;                                 // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_52;                                // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_53;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_54;                                 // 0x00E4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_55;                                 // 0x00E5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_56;                                // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_57;                                 // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_58;                                 // 0x00F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_59;                                 // 0x00FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_60;                                 // 0x00FB(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_61;                                 // 0x00FC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_62;                                 // 0x00FD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_63;                                 // 0x00FE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_64;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_65;                                 // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_66;                             // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_67;                             // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         __ByteProperty_68;                                 // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_69;                                 // 0x0119(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_70;                                 // 0x011A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_71;                                 // 0x011B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_72;                                 // 0x011C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_73;                                 // 0x011D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_74;                                 // 0x011E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_75;                                 // 0x011F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_76;                                 // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_77;                                 // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_78;                                 // 0x0122(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_79;                                 // 0x0123(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_80;                                 // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_81;                                 // 0x0125(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_82;                                 // 0x0126(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_83;                                 // 0x0127(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __Object_84;                                       // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __Object_85;                                       // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_86;                             // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_87;                             // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_88;                                 // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_89;                                 // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_90;                                 // 0x014A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __Object_91;                                       // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_92;                             // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_93;                             // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                __Object_94;                                       // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Human::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on AnimBP_Human::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Human::FAnimBlueprintGeneratedMutableData) == 0x000170, "Wrong size on AnimBP_Human::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AnimBP_Human::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'AnimBP_Human::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
