#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_AK74_fp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_AK74_fp.AnimBP_AK74_fp_C.ExecuteUbergraph_AnimBP_AK74_fp
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp) == 0x000004, "Wrong alignment on AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp");
static_assert(sizeof(AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp) == 0x000004, "Wrong size on AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp");
static_assert(offsetof(AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp, EntryPoint) == 0x000000, "Member 'AnimBP_AK74_fp_C_ExecuteUbergraph_AnimBP_AK74_fp::EntryPoint' has a wrong offset!");

// Function AnimBP_AK74_fp.AnimBP_AK74_fp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_AK74_fp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_AK74_fp_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_AK74_fp_C_AnimGraph");
static_assert(sizeof(AnimBP_AK74_fp_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_AK74_fp_C_AnimGraph");
static_assert(offsetof(AnimBP_AK74_fp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_AK74_fp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

