#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Codelock

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Codelock.AnimBP_Codelock_C
// 0x00D0 (0x04E0 - 0x0410)
class UAnimBP_Codelock_C final : public UAnimInstanceCodelock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0418(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0420(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0448(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0490(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_Codelock(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Codelock_C">();
	}
	static class UAnimBP_Codelock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Codelock_C>();
	}
};
static_assert(alignof(UAnimBP_Codelock_C) == 0x000010, "Wrong alignment on UAnimBP_Codelock_C");
static_assert(sizeof(UAnimBP_Codelock_C) == 0x0004E0, "Wrong size on UAnimBP_Codelock_C");
static_assert(offsetof(UAnimBP_Codelock_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Codelock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Codelock_C, AnimBlueprintExtension_PropertyAccess) == 0x000418, "Member 'UAnimBP_Codelock_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_Codelock_C, AnimBlueprintExtension_Base) == 0x000420, "Member 'UAnimBP_Codelock_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_Codelock_C, AnimGraphNode_Root) == 0x000428, "Member 'UAnimBP_Codelock_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_Codelock_C, AnimGraphNode_Slot) == 0x000448, "Member 'UAnimBP_Codelock_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_Codelock_C, AnimGraphNode_SequencePlayer) == 0x000490, "Member 'UAnimBP_Codelock_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

