#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Military_Radio

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Military_Radio.AnimBP_Military_Radio_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_44;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_45;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_46;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_47;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_48;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_49;                                // 0x0038(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_50;                               // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_51;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_52;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_53;                               // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_54;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_55;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_56;                                 // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_57;                                 // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_58;                                 // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __BlendProfile_44) == 0x000010, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__BlendProfile_44' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __CurveFloat_45) == 0x000018, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__CurveFloat_45' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __EnumProperty_46) == 0x000020, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__EnumProperty_46' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x000021, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __ArrayProperty_48) == 0x000028, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__ArrayProperty_48' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __ArrayProperty_49) == 0x000038, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__ArrayProperty_49' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __StructProperty_50) == 0x000048, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__StructProperty_50' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __BoolProperty_51) == 0x000068, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__BoolProperty_51' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __FloatProperty_52) == 0x00006C, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__FloatProperty_52' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __StructProperty_53) == 0x000070, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__StructProperty_53' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __FloatProperty_54) == 0x00009C, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__FloatProperty_54' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __BoolProperty_55) == 0x0000A0, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__BoolProperty_55' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __EnumProperty_56) == 0x0000A1, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__EnumProperty_56' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __ByteProperty_57) == 0x0000A2, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__ByteProperty_57' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, __NameProperty_58) == 0x0000A4, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::__NameProperty_58' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Military_Radio.AnimBP_Military_Radio_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'AnimBP_Military_Radio::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");

}

