#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Human

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Human.AnimBP_Human_C.AnimBlueprintGeneratedConstantData
// 0x03FF (0x0400 - 0x0001)
struct AnimBP_Human::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_2490;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2491;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2492;                               // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2493;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2494;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2495;                               // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2496;                               // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2497;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2498;                               // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2499;                               // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             m_EnumProperty_2500;                               // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2501;                              // 0x0058(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   m_NameProperty_2502;                               // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2503;                               // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_2504;                              // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2505;                              // 0x0088(0x0010)(BlueprintVisible)
	TArray<float>                                 m_ArrayProperty_2506;                              // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               m_EnumProperty_2507;                               // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_2508;                               // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2509;                              // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 m_ArrayProperty_2510;                              // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2511;                              // 0x00D8(0x0010)(BlueprintVisible)
	TArray<float>                                 m_ArrayProperty_2512;                              // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   m_NameProperty_2513;                               // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2514;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2515;                              // 0x0108(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2516;                              // 0x0118(0x0010)(BlueprintVisible)
	TArray<int32>                                 m_ArrayProperty_2517;                              // 0x0128(0x0010)(BlueprintVisible)
	TArray<float>                                 m_ArrayProperty_2518;                              // 0x0138(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 m_ArrayProperty_2519;                              // 0x0148(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2520;                              // 0x0158(0x0010)(BlueprintVisible)
	class FName                                   m_NameProperty_2521;                               // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2522;                               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2523;                               // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2524;                                // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2525;                               // 0x0184(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2526;                                // 0x018C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2527;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2528;                                // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2529;                               // 0x019C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2530;                                // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2531;                               // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2532;                               // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2533;                               // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2534;                                // 0x01C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_2535;                               // 0x01C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_2536;                                // 0x01CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_2537;                              // 0x01D0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 m_ArrayProperty_2538;                              // 0x01E0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   m_NameProperty_2539;                               // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_2540;                              // 0x01F8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2541;                              // 0x0208(0x0010)(BlueprintVisible)
	float                                         m_FloatProperty_2542;                              // 0x0218(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2543;                              // 0x0220(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2544;                              // 0x0230(0x0010)(BlueprintVisible)
	ERefPoseType                                  m_ByteProperty_2545;                               // 0x0240(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2546;                              // 0x0248(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          m_StructProperty_2547;                             // 0x0258(0x002C)(BlueprintVisible, NoDestructor)
	float                                         m_FloatProperty_2548;                              // 0x0284(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_2549;                              // 0x0288(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 m_ArrayProperty_2550;                              // 0x0298(0x0010)(BlueprintVisible)
	class UBlendProfile*                          m_BlendProfile_2551;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            m_CurveFloat_2552;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             m_EnumProperty_2553;                               // 0x02B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      m_EnumProperty_2554;                               // 0x02B9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_2555;                              // 0x02C0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   m_StructProperty_2556;                             // 0x02D0(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           m_ByteProperty_2557;                               // 0x02F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_2558;                               // 0x02F1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_2559;                              // 0x02F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_2560;                               // 0x02F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_2561;                               // 0x02F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_2562;                               // 0x02FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_2563;                               // 0x02FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0308(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x03E8(0x0018)()
};
static_assert(alignof(AnimBP_Human::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Human::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Human::FAnimBlueprintGeneratedConstantData) == 0x000400, "Wrong size on AnimBP_Human::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2490) == 0x000004, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2490' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2491) == 0x00000C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2491' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2492) == 0x000014, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2492' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2493) == 0x00001C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2493' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2494) == 0x000024, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2494' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2495) == 0x000028, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2495' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2496) == 0x000030, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2496' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2497) == 0x000038, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2497' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2498) == 0x000040, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2498' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2499) == 0x000048, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2499' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_EnumProperty_2500) == 0x000050, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_EnumProperty_2500' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2501) == 0x000058, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2501' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2502) == 0x000068, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2502' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2503) == 0x000070, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2503' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2504) == 0x000078, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2504' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2505) == 0x000088, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2505' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2506) == 0x000098, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2506' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_EnumProperty_2507) == 0x0000A8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_EnumProperty_2507' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2508) == 0x0000AC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2508' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2509) == 0x0000B8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2509' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2510) == 0x0000C8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2510' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2511) == 0x0000D8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2511' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2512) == 0x0000E8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2512' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2513) == 0x0000F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2513' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2514) == 0x000100, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2514' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2515) == 0x000108, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2515' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2516) == 0x000118, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2516' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2517) == 0x000128, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2517' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2518) == 0x000138, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2518' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2519) == 0x000148, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2519' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2520) == 0x000158, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2520' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2521) == 0x000168, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2521' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2522) == 0x000170, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2522' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2523) == 0x000178, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2523' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2524) == 0x000180, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2524' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2525) == 0x000184, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2525' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2526) == 0x00018C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2526' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2527) == 0x000190, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2527' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2528) == 0x000198, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2528' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2529) == 0x00019C, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2529' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2530) == 0x0001A4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2530' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2531) == 0x0001A8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2531' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2532) == 0x0001B0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2532' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2533) == 0x0001B8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2533' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2534) == 0x0001C0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2534' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2535) == 0x0001C4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2535' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_IntProperty_2536) == 0x0001CC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_IntProperty_2536' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2537) == 0x0001D0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2537' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2538) == 0x0001E0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2538' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2539) == 0x0001F0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2539' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2540) == 0x0001F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2540' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2541) == 0x000208, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2541' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_FloatProperty_2542) == 0x000218, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_FloatProperty_2542' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2543) == 0x000220, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2543' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2544) == 0x000230, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2544' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ByteProperty_2545) == 0x000240, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ByteProperty_2545' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2546) == 0x000248, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2546' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_StructProperty_2547) == 0x000258, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_StructProperty_2547' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_FloatProperty_2548) == 0x000284, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_FloatProperty_2548' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2549) == 0x000288, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2549' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2550) == 0x000298, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2550' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_BlendProfile_2551) == 0x0002A8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_BlendProfile_2551' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_CurveFloat_2552) == 0x0002B0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_CurveFloat_2552' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_EnumProperty_2553) == 0x0002B8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_EnumProperty_2553' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_EnumProperty_2554) == 0x0002B9, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_EnumProperty_2554' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_2555) == 0x0002C0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_2555' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_StructProperty_2556) == 0x0002D0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_StructProperty_2556' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ByteProperty_2557) == 0x0002F0, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ByteProperty_2557' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_BoolProperty_2558) == 0x0002F1, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_BoolProperty_2558' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_FloatProperty_2559) == 0x0002F4, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_FloatProperty_2559' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_BoolProperty_2560) == 0x0002F8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_BoolProperty_2560' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_EnumProperty_2561) == 0x0002F9, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_EnumProperty_2561' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_ByteProperty_2562) == 0x0002FA, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_ByteProperty_2562' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, m_NameProperty_2563) == 0x0002FC, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::m_NameProperty_2563' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000308, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0003E8, "Member 'AnimBP_Human::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Human.AnimBP_Human_C.AnimBlueprintGeneratedMutableData
// 0x0187 (0x0188 - 0x0001)
struct AnimBP_Human::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          m_BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_1;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_2;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_3;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_7;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_8;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_9;                                  // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_10;                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                m_Object_11;                                       // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_12;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                m_Object_13;                                       // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_14;                             // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_15;                             // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_16;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_17;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_18;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_19;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_20;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_21;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_22;                                 // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_23;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_24;                                 // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_25;                                 // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_26;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_27;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_28;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_29;                                 // 0x0084(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_30;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_31;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_32;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_33;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_34;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_35;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_36;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_37;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_38;                                 // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_39;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_40;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_41;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_42;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_43;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_44;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_45;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_46;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_47;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_48;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_49;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_50;                                // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_51;                                 // 0x00DC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_52;                                 // 0x00DD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_53;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_54;                                // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_55;                                 // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_56;                             // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_57;                             // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_58;                                 // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_59;                                 // 0x0101(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_60;                                 // 0x0102(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_61;                                 // 0x0103(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_62;                                 // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_63;                                 // 0x0105(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_64;                                 // 0x0106(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_65;                                 // 0x0107(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_66;                                 // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_67;                                 // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_68;                                 // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_69;                                 // 0x010B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_70;                                 // 0x010C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_71;                                 // 0x010D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_72;                                // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          m_BoolProperty_73;                                 // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_74;                                 // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_75;                                 // 0x0122(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_76;                                 // 0x0123(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_77;                                 // 0x0124(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_78;                                 // 0x0125(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_79;                                 // 0x0126(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_80;                                 // 0x0127(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_81;                                 // 0x0128(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_82;                                 // 0x0129(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                m_Object_83;                                       // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                m_Object_84;                                       // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_85;                             // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_86;                             // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_87;                                 // 0x0150(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                m_Object_88;                                       // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_89;                                 // 0x0160(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_90;                             // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         m_ByteProperty_91;                                 // 0x0170(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                m_Object_92;                                       // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_93;                             // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Human::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on AnimBP_Human::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Human::FAnimBlueprintGeneratedMutableData) == 0x000188, "Wrong size on AnimBP_Human::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedMutableData, m_BoolProperty) == 0x000001, "Member 'AnimBP_Human::FAnimBlueprintGeneratedMutableData::m_BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_Human::FAnimBlueprintGeneratedMutableData, m_FloatProperty_0) == 0x000004, "Member 'AnimBP_Human::FAnimBlueprintGeneratedMutableData::m_FloatProperty_0' has a wrong offset!");
