#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_BunkerDoor_1

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_BunkerDoor_1.AnimBP_BunkerDoor_1_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_68;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_69;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_70;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_71;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_72;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_73;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_74;                                // 0x0038(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_75;                               // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_76;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_77;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_78;                               // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_79;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_80;                                 // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_81;                                 // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_82;                                 // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_83;                                 // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __NameProperty_68) == 0x000004, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__NameProperty_68' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __BlendProfile_69) == 0x000010, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__BlendProfile_69' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __CurveFloat_70) == 0x000018, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__CurveFloat_70' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __EnumProperty_71) == 0x000020, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__EnumProperty_71' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __EnumProperty_72) == 0x000021, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__EnumProperty_72' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __ArrayProperty_73) == 0x000028, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__ArrayProperty_73' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __ArrayProperty_74) == 0x000038, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__ArrayProperty_74' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __StructProperty_75) == 0x000048, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__StructProperty_75' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __BoolProperty_76) == 0x000068, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__BoolProperty_76' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __FloatProperty_77) == 0x00006C, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__FloatProperty_77' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __StructProperty_78) == 0x000070, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__StructProperty_78' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __FloatProperty_79) == 0x00009C, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__FloatProperty_79' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __BoolProperty_80) == 0x0000A0, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__BoolProperty_80' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __EnumProperty_81) == 0x0000A1, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__EnumProperty_81' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __ByteProperty_82) == 0x0000A2, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__ByteProperty_82' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, __NameProperty_83) == 0x0000A4, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::__NameProperty_83' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_BunkerDoor_1.AnimBP_BunkerDoor_1_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         __ByteProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData, __ByteProperty) == 0x000001, "Member 'AnimBP_BunkerDoor_1::FAnimBlueprintGeneratedMutableData::__ByteProperty' has a wrong offset!");

}

