#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_bloodsucker

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_bloodsucker.AnimBP_bloodsucker_C.AnimBlueprintGeneratedConstantData
// 0x0237 (0x0238 - 0x0001)
struct AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_573;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_574;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMirrorDataTable*                       __MirrorDataTable_575;                             // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_576;                               // 0x0018(0x0010)(BlueprintVisible)
	TArray<int32>                                 __ArrayProperty_577;                               // 0x0028(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_578;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_579;                               // 0x0048(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_580;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_581;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_582;                               // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_583;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_584;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_585;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_586;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_587;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_588;                               // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_589;                              // 0x00A0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_590;                               // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_591;                                // 0x00D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_592;                                // 0x00D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_593;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_594;                                 // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_595;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_596;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_597;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_598;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_599;                                  // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_600;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_601;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_602;                                // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_603;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_604;                              // 0x0120(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0140(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x01A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0220(0x0018)()
};
static_assert(alignof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData) == 0x000238, "Wrong size on AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_573) == 0x000004, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_573' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __FloatProperty_574) == 0x00000C, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__FloatProperty_574' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __MirrorDataTable_575) == 0x000010, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__MirrorDataTable_575' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_576) == 0x000018, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_576' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_577) == 0x000028, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_577' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_578) == 0x000038, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_578' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_579) == 0x000048, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_579' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_580) == 0x000058, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_580' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_581) == 0x000060, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_581' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_582) == 0x000070, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_582' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_583) == 0x000080, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_583' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __IntProperty_584) == 0x000088, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__IntProperty_584' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_585) == 0x00008C, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_585' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __IntProperty_586) == 0x000094, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__IntProperty_586' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __BoolProperty_587) == 0x000098, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__BoolProperty_587' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __FloatProperty_588) == 0x00009C, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__FloatProperty_588' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __StructProperty_589) == 0x0000A0, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__StructProperty_589' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __FloatProperty_590) == 0x0000CC, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__FloatProperty_590' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __EnumProperty_591) == 0x0000D0, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__EnumProperty_591' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ByteProperty_592) == 0x0000D1, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ByteProperty_592' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_593) == 0x0000D4, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_593' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __IntProperty_594) == 0x0000DC, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__IntProperty_594' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_595) == 0x0000E0, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_595' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __NameProperty_596) == 0x0000E8, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__NameProperty_596' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __IntProperty_597) == 0x0000F0, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__IntProperty_597' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __BlendProfile_598) == 0x0000F8, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__BlendProfile_598' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __CurveFloat_599) == 0x000100, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__CurveFloat_599' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __BoolProperty_600) == 0x000108, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__BoolProperty_600' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __EnumProperty_601) == 0x000109, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__EnumProperty_601' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __EnumProperty_602) == 0x00010A, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__EnumProperty_602' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __ArrayProperty_603) == 0x000110, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__ArrayProperty_603' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, __StructProperty_604) == 0x000120, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::__StructProperty_604' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000140, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0001A0, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000220, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_bloodsucker.AnimBP_bloodsucker_C.AnimBlueprintGeneratedMutableData
// 0x000A (0x000B - 0x0001)
struct AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_4;                                  // 0x0006(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_5;                                  // 0x0007(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_6;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x000A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData) == 0x00000B, "Wrong size on AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x000003, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x000004, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x000005, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __ByteProperty_4) == 0x000006, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__ByteProperty_4' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __ByteProperty_5) == 0x000007, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__ByteProperty_5' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __BoolProperty_6) == 0x000008, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__BoolProperty_6' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x000009, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x00000A, "Member 'AnimBP_bloodsucker::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");

}

