#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_int_chest

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_int_chest.AnimBP_int_chest_C
// 0x0350 (0x06C0 - 0x0370)
class UAnimBP_int_chest_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0420(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0448(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0490(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x04B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0518(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0560(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0580(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05E8(0x00C8)()
	bool                                          bOpen;                                             // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Open();
	void ExecuteUbergraph_AnimBP_int_chest(int32 EntryPoint);
	void Close();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_int_chest_C">();
	}
	static class UAnimBP_int_chest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_int_chest_C>();
	}
};
static_assert(alignof(UAnimBP_int_chest_C) == 0x000010, "Wrong alignment on UAnimBP_int_chest_C");
static_assert(sizeof(UAnimBP_int_chest_C) == 0x0006C0, "Wrong size on UAnimBP_int_chest_C");
static_assert(offsetof(UAnimBP_int_chest_C, UberGraphFrame) == 0x000370, "Member 'UAnimBP_int_chest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UAnimBP_int_chest_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UAnimBP_int_chest_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_Root) == 0x000388, "Member 'UAnimBP_int_chest_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_TransitionResult_3) == 0x0003A8, "Member 'UAnimBP_int_chest_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_TransitionResult_2) == 0x0003D0, "Member 'UAnimBP_int_chest_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_TransitionResult_1) == 0x0003F8, "Member 'UAnimBP_int_chest_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_TransitionResult) == 0x000420, "Member 'UAnimBP_int_chest_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_SequencePlayer_3) == 0x000448, "Member 'UAnimBP_int_chest_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_StateResult_3) == 0x000490, "Member 'UAnimBP_int_chest_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_SequencePlayer_2) == 0x0004B0, "Member 'UAnimBP_int_chest_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_StateResult_2) == 0x0004F8, "Member 'UAnimBP_int_chest_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_SequencePlayer_1) == 0x000518, "Member 'UAnimBP_int_chest_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_StateResult_1) == 0x000560, "Member 'UAnimBP_int_chest_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_SequencePlayer) == 0x000580, "Member 'UAnimBP_int_chest_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_StateResult) == 0x0005C8, "Member 'UAnimBP_int_chest_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, AnimGraphNode_StateMachine) == 0x0005E8, "Member 'UAnimBP_int_chest_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAnimBP_int_chest_C, bOpen) == 0x0006B0, "Member 'UAnimBP_int_chest_C::bOpen' has a wrong offset!");

}

