#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_AK74_fp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_AK74_fp.AnimBP_AK74_fp_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __IntProperty_4;                                   // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_6;                                  // 0x0015(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0016(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __ByteProperty_1) == 0x00000C, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__ByteProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __ByteProperty_2) == 0x00000D, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__ByteProperty_2' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __ByteProperty_3) == 0x00000E, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__ByteProperty_3' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __IntProperty_4) == 0x000010, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__IntProperty_4' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000014, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __ByteProperty_6) == 0x000015, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__ByteProperty_6' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData, __ByteProperty_7) == 0x000016, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedMutableData::__ByteProperty_7' has a wrong offset!");

// ScriptStruct AnimBP_AK74_fp.AnimBP_AK74_fp_C.AnimBlueprintGeneratedConstantData
// 0x01E7 (0x01E8 - 0x0001)
struct AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_307;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_308;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_309;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_310;                            // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_311;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_312;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_313;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<int32>                                 __ArrayProperty_314;                               // 0x0040(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_315;                               // 0x0050(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_316;                               // 0x0060(0x0010)(BlueprintVisible)
	TArray<int32>                                 __ArrayProperty_317;                               // 0x0070(0x0010)(BlueprintVisible)
	class UAnimSequenceBase*                      __AnimSequenceBase_318;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_319;                               // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_320;                               // 0x0098(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_321;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_322;                               // 0x00B8(0x0010)(BlueprintVisible)
	class UAnimSequenceBase*                      __AnimSequenceBase_323;                            // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_324;                            // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_325;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_326;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_327;                               // 0x00DC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_328;                            // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_329;                                // 0x00E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_330;                                // 0x00E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_331;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_332;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_333;                                  // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_334;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_335;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_336;                                // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_337;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_338;                               // 0x0120(0x0010)(BlueprintVisible)
	struct FAnimNodeFunctionRef                   __StructProperty_339;                              // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0150(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
};
static_assert(alignof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData) == 0x0001E8, "Wrong size on AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x000004, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_308) == 0x000010, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_308' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_309) == 0x000018, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_309' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_310) == 0x000020, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_310' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_311) == 0x000028, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_311' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_312) == 0x000030, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_312' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_313) == 0x000038, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_313' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_314) == 0x000040, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_314' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_315) == 0x000050, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_315' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_316) == 0x000060, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_316' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_317) == 0x000070, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_317' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_318) == 0x000080, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_318' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_319) == 0x000088, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_319' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_320) == 0x000098, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_320' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_321) == 0x0000A8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_321' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_322) == 0x0000B8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_322' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_323) == 0x0000C8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_323' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_324) == 0x0000D0, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_324' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ByteProperty_325) == 0x0000D8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ByteProperty_325' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __BoolProperty_326) == 0x0000D9, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__BoolProperty_326' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __FloatProperty_327) == 0x0000DC, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__FloatProperty_327' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_328) == 0x0000E0, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_328' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __EnumProperty_329) == 0x0000E8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__EnumProperty_329' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ByteProperty_330) == 0x0000E9, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ByteProperty_330' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __NameProperty_331) == 0x0000EC, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__NameProperty_331' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __BlendProfile_332) == 0x0000F8, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__BlendProfile_332' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __CurveFloat_333) == 0x000100, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__CurveFloat_333' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __BoolProperty_334) == 0x000108, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__BoolProperty_334' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __EnumProperty_335) == 0x000109, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__EnumProperty_335' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __EnumProperty_336) == 0x00010A, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__EnumProperty_336' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_337) == 0x000110, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_337' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __ArrayProperty_338) == 0x000120, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__ArrayProperty_338' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, __StructProperty_339) == 0x000130, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::__StructProperty_339' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000150, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'AnimBP_AK74_fp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

