#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_DeadBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Player_DeadBody.AnimBP_Player_DeadBody_C.AnimBlueprintGeneratedConstantData
// 0x0107 (0x0108 - 0x0001)
struct AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	ERefPoseType                                  __ByteProperty_81;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_82;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_83;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_84;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_85;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_86;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_87;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_88;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_89;                                 // 0x0046(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_90;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_91;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0070(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F0(0x0018)()
};
static_assert(alignof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData) == 0x000108, "Wrong size on AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __ByteProperty_81) == 0x000001, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__ByteProperty_81' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000004, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __BoolProperty_83) == 0x00000C, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__BoolProperty_83' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __FloatProperty_84) == 0x000010, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__FloatProperty_84' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __StructProperty_85) == 0x000014, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__StructProperty_85' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __FloatProperty_86) == 0x000040, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__FloatProperty_86' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __BoolProperty_87) == 0x000044, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__BoolProperty_87' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_88) == 0x000045, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_88' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __ByteProperty_89) == 0x000046, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__ByteProperty_89' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x000048, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, __StructProperty_91) == 0x000050, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::__StructProperty_91' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000070, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F0, "Member 'AnimBP_Player_DeadBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

