#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_TwoHandedConsumable

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Player_TwoHandedConsumable.AnimBP_Player_TwoHandedConsumable_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_155;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           m_ByteProperty_156;                                // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_157;                            // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_158;                               // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          m_BlendProfile_159;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            m_CurveFloat_160;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             m_EnumProperty_161;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      m_EnumProperty_162;                                // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_163;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          m_BoolProperty_164;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_165;                               // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          m_StructProperty_166;                              // 0x0058(0x002C)(BlueprintVisible, NoDestructor)
	float                                         m_FloatProperty_167;                               // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_168;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_169;                                // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_170;                                // 0x008A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_171;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   m_StructProperty_172;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_NameProperty_155) == 0x000004, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_NameProperty_155' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_ByteProperty_156) == 0x00000C, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_ByteProperty_156' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_157) == 0x000010, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_157' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_158) == 0x000018, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_158' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_BlendProfile_159) == 0x000028, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_BlendProfile_159' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_CurveFloat_160) == 0x000030, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_CurveFloat_160' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_EnumProperty_161) == 0x000038, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_EnumProperty_161' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_EnumProperty_162) == 0x000039, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_EnumProperty_162' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_163) == 0x000040, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_163' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_BoolProperty_164) == 0x000050, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_BoolProperty_164' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_FloatProperty_165) == 0x000054, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_FloatProperty_165' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_StructProperty_166) == 0x000058, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_StructProperty_166' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_FloatProperty_167) == 0x000084, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_FloatProperty_167' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_BoolProperty_168) == 0x000088, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_BoolProperty_168' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_EnumProperty_169) == 0x000089, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_EnumProperty_169' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_ByteProperty_170) == 0x00008A, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_ByteProperty_170' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_NameProperty_171) == 0x00008C, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_NameProperty_171' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, m_StructProperty_172) == 0x000098, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::m_StructProperty_172' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Player_TwoHandedConsumable.AnimBP_Player_TwoHandedConsumable_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_0;                              // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_1;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_2;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData, m_FloatProperty) == 0x000004, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData::m_FloatProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData, m_AnimSequenceBase_0) == 0x000008, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData::m_AnimSequenceBase_0' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData, m_BoolProperty_1) == 0x000010, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData::m_BoolProperty_1' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData, m_BoolProperty_2) == 0x000011, "Member 'AnimBP_Player_TwoHandedConsumable::FAnimBlueprintGeneratedMutableData::m_BoolProperty_2' has a wrong offset!");

}

