#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_AK74

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimBP_Player_AK74_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Player_AK74.AnimBP_Player_AK74_C
// 0x2D30 (0x41B0 - 0x1480)
class UAnimBP_Player_AK74_C final : public UAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_Player_AK74::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x1488(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1498(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x14A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x14A8(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x14B0(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1578(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x1640(0x0040)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1680(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x1748(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x1788(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x17C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x1808(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x1848(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1888(0x0108)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x1990(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x19D8(0x00B8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x1A90(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1AD8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x1B20(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x1B48(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1C50(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1C78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1CC0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CE8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1D08(0x0020)()
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC_1;                     // 0x1D28(0x0178)(ContainsInstancedReference)
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC;                       // 0x1EA0(0x0178)(ContainsInstancedReference)
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x2018(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x2108(0x00F0)()
	struct FAnimNode_CameraCopyBone_GSC           AnimGraphNode_CameraCopyBone_GSC;                  // 0x21F8(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2330(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2350(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x2370(0x00E0)()
	struct FAnimNode_SmoothCopyBone_GSC           AnimGraphNode_SmoothCopyBone_GSC;                  // 0x2450(0x0160)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x25B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x26D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2800(0x0128)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x2928(0x00D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x29F8(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2A18(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2B08(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2BF8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2D20(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x2E48(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2E70(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2F50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2F78(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x2FA0(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x3070(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x30B0(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x30F0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3118(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x31F8(0x0108)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x3300(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x33B8(0x0108)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x34C0(0x0010)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x34D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x34F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3520(0x0028)()
	struct FAnimCutsceneData                      __CustomProperty_CutsceneData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3548(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 __CustomProperty_StealthData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3550(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  __CustomProperty_ShadowData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3570(0x0030)()
	struct FAnimPlayerVaultingData                __CustomProperty_VaultingData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x35A0(0x00B8)()
	struct FAnimPlayerUnfocusableTargetData       __CustomProperty_AnimPlayerUnfocusableTargetData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3658(0x0001)(NoDestructor)
	uint8                                         Pad_3659[0x3];                                     // 0x3659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDialogData                  __CustomProperty_DialogData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x365C(0x0008)(NoDestructor)
	uint8                                         Pad_3664[0x4];                                     // 0x3664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   __CustomProperty_DodgeData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3668(0x0068)()
	struct FAnimPlayerGuitarData                  __CustomProperty_GuitarData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x36D0(0x0024)(NoDestructor)
	uint8                                         Pad_36F4[0x4];                                     // 0x36F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerHitData                     __CustomProperty_HitData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x36F8(0x0080)(NoDestructor)
	struct FAnimPlayerDetectorData                __CustomProperty_DetectorData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3778(0x0128)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerWeaponPushbackData          __CustomProperty_WeaponPushbackData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x38A0(0x0080)(NoDestructor)
	struct FAnimPlayerCollectionsData             __CustomProperty_CollectionData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3920(0x0328)()
	struct FAnimPlayerStateData                   __CustomProperty_StateData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3C48(0x0040)(NoDestructor)
	struct FAnimPlayerWeaponData                  __CustomProperty_WeaponData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3C88(0x0078)(NoDestructor, ContainsInstancedReference)
	struct FAnimCutsceneData                      __CustomProperty_CutsceneData_D0646C304A6CF78273DC23A983D691BB; // 0x3D00(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 __CustomProperty_StealthData_D0646C304A6CF78273DC23A983D691BB; // 0x3D08(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  __CustomProperty_ShadowData_D0646C304A6CF78273DC23A983D691BB; // 0x3D28(0x0030)()
	struct FAnimPlayerUnfocusableTargetData       __CustomProperty_AnimPlayerUnfocusableTargetData_D0646C304A6CF78273DC23A983D691BB; // 0x3D58(0x0001)(NoDestructor)
	uint8                                         Pad_3D59[0x3];                                     // 0x3D59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDialogData                  __CustomProperty_DialogData_D0646C304A6CF78273DC23A983D691BB; // 0x3D5C(0x0008)(NoDestructor)
	uint8                                         Pad_3D64[0x4];                                     // 0x3D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   __CustomProperty_DodgeData_D0646C304A6CF78273DC23A983D691BB; // 0x3D68(0x0068)()
	struct FAnimPlayerGuitarData                  __CustomProperty_GuitarData_D0646C304A6CF78273DC23A983D691BB; // 0x3DD0(0x0024)(NoDestructor)
	uint8                                         Pad_3DF4[0x4];                                     // 0x3DF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerAutoCoverData               __CustomProperty_AutoCoverData_D0646C304A6CF78273DC23A983D691BB; // 0x3DF8(0x0088)(NoDestructor)
	struct FAnimPlayerCollectionsData             __CustomProperty_CollectionData_D0646C304A6CF78273DC23A983D691BB; // 0x3E80(0x0328)()

public:
	void ExecuteUbergraph_AnimBP_Player_AK74(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& Idle, const struct FPoseLink& Moving, const struct FPoseLink& Look, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Player_AK74_C">();
	}
	static class UAnimBP_Player_AK74_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Player_AK74_C>();
	}
};
static_assert(alignof(UAnimBP_Player_AK74_C) == 0x000010, "Wrong alignment on UAnimBP_Player_AK74_C");
static_assert(sizeof(UAnimBP_Player_AK74_C) == 0x0041B0, "Wrong size on UAnimBP_Player_AK74_C");
static_assert(offsetof(UAnimBP_Player_AK74_C, UberGraphFrame) == 0x001480, "Member 'UAnimBP_Player_AK74_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __AnimBlueprintMutables) == 0x001488, "Member 'UAnimBP_Player_AK74_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimBlueprintExtension_Tag) == 0x001498, "Member 'UAnimBP_Player_AK74_C::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimBlueprintExtension_PropertyAccess) == 0x0014A0, "Member 'UAnimBP_Player_AK74_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimBlueprintExtension_Base) == 0x0014A8, "Member 'UAnimBP_Player_AK74_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LinkedInputPose_2) == 0x0014B0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LinkedInputPose_1) == 0x001578, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_7) == 0x001640, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LinkedInputPose) == 0x001680, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_6) == 0x001748, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_5) == 0x001788, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_4) == 0x0017C8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_3) == 0x001808, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_2) == 0x001848, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SaveCachedPose_3) == 0x001888, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_BlendListByEnum_2) == 0x001990, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LinkedAnimGraph_1) == 0x0019D8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LinkedAnimGraph_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_BlendListByEnum_1) == 0x001A90, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_BlendListByBool) == 0x001AD8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_9) == 0x001B20, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SaveCachedPose_2) == 0x001B48, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_8) == 0x001C50, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_BlendListByEnum) == 0x001C78, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_7) == 0x001CC0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_Root) == 0x001CE8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001D08, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_TwoBoneIK_GSC_1) == 0x001D28, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_TwoBoneIK_GSC_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_TwoBoneIK_GSC) == 0x001EA0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_TwoBoneIK_GSC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_CopyBone_3) == 0x002018, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_CopyBone_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_CopyBone_2) == 0x002108, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_CopyBone_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_CameraCopyBone_GSC) == 0x0021F8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_CameraCopyBone_GSC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LocalToComponentSpace) == 0x002330, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002350, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LayeredBoneBlend_2) == 0x002370, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SmoothCopyBone_GSC) == 0x002450, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SmoothCopyBone_GSC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ModifyBone_4) == 0x0025B0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ModifyBone_3) == 0x0026D8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ModifyBone_2) == 0x002800, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ApplyMeshSpaceAdditive_1) == 0x002928, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ApplyMeshSpaceAdditive_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ComponentToLocalSpace) == 0x0029F8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_CopyBone_1) == 0x002A18, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_CopyBone) == 0x002B08, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ModifyBone_1) == 0x002BF8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ModifyBone) == 0x002D20, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_6) == 0x002E48, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LayeredBoneBlend_1) == 0x002E70, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_5) == 0x002F50, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_4) == 0x002F78, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x002FA0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator_1) == 0x003070, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SequenceEvaluator) == 0x0030B0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_3) == 0x0030F0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LayeredBoneBlend) == 0x003118, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SaveCachedPose_1) == 0x0031F8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_LinkedAnimGraph) == 0x003300, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_SaveCachedPose) == 0x0033B8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_IdentityPose) == 0x0034C0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_2) == 0x0034D0, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose_1) == 0x0034F8, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, AnimGraphNode_UseCachedPose) == 0x003520, "Member 'UAnimBP_Player_AK74_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_CutsceneData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003548, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_CutsceneData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_StealthData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003550, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_StealthData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_ShadowData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003570, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_ShadowData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_VaultingData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x0035A0, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_VaultingData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_AnimPlayerUnfocusableTargetData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003658, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_AnimPlayerUnfocusableTargetData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_DialogData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x00365C, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_DialogData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_DodgeData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003668, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_DodgeData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_GuitarData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x0036D0, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_GuitarData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_HitData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x0036F8, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_HitData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_DetectorData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003778, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_DetectorData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_WeaponPushbackData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x0038A0, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_WeaponPushbackData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_CollectionData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003920, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_CollectionData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_StateData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003C48, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_StateData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_WeaponData_B8A2038546A6DF85B6BCB5A5C8065DA2) == 0x003C88, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_WeaponData_B8A2038546A6DF85B6BCB5A5C8065DA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_CutsceneData_D0646C304A6CF78273DC23A983D691BB) == 0x003D00, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_CutsceneData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_StealthData_D0646C304A6CF78273DC23A983D691BB) == 0x003D08, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_StealthData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_ShadowData_D0646C304A6CF78273DC23A983D691BB) == 0x003D28, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_ShadowData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_AnimPlayerUnfocusableTargetData_D0646C304A6CF78273DC23A983D691BB) == 0x003D58, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_AnimPlayerUnfocusableTargetData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_DialogData_D0646C304A6CF78273DC23A983D691BB) == 0x003D5C, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_DialogData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_DodgeData_D0646C304A6CF78273DC23A983D691BB) == 0x003D68, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_DodgeData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_GuitarData_D0646C304A6CF78273DC23A983D691BB) == 0x003DD0, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_GuitarData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_AutoCoverData_D0646C304A6CF78273DC23A983D691BB) == 0x003DF8, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_AutoCoverData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Player_AK74_C, __CustomProperty_CollectionData_D0646C304A6CF78273DC23A983D691BB) == 0x003E80, "Member 'UAnimBP_Player_AK74_C::__CustomProperty_CollectionData_D0646C304A6CF78273DC23A983D691BB' has a wrong offset!");

}

