#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_Shadow

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Player_Shadow.AnimBP_Player_Shadow_C.AnimBlueprintGeneratedConstantData
// 0x02BF (0x02C0 - 0x0001)
struct AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_588;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_589;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_590;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_591;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_592;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_593;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_594;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_595;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_596;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_597;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_598;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_599;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_600;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_601;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_602;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   m_NameProperty_603;                                // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 m_ArrayProperty_604;                               // 0x0078(0x0010)(BlueprintVisible, EditFixedSize)
	EAnimSyncMethod                               m_EnumProperty_605;                                // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_606;                                // 0x008C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_607;                                // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          m_BlendProfile_608;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            m_CurveFloat_609;                                  // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             m_EnumProperty_610;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      m_EnumProperty_611;                                // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_ArrayProperty_612;                               // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      m_AnimSequenceBase_613;                            // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_614;                            // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  m_ByteProperty_615;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_616;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_617;                                 // 0x00E4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_618;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_619;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_620;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_621;                                 // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_622;                            // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   m_NameProperty_623;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_624;                                 // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_625;                                // 0x0114(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_626;                                 // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_627;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_628;                                 // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          m_StructProperty_629;                              // 0x012C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         m_FloatProperty_630;                               // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_631;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_632;                                 // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      m_AnimSequenceBase_633;                            // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   m_NameProperty_634;                                // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_635;                                 // 0x0178(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           m_ByteProperty_636;                                // 0x017C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_637;                                // 0x017D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_638;                               // 0x0180(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      m_AnimSequenceBase_639;                            // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          m_BoolProperty_640;                                // 0x0190(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               m_EnumProperty_641;                                // 0x0191(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                m_ByteProperty_642;                                // 0x0192(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_NameProperty_643;                                // 0x0194(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   m_NameProperty_644;                                // 0x019C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_IntProperty_645;                                 // 0x01A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   m_StructProperty_646;                              // 0x01A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x01C8(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0228(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02A8(0x0018)()
};
static_assert(alignof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData) == 0x0002C0, "Wrong size on AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_588) == 0x000004, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_588' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_589) == 0x00000C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_589' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_590) == 0x000014, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_590' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_591) == 0x000018, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_591' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_592) == 0x000020, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_592' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_593) == 0x000024, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_593' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_594) == 0x00002C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_594' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_595) == 0x000030, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_595' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_596) == 0x000038, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_596' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_597) == 0x00003C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_597' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_598) == 0x000044, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_598' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_599) == 0x000048, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_599' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_600) == 0x000050, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_600' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_601) == 0x000058, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_601' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_602) == 0x000060, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_602' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_603) == 0x000070, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_603' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_604) == 0x000078, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_604' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_EnumProperty_605) == 0x000088, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_EnumProperty_605' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_606) == 0x00008C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_606' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_607) == 0x000094, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_607' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_BlendProfile_608) == 0x0000A0, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_BlendProfile_608' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_CurveFloat_609) == 0x0000A8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_CurveFloat_609' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_EnumProperty_610) == 0x0000B0, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_EnumProperty_610' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_EnumProperty_611) == 0x0000B1, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_EnumProperty_611' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ArrayProperty_612) == 0x0000B8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ArrayProperty_612' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_613) == 0x0000C8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_613' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_614) == 0x0000D0, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_614' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ByteProperty_615) == 0x0000D8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ByteProperty_615' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_616) == 0x0000DC, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_616' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_617) == 0x0000E4, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_617' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_618) == 0x0000E8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_618' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_619) == 0x0000F0, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_619' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_620) == 0x0000F4, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_620' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_621) == 0x0000FC, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_621' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_622) == 0x000100, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_622' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_623) == 0x000108, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_623' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_624) == 0x000110, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_624' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_625) == 0x000114, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_625' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_626) == 0x00011C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_626' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_627) == 0x000120, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_627' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_628) == 0x000128, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_628' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_StructProperty_629) == 0x00012C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_StructProperty_629' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_FloatProperty_630) == 0x000158, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_FloatProperty_630' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_631) == 0x00015C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_631' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_632) == 0x000164, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_632' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_633) == 0x000168, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_633' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_634) == 0x000170, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_634' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_635) == 0x000178, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_635' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ByteProperty_636) == 0x00017C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ByteProperty_636' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_BoolProperty_637) == 0x00017D, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_BoolProperty_637' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_FloatProperty_638) == 0x000180, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_FloatProperty_638' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_AnimSequenceBase_639) == 0x000188, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_AnimSequenceBase_639' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_BoolProperty_640) == 0x000190, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_BoolProperty_640' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_EnumProperty_641) == 0x000191, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_EnumProperty_641' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_ByteProperty_642) == 0x000192, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_ByteProperty_642' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_643) == 0x000194, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_643' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_NameProperty_644) == 0x00019C, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_NameProperty_644' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_IntProperty_645) == 0x0001A4, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_IntProperty_645' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, m_StructProperty_646) == 0x0001A8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::m_StructProperty_646' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x0001C8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000228, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002A8, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Player_Shadow.AnimBP_Player_Shadow_C.AnimBlueprintGeneratedMutableData
// 0x00D7 (0x00D8 - 0x0001)
struct AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_11;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_12;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_13;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_14;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_15;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_16;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_17;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_18;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_19;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_20;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_21;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_22;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_23;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_24;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_25;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_26;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_27;                                // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_28;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_29;                                // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_30;                                // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_31;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_32;                                 // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_33;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_34;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_35;                                 // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_36;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_37;                                // 0x009C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_38;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_39;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_40;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_41;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_42;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_BoolProperty_43;                                 // 0x00B4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_FloatProperty_44;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_45;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_46;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_47;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_48;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_49;                                // 0x00CC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_50;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         m_FloatProperty_51;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData) == 0x0000D8, "Wrong size on AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData, m_FloatProperty) == 0x000004, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData::m_FloatProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData, m_FloatProperty_0) == 0x000008, "Member 'AnimBP_Player_Shadow::FAnimBlueprintGeneratedMutableData::m_FloatProperty_0' has a wrong offset!");
