#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Energy

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Energy.AnimBP_Energy_C
// 0x0080 (0x0490 - 0x0410)
class UAnimBP_Energy_C final : public UAnimInstanceItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0418(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0420(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0448(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_Energy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Energy_C">();
	}
	static class UAnimBP_Energy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Energy_C>();
	}
};
static_assert(alignof(UAnimBP_Energy_C) == 0x000010, "Wrong alignment on UAnimBP_Energy_C");
static_assert(sizeof(UAnimBP_Energy_C) == 0x000490, "Wrong size on UAnimBP_Energy_C");
static_assert(offsetof(UAnimBP_Energy_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Energy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Energy_C, AnimBlueprintExtension_PropertyAccess) == 0x000418, "Member 'UAnimBP_Energy_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_Energy_C, AnimBlueprintExtension_Base) == 0x000420, "Member 'UAnimBP_Energy_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_Energy_C, AnimGraphNode_Root) == 0x000428, "Member 'UAnimBP_Energy_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_Energy_C, AnimGraphNode_Slot) == 0x000448, "Member 'UAnimBP_Energy_C::AnimGraphNode_Slot' has a wrong offset!");

}

