#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_bloodsucker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_bloodsucker.AnimBP_bloodsucker_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_bloodsucker_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_bloodsucker_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_bloodsucker_C_AnimGraph");
static_assert(sizeof(AnimBP_bloodsucker_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_bloodsucker_C_AnimGraph");
static_assert(offsetof(AnimBP_bloodsucker_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_bloodsucker_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_bloodsucker.AnimBP_bloodsucker_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_bloodsucker_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_bloodsucker_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_bloodsucker_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_bloodsucker_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_bloodsucker_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_bloodsucker_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_bloodsucker_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_bloodsucker.AnimBP_bloodsucker_C.ExecuteUbergraph_AnimBP_bloodsucker
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker) == 0x000004, "Wrong alignment on AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker");
static_assert(sizeof(AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker) == 0x000008, "Wrong size on AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker");
static_assert(offsetof(AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker, EntryPoint) == 0x000000, "Member 'AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'AnimBP_bloodsucker_C_ExecuteUbergraph_AnimBP_bloodsucker::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

