#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player_pm

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "AnimBP_Player_pm_structs.hpp"
#include "Engine_structs.hpp"
#include "Stalker2_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Player_pm.AnimBP_Player_pm_C
// 0x3420 (0x4890 - 0x1470)
class UAnimBP_Player_pm_C final : public UAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_Player_pm::FAnimBlueprintGeneratedMutableData m_AnimBlueprintMutables;                           // 0x1478(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1488(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1490(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1498(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14A0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x14C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x14E0(0x0020)()
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC_2;                     // 0x1500(0x0178)(ContainsInstancedReference)
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC_1;                     // 0x1678(0x0178)(ContainsInstancedReference)
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x17F0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x18E0(0x00F0)()
	struct FAnimNode_SmoothCopyBone_GSC           AnimGraphNode_SmoothCopyBone_GSC_1;                // 0x19D0(0x0160)(ContainsInstancedReference)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1B30(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1BF8(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1CC0(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1D88(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1EB0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1FD8(0x0128)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2100(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2208(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2230(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2278(0x00E0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x2358(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x2448(0x00F0)()
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC;                       // 0x2538(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x26B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x26D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x26F0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2718(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x27E0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x2820(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x2860(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x28A0(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x28E0(0x0048)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x2928(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x29E0(0x0108)()
	struct FAnimNode_CameraCopyBone_GSC           AnimGraphNode_CameraCopyBone_GSC;                  // 0x2AE8(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2C20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2C40(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2C60(0x00E0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x2D40(0x00D0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2E10(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2F00(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x2FF0(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3118(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x3140(0x00B8)()
	struct FAnimNode_SmoothCopyBone_GSC           AnimGraphNode_SmoothCopyBone_GSC;                  // 0x31F8(0x0160)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3358(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3480(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x35A8(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x36D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x36F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3740(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x3768(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x37A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x37F0(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x3818(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x38E8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x3910(0x0010)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3920(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3A28(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3B30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3B58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3B80(0x0028)()
	struct FAnimCutsceneData                      m_CustomProperty_CutsceneData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BA8(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 m_CustomProperty_StealthData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BB0(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  m_CustomProperty_ShadowData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BD0(0x0030)()
	struct FAnimPlayerVaultingData                m_CustomProperty_VaultingData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3C00(0x00B8)()
	struct FAnimPlayerUnfocusableTargetData       m_CustomProperty_AnimPlayerUnfocusableTargetData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CB8(0x0001)(NoDestructor)
	struct FAnimPlayerDialogData                  m_CustomProperty_DialogData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CB9(0x0001)(NoDestructor)
	uint8                                         Pad_3CBA[0x6];                                     // 0x3CBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   m_CustomProperty_DodgeData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CC0(0x0068)()
	struct FAnimPlayerGuitarData                  m_CustomProperty_GuitarData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3D28(0x0024)(NoDestructor)
	uint8                                         Pad_3D4C[0x4];                                     // 0x3D4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerHitData                     m_CustomProperty_HitData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3D50(0x0080)(NoDestructor)
	struct FAnimPlayerDetectorData                m_CustomProperty_DetectorData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3DD0(0x0128)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerWeaponPushbackData          m_CustomProperty_WeaponPushbackData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3EF8(0x0080)(NoDestructor)
	struct FAnimPlayerCollectionsData             m_CustomProperty_CollectionData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3F78(0x0328)()
	struct FAnimPlayerStateData                   m_CustomProperty_StateData_64C5AB764CE33167EFABBAB61CC45A52; // 0x42A0(0x003C)(NoDestructor)
	uint8                                         Pad_42DC[0x4];                                     // 0x42DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerCameraData                  m_CustomProperty_CameraData_64C5AB764CE33167EFABBAB61CC45A52; // 0x42E0(0x0090)(NoDestructor)
	struct FAnimPlayerWeaponData                  m_CustomProperty_WeaponData_64C5AB764CE33167EFABBAB61CC45A52; // 0x4370(0x0078)(NoDestructor, ContainsInstancedReference)
	struct FAnimCutsceneData                      m_CustomProperty_CutsceneData_1EE89FA940C0375ED757748B8B9782E5; // 0x43E8(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 m_CustomProperty_StealthData_1EE89FA940C0375ED757748B8B9782E5; // 0x43F0(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  m_CustomProperty_ShadowData_1EE89FA940C0375ED757748B8B9782E5; // 0x4410(0x0030)()
	struct FAnimPlayerUnfocusableTargetData       m_CustomProperty_AnimPlayerUnfocusableTargetData_1EE89FA940C0375ED757748B8B9782E5; // 0x4440(0x0001)(NoDestructor)
	struct FAnimPlayerDialogData                  m_CustomProperty_DialogData_1EE89FA940C0375ED757748B8B9782E5; // 0x4441(0x0001)(NoDestructor)
	uint8                                         Pad_4442[0x6];                                     // 0x4442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   m_CustomProperty_DodgeData_1EE89FA940C0375ED757748B8B9782E5; // 0x4448(0x0068)()
	struct FAnimPlayerGuitarData                  m_CustomProperty_GuitarData_1EE89FA940C0375ED757748B8B9782E5; // 0x44B0(0x0024)(NoDestructor)
	uint8                                         Pad_44D4[0x4];                                     // 0x44D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerAutoCoverData               m_CustomProperty_AutoCoverData_1EE89FA940C0375ED757748B8B9782E5; // 0x44D8(0x0088)(NoDestructor)
	struct FAnimPlayerCollectionsData             m_CustomProperty_CollectionData_1EE89FA940C0375ED757748B8B9782E5; // 0x4560(0x0328)()

public:
	void AnimGraph(const struct FPoseLink& Idle, const struct FPoseLink& Moving, const struct FPoseLink& Look, const struct FPoseLink& Additional, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_Player_pm(int32 EntryPoint);
	bool IsBusyLeftHand();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Player_pm_C">();
	}
	static class UAnimBP_Player_pm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Player_pm_C>();
	}
};
static_assert(alignof(UAnimBP_Player_pm_C) == 0x000010, "Wrong alignment on UAnimBP_Player_pm_C");
static_assert(sizeof(UAnimBP_Player_pm_C) == 0x004890, "Wrong size on UAnimBP_Player_pm_C");
static_assert(offsetof(UAnimBP_Player_pm_C, UberGraphFrame) == 0x001470, "Member 'UAnimBP_Player_pm_C::UberGraphFrame' has a wrong offset!");
