#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Player

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "AnimBP_Player_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Stalker2_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AnimationWarpingRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Player.AnimBP_Player_C
// 0xA1F0 (0xB660 - 0x1470)
class UAnimBP_Player_C final : public UAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_Player::FAnimBlueprintGeneratedMutableData m_AnimBlueprintMutables;                           // 0x1478(0x02B0)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1728(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1738(0x0008)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_108;                  // 0x1740(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_107;                  // 0x1788(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_106;                  // 0x17D0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_7;                      // 0x1818(0x0010)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_10;                  // 0x1828(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_6;                      // 0x1870(0x0010)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_13;                // 0x1880(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_12;                // 0x18C0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x1900(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x1940(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x1980(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x19C0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x1A00(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_9;                   // 0x1A40(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x1A88(0x00E0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x1B68(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_105;                  // 0x1C38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_104;                  // 0x1C80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_103;                  // 0x1CC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_102;                  // 0x1D10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_101;                  // 0x1D58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_100;                  // 0x1DA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_99;                   // 0x1DE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_98;                   // 0x1E30(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8;                   // 0x1E78(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x1EC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_97;                   // 0x1F08(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_96;                   // 0x1F50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_95;                   // 0x1F98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94;                   // 0x1FE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_93;                   // 0x2028(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_92;                   // 0x2070(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_91;                   // 0x20B8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x2100(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_5;                      // 0x2148(0x0010)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x2158(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x2228(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90;                   // 0x2270(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89;                   // 0x22B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_88;                   // 0x2300(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87;                   // 0x2348(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_86;                   // 0x2390(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_85;                   // 0x23D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_84;                   // 0x2420(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x2468(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_4;                      // 0x24B0(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x24C0(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x2508(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83;                   // 0x25D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82;                   // 0x2620(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81;                   // 0x2668(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80;                   // 0x26B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_79;                   // 0x26F8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x2740(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x2760(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x2780(0x0128)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78;                   // 0x28A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77;                   // 0x28F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_76;                   // 0x2938(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75;                   // 0x2980(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_74;                   // 0x29C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73;                   // 0x2A10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72;                   // 0x2A58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x2AA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x2AE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x2B30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x2B78(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x2BC0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x2C08(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x2C50(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x2C98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x2CB8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x2D80(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x2DC8(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x2ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x2EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x2F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x2F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x2F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x2F98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x2FC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x2FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x3010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x3038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x3060(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x3088(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x30D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x3118(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x3160(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x3180(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x31A8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x31D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x31F0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x3238(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x3280(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x32C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x32E8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x3330(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x3378(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x33C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x33E0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x3428(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x3470(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x34B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x34D8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x3500(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x35C8(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x36D0(0x0108)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x37D8(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x3890(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x38D8(0x0010)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x38E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x3910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x3938(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x3960(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x3970(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x3990(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x39D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x3A20(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x3A68(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x3AB0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x3AD0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x3B18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x3B60(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x3BA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x3BF0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x3C10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x3C58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x3CA0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x3CE8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x3D30(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x3D50(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x3E18(0x0048)()
	struct FAnimNode_CacheBlend_GSC               AnimGraphNode_CacheBlend_GSC_1;                    // 0x3E60(0x0068)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x3EC8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3F10(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x4018(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x40F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x4140(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x4168(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x4190(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x41D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x41F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4220(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x4268(0x0040)()
	struct FAnimNode_CachePoseExternal_GSC        AnimGraphNode_CachePoseExternal_GSC;               // 0x42A8(0x00A8)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x4350(0x0020)()
	struct FAnimNode_TwoBoneIK_GSC                AnimGraphNode_TwoBoneIK_GSC;                       // 0x4370(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x44E8(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x4508(0x00F8)()
	struct FAnimNode_FootPlacement                AnimGraphNode_FootPlacement;                       // 0x4600(0x0450)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4A50(0x0470)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x4EC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x4EE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x4F10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x4F38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x4F60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x4F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x4FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x4FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x5000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x5028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x5050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x5078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x50A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x50C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x50F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x5118(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x5140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x5168(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x5190(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x51B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x51E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x5208(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_37;                 // 0x5230(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x52A0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x52C0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x5308(0x0010)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_36;                 // 0x5318(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x5388(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0x53A8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_34;                 // 0x5418(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x5488(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_33;                 // 0x54D0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x5540(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32;                 // 0x5588(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x55F8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x56D8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x56F8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31;                 // 0x57D8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x5848(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x5890(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_30;                 // 0x58B0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_29;                 // 0x5920(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x5990(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x5A70(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_28;                 // 0x5A90(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_27;                 // 0x5B00(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x5B70(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x5C50(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_26;                 // 0x5C70(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x5CE0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x5D00(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_25;                 // 0x5D28(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x5D98(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_24;                 // 0x5DE0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_23;                 // 0x5E50(0x0070)()
	struct FAnimNode_BlendListByPointer_GSC       AnimGraphNode_BlendListByPointer_GSC_3;            // 0x5EC0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_22;                 // 0x5F08(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x5F78(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x6058(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_21;                 // 0x6078(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_20;                 // 0x60E8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0x6158(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x61C8(0x0048)()
	struct FAnimNode_BlendListByPointer_GSC       AnimGraphNode_BlendListByPointer_GSC_2;            // 0x6210(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x6258(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_18;                 // 0x62A0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x6310(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_17;                 // 0x6358(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0x63C8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0x6438(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x64A8(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x6588(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x65D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x65F0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x6660(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x66D0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x6740(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x6820(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x6868(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x6888(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x68D0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x6940(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x69B0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x6A20(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x6B00(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x6B48(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x6BB8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x6C28(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x6C98(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x6D78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x6DC0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x6DE0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x6E50(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x6EC0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x6F30(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x6FA0(0x0070)()
	struct FAnimNode_BlendListByPointer_GSC       AnimGraphNode_BlendListByPointer_GSC_1;            // 0x7010(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x7058(0x0048)()
	struct FAnimNode_BlendListByPointer_GSC       AnimGraphNode_BlendListByPointer_GSC;              // 0x70A0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x70E8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x7130(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x71A0(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x7280(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x72A0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x7368(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x73B0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x73F0(0x0040)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x7430(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x7440(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x7460(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x7528(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x7630(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x7658(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x7680(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x7760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x7788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x77B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x77D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x7800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x7828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x7850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x7878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x78A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x78C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x78F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x7938(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x7958(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x79A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x79C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x7A08(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x7A28(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x7A68(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x7A88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x7AD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x7AF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x7B38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x7B58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x7BA0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x7BC0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x7C00(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x7C20(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x7C60(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x7C80(0x00C8)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x7D48(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x7E00(0x0108)()
	struct FAnimNode_CacheBlend_GSC               AnimGraphNode_CacheBlend_GSC;                      // 0x7F08(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x7F70(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x8050(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x8078(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x80C0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x8108(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x8150(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x8278(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x8298(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x82B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x8300(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x8348(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x8368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x8390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x83B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x83E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x8408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x8430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x8458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x8480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x84A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x84D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x84F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x8520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x8548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x8570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x8598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x85C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x85E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x8610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x8638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x8660(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x8688(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x86B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x86D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x8700(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x8728(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x8750(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x8778(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x87C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x87E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x8828(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x8848(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x8890(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x88B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x88F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x8918(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x8960(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x8980(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x89C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x89E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x8A30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x8A50(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x8A98(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x8AB8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x8B00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x8B20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x8B68(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x8B88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x8BD0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x8BF0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x8C18(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x8CE0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x8D28(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x8D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x8D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x8DC0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x8DE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x8E30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x8E78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x8EC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x8EE0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x8F28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x8F70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x8FB8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x8FD8(0x0128)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x9100(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x9148(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x9190(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x91D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x9220(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x9268(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x92B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x92F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x9340(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x9388(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x93D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x9418(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x9460(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x94A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x94F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x9538(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x9580(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x95C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x9610(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x9658(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x96A0(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x96E8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x97B8(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x9800(0x00F0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x98F0(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x9938(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x9A08(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x9A50(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9A98(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x9AB8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x9AD8(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x9C00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x9C48(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x9D28(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x9E08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x9E28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x9E70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x9EB8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x9F00(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x9F20(0x00C8)()
	struct FAnimCutsceneData                      m_CustomProperty_CutsceneData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0x9FE8(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 m_CustomProperty_StealthData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0x9FF0(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  m_CustomProperty_ShadowData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA010(0x0030)()
	struct FAnimPlayerVaultingData                m_CustomProperty_VaultingData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA040(0x00B8)()
	struct FAnimPlayerUnfocusableTargetData       m_CustomProperty_AnimPlayerUnfocusableTargetData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA0F8(0x0001)(NoDestructor)
	struct FAnimPlayerDialogData                  m_CustomProperty_DialogData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA0F9(0x0001)(NoDestructor)
	uint8                                         Pad_A0FA[0x6];                                     // 0xA0FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   m_CustomProperty_DodgeData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA100(0x0068)()
	struct FAnimPlayerGuitarData                  m_CustomProperty_GuitarData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA168(0x0024)(NoDestructor)
	uint8                                         Pad_A18C[0x4];                                     // 0xA18C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerHitData                     m_CustomProperty_HitData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA190(0x0080)(NoDestructor)
	struct FAnimPlayerAutoCoverData               m_CustomProperty_AutoCoverData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA210(0x0088)(NoDestructor)
	struct FAnimHandItemData                      m_CustomProperty_HandItemData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA298(0x0138)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerDetectorData                m_CustomProperty_DetectorData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA3D0(0x0128)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerWeaponPushbackData          m_CustomProperty_WeaponPushbackData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA4F8(0x0080)(NoDestructor)
	struct FAnimPlayerStateData                   m_CustomProperty_StateData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA578(0x003C)(NoDestructor)
	uint8                                         Pad_A5B4[0x4];                                     // 0xA5B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerWeaponData                  m_CustomProperty_WeaponData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA5B8(0x0078)(NoDestructor, ContainsInstancedReference)
	struct FAnimLocomotionData                    m_CustomProperty_LocomotionData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA630(0x0130)()
	struct FAnimCutsceneData                      m_CustomProperty_CutsceneData_3C776DC74B03047C129453A414B90C2F; // 0xA760(0x0008)(NoDestructor)
	struct FAnimPlayerStealthData                 m_CustomProperty_StealthData_3C776DC74B03047C129453A414B90C2F; // 0xA768(0x0020)(NoDestructor)
	struct FAnimPlayerShadowData                  m_CustomProperty_ShadowData_3C776DC74B03047C129453A414B90C2F; // 0xA788(0x0030)()
	struct FAnimPlayerVaultingData                m_CustomProperty_VaultingData_3C776DC74B03047C129453A414B90C2F; // 0xA7B8(0x00B8)()
	struct FAnimPlayerUnfocusableTargetData       m_CustomProperty_AnimPlayerUnfocusableTargetData_3C776DC74B03047C129453A414B90C2F; // 0xA870(0x0001)(NoDestructor)
	struct FAnimPlayerDialogData                  m_CustomProperty_DialogData_3C776DC74B03047C129453A414B90C2F; // 0xA871(0x0001)(NoDestructor)
	uint8                                         Pad_A872[0x6];                                     // 0xA872(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerDodgeData                   m_CustomProperty_DodgeData_3C776DC74B03047C129453A414B90C2F; // 0xA878(0x0068)()
	struct FAnimPlayerGuitarData                  m_CustomProperty_GuitarData_3C776DC74B03047C129453A414B90C2F; // 0xA8E0(0x0024)(NoDestructor)
	uint8                                         Pad_A904[0x4];                                     // 0xA904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerHitData                     m_CustomProperty_HitData_3C776DC74B03047C129453A414B90C2F; // 0xA908(0x0080)(NoDestructor)
	struct FAnimPlayerAutoCoverData               m_CustomProperty_AutoCoverData_3C776DC74B03047C129453A414B90C2F; // 0xA988(0x0088)(NoDestructor)
	struct FAnimPlayerLookAtData                  m_CustomProperty_LookAtData_3C776DC74B03047C129453A414B90C2F; // 0xAA10(0x00D0)()
	struct FAnimHandItemData                      m_CustomProperty_HandItemData_3C776DC74B03047C129453A414B90C2F; // 0xAAE0(0x0138)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerDetectorData                m_CustomProperty_DetectorData_3C776DC74B03047C129453A414B90C2F; // 0xAC18(0x0128)(NoDestructor, ContainsInstancedReference)
	struct FAnimPlayerWeaponPushbackData          m_CustomProperty_WeaponPushbackData_3C776DC74B03047C129453A414B90C2F; // 0xAD40(0x0080)(NoDestructor)
	struct FAnimPlayerWeaponInertiaData           m_CustomProperty_WeaponInertiaData_3C776DC74B03047C129453A414B90C2F; // 0xADC0(0x0098)(NoDestructor)
	struct FAnimPlayerWeaponSwingData             m_CustomProperty_WeaponSwingData_3C776DC74B03047C129453A414B90C2F; // 0xAE58(0x0080)(NoDestructor)
	struct FAnimPlayerIdleSwayData                m_CustomProperty_IdleSwayData_3C776DC74B03047C129453A414B90C2F; // 0xAED8(0x00F0)(NoDestructor)
	struct FAnimTwoHandsIKData                    m_CustomProperty_HandsIKData_3C776DC74B03047C129453A414B90C2F; // 0xAFC8(0x0078)(NoDestructor)
	struct FAnimPlayerCollectionsData             m_CustomProperty_CollectionData_3C776DC74B03047C129453A414B90C2F; // 0xB040(0x0328)()
	struct FAnimPlayerStateData                   m_CustomProperty_StateData_3C776DC74B03047C129453A414B90C2F; // 0xB368(0x003C)(NoDestructor)
	uint8                                         Pad_B3A4[0xC];                                     // 0xB3A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPlayerTransitionData              m_CustomProperty_TransitionData_3C776DC74B03047C129453A414B90C2F; // 0xB3B0(0x0070)()
	struct FAnimPlayerCameraData                  m_CustomProperty_CameraData_3C776DC74B03047C129453A414B90C2F; // 0xB420(0x0090)(NoDestructor)
	struct FAnimPlayerWeaponData                  m_CustomProperty_WeaponData_3C776DC74B03047C129453A414B90C2F; // 0xB4B0(0x0078)(NoDestructor, ContainsInstancedReference)
	struct FAnimLocomotionData                    m_CustomProperty_LocomotionData_3C776DC74B03047C129453A414B90C2F; // 0xB528(0x0130)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_05285C2F425ECCC38AFEEB800CD5B678();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_455A955A4FF0ACD0F0DA7FA7DBC9FF10();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_A4341EF6424105223C87C39D835F9459();
	void ExecuteUbergraph_AnimBP_Player(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Player_C">();
	}
	static class UAnimBP_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Player_C>();
	}
};
static_assert(alignof(UAnimBP_Player_C) == 0x000010, "Wrong alignment on UAnimBP_Player_C");
