#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Template.AnimBP_Template_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct AnimBP_Template::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_11;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_12;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0038(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(AnimBP_Template::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Template::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Template::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on AnimBP_Template::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x00000C, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_12) == 0x000018, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_12' has a wrong offset!");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000038, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'AnimBP_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

