#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimatedItemContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimatedItemContainer.BP_AnimatedItemContainer_C.ExecuteUbergraph_BP_AnimatedItemContainer
// 0x0028 (0x0028 - 0x0000)
struct BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_IAnimatedChest_C>  K2Node_DynamicCast_AsBP_IAnimated_Chest;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer) == 0x000008, "Wrong alignment on BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer");
static_assert(sizeof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer) == 0x000028, "Wrong size on BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer");
static_assert(offsetof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer, EntryPoint) == 0x000000, "Member 'BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer, K2Node_DynamicCast_AsBP_IAnimated_Chest) == 0x000010, "Member 'BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer::K2Node_DynamicCast_AsBP_IAnimated_Chest' has a wrong offset!");
static_assert(offsetof(BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AnimatedItemContainer_C_ExecuteUbergraph_BP_AnimatedItemContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

