#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseFog_Weather

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseFog_Weather.BP_BaseFog_Weather_C
// 0x0040 (0x0320 - 0x02E0)
class ABP_BaseFog_Weather_C : public AFogActor
{
public:
	struct FVector                                VolumetricFogSize;                                 // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DiffuseColor_Volumetric;                           // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height_Power;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastDensity_Power;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseFog_Weather_C">();
	}
	static class ABP_BaseFog_Weather_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseFog_Weather_C>();
	}
};
static_assert(alignof(ABP_BaseFog_Weather_C) == 0x000008, "Wrong alignment on ABP_BaseFog_Weather_C");
static_assert(sizeof(ABP_BaseFog_Weather_C) == 0x000320, "Wrong size on ABP_BaseFog_Weather_C");
static_assert(offsetof(ABP_BaseFog_Weather_C, VolumetricFogSize) == 0x0002E0, "Member 'ABP_BaseFog_Weather_C::VolumetricFogSize' has a wrong offset!");
static_assert(offsetof(ABP_BaseFog_Weather_C, DiffuseColor_Volumetric) == 0x0002F8, "Member 'ABP_BaseFog_Weather_C::DiffuseColor_Volumetric' has a wrong offset!");
static_assert(offsetof(ABP_BaseFog_Weather_C, Height_Power) == 0x000308, "Member 'ABP_BaseFog_Weather_C::Height_Power' has a wrong offset!");
static_assert(offsetof(ABP_BaseFog_Weather_C, LastDensity_Power) == 0x000310, "Member 'ABP_BaseFog_Weather_C::LastDensity_Power' has a wrong offset!");
static_assert(offsetof(ABP_BaseFog_Weather_C, Material) == 0x000318, "Member 'ABP_BaseFog_Weather_C::Material' has a wrong offset!");

}

