#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackBoxes

#include "Basic.hpp"

#include "E_BlackBoxes_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BlackBoxes.BP_BlackBoxes_C
// 0x0050 (0x02E8 - 0x0298)
class ABP_BlackBoxes_C final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    MeshesList;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                SpaceX;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                SpaceY;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_BlackBoxes                                  BoxType;                                           // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AmountX;                                           // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmountY;                                           // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BlackBoxes_C">();
	}
	static class ABP_BlackBoxes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BlackBoxes_C>();
	}
};
static_assert(alignof(ABP_BlackBoxes_C) == 0x000008, "Wrong alignment on ABP_BlackBoxes_C");
static_assert(sizeof(ABP_BlackBoxes_C) == 0x0002E8, "Wrong size on ABP_BlackBoxes_C");
static_assert(offsetof(ABP_BlackBoxes_C, InstancedStaticMesh) == 0x000298, "Member 'ABP_BlackBoxes_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_BlackBoxes_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, MeshesList) == 0x0002A8, "Member 'ABP_BlackBoxes_C::MeshesList' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, SpaceX) == 0x0002B8, "Member 'ABP_BlackBoxes_C::SpaceX' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, SpaceY) == 0x0002C8, "Member 'ABP_BlackBoxes_C::SpaceY' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, BoxType) == 0x0002D8, "Member 'ABP_BlackBoxes_C::BoxType' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, AmountX) == 0x0002DC, "Member 'ABP_BlackBoxes_C::AmountX' has a wrong offset!");
static_assert(offsetof(ABP_BlackBoxes_C, AmountY) == 0x0002E0, "Member 'ABP_BlackBoxes_C::AmountY' has a wrong offset!");

}

