#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BlackBoxes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BlackBoxes.BP_BlackBoxes_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct BP_BlackBoxes_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BlackBoxes_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_BlackBoxes_C_UserConstructionScript");
static_assert(sizeof(BP_BlackBoxes_C_UserConstructionScript) == 0x000120, "Wrong size on BP_BlackBoxes_C_UserConstructionScript");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_BlackBoxes_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000028, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, Temp_int_Variable_1) == 0x000038, "Member 'BP_BlackBoxes_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000048, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000078, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_SelectVector_ReturnValue) == 0x000098, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_AddInstance_ReturnValue) == 0x000110, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BlackBoxes_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000114, "Member 'BP_BlackBoxes_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

}

