#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bed.BP_Bed_C
// 0x0020 (0x0350 - 0x0330)
class ABP_Bed_C : public ABedView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USignalSenderComponent*                 SenderOnInteracted;                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverInteractOff;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverInteractOn;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Bed(int32 EntryPoint);
	void BndEvt__BP_Bed_SleepComponent_K2Node_ComponentBoundEvent_2_InteractSignature__DelegateSignature();
	void BndEvt__BP_Bed_ReceiverInteractOn_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Bed_ReceiverInteractOff_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bed_C">();
	}
	static class ABP_Bed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bed_C>();
	}
};
static_assert(alignof(ABP_Bed_C) == 0x000008, "Wrong alignment on ABP_Bed_C");
static_assert(sizeof(ABP_Bed_C) == 0x000350, "Wrong size on ABP_Bed_C");
static_assert(offsetof(ABP_Bed_C, UberGraphFrame) == 0x000330, "Member 'ABP_Bed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Bed_C, SenderOnInteracted) == 0x000338, "Member 'ABP_Bed_C::SenderOnInteracted' has a wrong offset!");
static_assert(offsetof(ABP_Bed_C, ReceiverInteractOff) == 0x000340, "Member 'ABP_Bed_C::ReceiverInteractOff' has a wrong offset!");
static_assert(offsetof(ABP_Bed_C, ReceiverInteractOn) == 0x000348, "Member 'ABP_Bed_C::ReceiverInteractOn' has a wrong offset!");

}

