#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CodeLock

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_CodeLock.BP_CodeLock_C.BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_CodeLock_C_BndEvt__BP_CodeLock_ReceiverOFF_K2Node_ComponentBoundEvent_7_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_CodeLock.BP_CodeLock_C.BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_CodeLock_C_BndEvt__BP_CodeLock_SignalReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_CodeLock.BP_CodeLock_C.ExecuteUbergraph_BP_CodeLock
// 0x0068 (0x0068 - 0x0000)
struct BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue_1;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock) == 0x000008, "Wrong alignment on BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock");
static_assert(sizeof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock) == 0x000068, "Wrong size on BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, EntryPoint) == 0x000000, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, Temp_delegate_Variable) == 0x000004, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_IsEnabled_ReturnValue) == 0x000034, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_IsSelfSufficient_ReturnValue) == 0x000035, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_IsSelfSufficient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, K2Node_ComponentBoundEvent_DataObject_1) == 0x000038, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, K2Node_ComponentBoundEvent_DataObject) == 0x000040, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_PostAkEvent_ReturnValue_1) == 0x00004C, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_PostAkEvent_ReturnValue_2) == 0x000050, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_IsEnabled_ReturnValue_1) == 0x000054, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_IsEnabled_ReturnValue_2) == 0x000055, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock, CallFunc_IsSelfSufficient_ReturnValue_1) == 0x000060, "Member 'BP_CodeLock_C_ExecuteUbergraph_BP_CodeLock::CallFunc_IsSelfSufficient_ReturnValue_1' has a wrong offset!");

}

