#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Diesel_Generator_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Diesel_Generator_Base.BP_Diesel_Generator_Base_C
// 0x00B8 (0x03A0 - 0x02E8)
class ABP_Diesel_Generator_Base_C : public AInteractableObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_BaseForceFeedbackSphere_C*          GeneratorForceFeedbackSphere;                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USingleClickComponent*                  SingleClickOff;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lever;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverOff;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverOn;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalSenderComponent*                 SenderOff;                                         // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalSenderComponent*                 SenderOn;                                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USingleClickComponent*                  SingleClickOn;                                     // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Base;                                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_ValveRotation_86CA2DF6472992857A03A299BEDF4844; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_86CA2DF6472992857A03A299BEDF4844; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_ValveRotation_6F0411D347E94CA8EA4689A94DC19E2A; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_6F0411D347E94CA8EA4689A94DC19E2A; // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ValveRotation_963082C041162126F15E99B109ACA831; // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_963082C041162126F15E99B109ACA831; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ValveRotation_27EC3C56470DB994201CC283BF33BD03; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_27EC3C56470DB994201CC283BF33BD03; // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AKEventStart;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEventStop;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AObj*                                   Sender_Obj;                                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Diesel_Generator_Base_SingleClickOff_K2Node_ComponentBoundEvent_4_InteractSignature__DelegateSignature();
	void BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Diesel_Generator_SingleClick_K2Node_ComponentBoundEvent_3_InteractSignature__DelegateSignature();
	void ExecuteUbergraph_BP_Diesel_Generator_Base(int32 EntryPoint);
	void FTurnOff();
	void FTurnOn();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Diesel_Generator_Base_C">();
	}
	static class ABP_Diesel_Generator_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Diesel_Generator_Base_C>();
	}
};
static_assert(alignof(ABP_Diesel_Generator_Base_C) == 0x000008, "Wrong alignment on ABP_Diesel_Generator_Base_C");
static_assert(sizeof(ABP_Diesel_Generator_Base_C) == 0x0003A0, "Wrong size on ABP_Diesel_Generator_Base_C");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_Diesel_Generator_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, GeneratorForceFeedbackSphere) == 0x0002F0, "Member 'ABP_Diesel_Generator_Base_C::GeneratorForceFeedbackSphere' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, SingleClickOff) == 0x0002F8, "Member 'ABP_Diesel_Generator_Base_C::SingleClickOff' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Lever) == 0x000300, "Member 'ABP_Diesel_Generator_Base_C::Lever' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, ReceiverOff) == 0x000308, "Member 'ABP_Diesel_Generator_Base_C::ReceiverOff' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, ReceiverOn) == 0x000310, "Member 'ABP_Diesel_Generator_Base_C::ReceiverOn' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, SenderOff) == 0x000318, "Member 'ABP_Diesel_Generator_Base_C::SenderOff' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, SenderOn) == 0x000320, "Member 'ABP_Diesel_Generator_Base_C::SenderOn' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Niagara) == 0x000328, "Member 'ABP_Diesel_Generator_Base_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Ak) == 0x000330, "Member 'ABP_Diesel_Generator_Base_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, SingleClickOn) == 0x000338, "Member 'ABP_Diesel_Generator_Base_C::SingleClickOn' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Base) == 0x000340, "Member 'ABP_Diesel_Generator_Base_C::Base' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_2_ValveRotation_86CA2DF6472992857A03A299BEDF4844) == 0x000348, "Member 'ABP_Diesel_Generator_Base_C::Timeline_2_ValveRotation_86CA2DF6472992857A03A299BEDF4844' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_2__Direction_86CA2DF6472992857A03A299BEDF4844) == 0x00034C, "Member 'ABP_Diesel_Generator_Base_C::Timeline_2__Direction_86CA2DF6472992857A03A299BEDF4844' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_2) == 0x000350, "Member 'ABP_Diesel_Generator_Base_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_1_ValveRotation_6F0411D347E94CA8EA4689A94DC19E2A) == 0x000358, "Member 'ABP_Diesel_Generator_Base_C::Timeline_1_ValveRotation_6F0411D347E94CA8EA4689A94DC19E2A' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_1__Direction_6F0411D347E94CA8EA4689A94DC19E2A) == 0x00035C, "Member 'ABP_Diesel_Generator_Base_C::Timeline_1__Direction_6F0411D347E94CA8EA4689A94DC19E2A' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_1) == 0x000360, "Member 'ABP_Diesel_Generator_Base_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_0_ValveRotation_963082C041162126F15E99B109ACA831) == 0x000368, "Member 'ABP_Diesel_Generator_Base_C::Timeline_0_ValveRotation_963082C041162126F15E99B109ACA831' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_0__Direction_963082C041162126F15E99B109ACA831) == 0x00036C, "Member 'ABP_Diesel_Generator_Base_C::Timeline_0__Direction_963082C041162126F15E99B109ACA831' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_0) == 0x000370, "Member 'ABP_Diesel_Generator_Base_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline_ValveRotation_27EC3C56470DB994201CC283BF33BD03) == 0x000378, "Member 'ABP_Diesel_Generator_Base_C::Timeline_ValveRotation_27EC3C56470DB994201CC283BF33BD03' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline__Direction_27EC3C56470DB994201CC283BF33BD03) == 0x00037C, "Member 'ABP_Diesel_Generator_Base_C::Timeline__Direction_27EC3C56470DB994201CC283BF33BD03' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Timeline) == 0x000380, "Member 'ABP_Diesel_Generator_Base_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, AKEventStart) == 0x000388, "Member 'ABP_Diesel_Generator_Base_C::AKEventStart' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, AkEventStop) == 0x000390, "Member 'ABP_Diesel_Generator_Base_C::AkEventStop' has a wrong offset!");
static_assert(offsetof(ABP_Diesel_Generator_Base_C, Sender_Obj) == 0x000398, "Member 'ABP_Diesel_Generator_Base_C::Sender_Obj' has a wrong offset!");

}

