#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorView

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_CloseDoorReceiver_K2Node_ComponentBoundEvent_25_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_ForceCloseDoorReceiver_K2Node_ComponentBoundEvent_29_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_ForceOpenDoorReceiver_K2Node_ComponentBoundEvent_28_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorLockReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_InvertDoorStateReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_LockDoorReceiver_K2Node_ComponentBoundEvent_26_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_OpenDoorReceiver_K2Node_ComponentBoundEvent_24_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorView_UnlockDoorReceiver_K2Node_ComponentBoundEvent_27_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_DoorView_C_BndEvt__BP_DoorViewTest_PeekDoorReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_DoorView.BP_DoorView_C.ExecuteUbergraph_BP_DoorView
// 0x0050 (0x0050 - 0x0000)
struct BP_DoorView_C_ExecuteUbergraph_BP_DoorView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_8;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_7;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_6;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_5;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_4;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_3;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_2;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView) == 0x000008, "Wrong alignment on BP_DoorView_C_ExecuteUbergraph_BP_DoorView");
static_assert(sizeof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView) == 0x000050, "Wrong size on BP_DoorView_C_ExecuteUbergraph_BP_DoorView");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, EntryPoint) == 0x000000, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_8) == 0x000008, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_8' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_7) == 0x000010, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_7' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_6) == 0x000018, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_6' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_5) == 0x000020, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_5' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_4) == 0x000028, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_4' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_3) == 0x000030, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_3' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_2) == 0x000038, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_2' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject_1) == 0x000040, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_DoorView_C_ExecuteUbergraph_BP_DoorView, K2Node_ComponentBoundEvent_DataObject) == 0x000048, "Member 'BP_DoorView_C_ExecuteUbergraph_BP_DoorView::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");

}

