#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Diesel_Generator_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Diesel_Generator_Base.BP_Diesel_Generator_Base_C.BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOff_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Diesel_Generator_Base.BP_Diesel_Generator_Base_C.BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Diesel_Generator_Base_C_BndEvt__BP_Diesel_Generator_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Diesel_Generator_Base.BP_Diesel_Generator_Base_C.ExecuteUbergraph_BP_Diesel_Generator_Base
// 0x0480 (0x0480 - 0x0000)
struct BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Toggle_ReturnValue;                       // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x01B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsEnabled_ReturnValue_3;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0398(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base) == 0x000008, "Wrong alignment on BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base");
static_assert(sizeof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base) == 0x000480, "Wrong size on BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, EntryPoint) == 0x000000, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, Temp_delegate_Variable) == 0x000004, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_MakeRotator_ReturnValue_1) == 0x000040, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, Temp_delegate_Variable_2) == 0x000058, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, Temp_delegate_Variable_3) == 0x000068, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_MakeRotator_ReturnValue_2) == 0x000078, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_MakeRotator_ReturnValue_3) == 0x000090, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_IsEnabled_ReturnValue) == 0x0000A8, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_PostAkEvent_ReturnValue) == 0x0000AC, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_PostAkEvent_ReturnValue_1) == 0x0000B0, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, K2Node_ComponentBoundEvent_DataObject_1) == 0x0000B8, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, K2Node_ComponentBoundEvent_DataObject) == 0x0000C0, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_IsEnabled_ReturnValue_1) == 0x0000C8, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_IsEnabled_ReturnValue_2) == 0x0000C9, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_Toggle_ReturnValue) == 0x0000CA, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_Toggle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000D0, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0001B8, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_IsEnabled_ReturnValue_3) == 0x0002A0, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_IsEnabled_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_PostAkEvent_ReturnValue_2) == 0x0002A4, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_PostAkEvent_ReturnValue_3) == 0x0002A8, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x0002B0, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x000398, "Member 'BP_Diesel_Generator_Base_C_ExecuteUbergraph_BP_Diesel_Generator_Base::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");

}

