#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Env_Bat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Env_Bat.BP_Env_Bat_C
// 0x0038 (0x02D0 - 0x0298)
class ABP_Env_Bat_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWildlifeBehaviourComponent*            WildlifeBehaviour;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticEnvironmentNiagaraComponent*     StaticEnvironmentNiagara;                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ScaredSFX;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          IdleSFX;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_Env_Bat(int32 EntryPoint);
	void OnEmissionWeatherStarted();
	void ReceiveBeginPlay();
	void TryPlayScaredSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Env_Bat_C">();
	}
	static class ABP_Env_Bat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Env_Bat_C>();
	}
};
static_assert(alignof(ABP_Env_Bat_C) == 0x000008, "Wrong alignment on ABP_Env_Bat_C");
static_assert(sizeof(ABP_Env_Bat_C) == 0x0002D0, "Wrong size on ABP_Env_Bat_C");
static_assert(offsetof(ABP_Env_Bat_C, UberGraphFrame) == 0x000298, "Member 'ABP_Env_Bat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, WildlifeBehaviour) == 0x0002A0, "Member 'ABP_Env_Bat_C::WildlifeBehaviour' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, StaticEnvironmentNiagara) == 0x0002A8, "Member 'ABP_Env_Bat_C::StaticEnvironmentNiagara' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, Sphere) == 0x0002B0, "Member 'ABP_Env_Bat_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Env_Bat_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, ScaredSFX) == 0x0002C0, "Member 'ABP_Env_Bat_C::ScaredSFX' has a wrong offset!");
static_assert(offsetof(ABP_Env_Bat_C, IdleSFX) == 0x0002C8, "Member 'ABP_Env_Bat_C::IdleSFX' has a wrong offset!");

}

