#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Env_Crow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Env_Crow.BP_Env_Crow_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_Env_Crow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWildlifeBehaviourComponent*            WildlifeBehaviour;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticEnvironmentNiagaraComponent*     StaticEnvironmentNiagara;                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Fly_E4A071044EC4A5DDB08E69B2B90CC5E9;   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_E4A071044EC4A5DDB08E69B2B90CC5E9; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ScaredSFX;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          IdleSFX;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_Env_Crow(int32 EntryPoint);
	void OnEmissionWeatherStarted();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void TryPlayScaredSound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Env_Crow_C">();
	}
	static class ABP_Env_Crow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Env_Crow_C>();
	}
};
static_assert(alignof(ABP_Env_Crow_C) == 0x000008, "Wrong alignment on ABP_Env_Crow_C");
static_assert(sizeof(ABP_Env_Crow_C) == 0x0002E0, "Wrong size on ABP_Env_Crow_C");
static_assert(offsetof(ABP_Env_Crow_C, UberGraphFrame) == 0x000298, "Member 'ABP_Env_Crow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, WildlifeBehaviour) == 0x0002A0, "Member 'ABP_Env_Crow_C::WildlifeBehaviour' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, StaticEnvironmentNiagara) == 0x0002A8, "Member 'ABP_Env_Crow_C::StaticEnvironmentNiagara' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, Sphere) == 0x0002B0, "Member 'ABP_Env_Crow_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Env_Crow_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, Timeline_0_Fly_E4A071044EC4A5DDB08E69B2B90CC5E9) == 0x0002C0, "Member 'ABP_Env_Crow_C::Timeline_0_Fly_E4A071044EC4A5DDB08E69B2B90CC5E9' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, Timeline_0__Direction_E4A071044EC4A5DDB08E69B2B90CC5E9) == 0x0002C4, "Member 'ABP_Env_Crow_C::Timeline_0__Direction_E4A071044EC4A5DDB08E69B2B90CC5E9' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, Timeline_0) == 0x0002C8, "Member 'ABP_Env_Crow_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, ScaredSFX) == 0x0002D0, "Member 'ABP_Env_Crow_C::ScaredSFX' has a wrong offset!");
static_assert(offsetof(ABP_Env_Crow_C, IdleSFX) == 0x0002D8, "Member 'ABP_Env_Crow_C::IdleSFX' has a wrong offset!");

}

