#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Env_Crow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Env_Crow.BP_Env_Crow_C.TryPlayScaredSound
// 0x0030 (0x0030 - 0x0000)
struct BP_Env_Crow_C_TryPlayScaredSound final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoundInProximity_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Env_Crow_C_TryPlayScaredSound) == 0x000008, "Wrong alignment on BP_Env_Crow_C_TryPlayScaredSound");
static_assert(sizeof(BP_Env_Crow_C_TryPlayScaredSound) == 0x000030, "Wrong size on BP_Env_Crow_C_TryPlayScaredSound");
static_assert(offsetof(BP_Env_Crow_C_TryPlayScaredSound, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Env_Crow_C_TryPlayScaredSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_TryPlayScaredSound, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Env_Crow_C_TryPlayScaredSound::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_TryPlayScaredSound, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000020, "Member 'BP_Env_Crow_C_TryPlayScaredSound::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_TryPlayScaredSound, CallFunc_IsSoundInProximity_ReturnValue) == 0x000028, "Member 'BP_Env_Crow_C_TryPlayScaredSound::CallFunc_IsSoundInProximity_ReturnValue' has a wrong offset!");

// Function BP_Env_Crow.BP_Env_Crow_C.ExecuteUbergraph_BP_Env_Crow
// 0x0118 (0x0118 - 0x0000)
struct BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow) == 0x000008, "Wrong alignment on BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow");
static_assert(sizeof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow) == 0x000118, "Wrong size on BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, EntryPoint) == 0x000000, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, Temp_bool_Has_Been_Initd_Variable) == 0x000110, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow, Temp_bool_IsClosed_Variable) == 0x000111, "Member 'BP_Env_Crow_C_ExecuteUbergraph_BP_Env_Crow::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_Env_Crow.BP_Env_Crow_C.BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Env_Crow_C_BndEvt__BP_CrowLifeUp_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

