#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Note_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_Note_Base.BP_Interactable_Note_Base_C.ExecuteUbergraph_BP_Interactable_Note_Base
// 0x001C (0x001C - 0x0000)
struct BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base) == 0x000004, "Wrong alignment on BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base");
static_assert(sizeof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base) == 0x00001C, "Wrong size on BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base");
static_assert(offsetof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base, EntryPoint) == 0x000000, "Member 'BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base, Temp_delegate_Variable) == 0x000004, "Member 'BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base, CallFunc_IsEnabled_ReturnValue) == 0x000014, "Member 'BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base, CallFunc_PostAkEvent_ReturnValue) == 0x000018, "Member 'BP_Interactable_Note_Base_C_ExecuteUbergraph_BP_Interactable_Note_Base::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

