#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Note_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_Note_Base.BP_Interactable_Note_Base_C
// 0x0038 (0x0320 - 0x02E8)
class ABP_Interactable_Note_Base_C : public AInteractableObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalSenderComponent*                 SignalSender;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USingleClickComponent*                  SingleClick;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            New_mesh;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEventPickUp;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Interactable_Note_SingleClick_K2Node_ComponentBoundEvent_0_InteractSignature__DelegateSignature();
	void ExecuteUbergraph_BP_Interactable_Note_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_Note_Base_C">();
	}
	static class ABP_Interactable_Note_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_Note_Base_C>();
	}
};
static_assert(alignof(ABP_Interactable_Note_Base_C) == 0x000008, "Wrong alignment on ABP_Interactable_Note_Base_C");
static_assert(sizeof(ABP_Interactable_Note_Base_C) == 0x000320, "Wrong size on ABP_Interactable_Note_Base_C");
static_assert(offsetof(ABP_Interactable_Note_Base_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_Interactable_Note_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, Ak) == 0x0002F0, "Member 'ABP_Interactable_Note_Base_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, SignalSender) == 0x0002F8, "Member 'ABP_Interactable_Note_Base_C::SignalSender' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, SingleClick) == 0x000300, "Member 'ABP_Interactable_Note_Base_C::SingleClick' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, StaticMesh) == 0x000308, "Member 'ABP_Interactable_Note_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, New_mesh) == 0x000310, "Member 'ABP_Interactable_Note_Base_C::New_mesh' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Note_Base_C, AkEventPickUp) == 0x000318, "Member 'ABP_Interactable_Note_Base_C::AkEventPickUp' has a wrong offset!");

}

