#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Radio_120

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_Radio_120.BP_Interactable_Radio_120_C.BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature final
{
public:
	struct FUID                                   LastDamageDealerUID;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bProjectileFlownThroughObject;                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature) == 0x000004, "Wrong alignment on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature");
static_assert(sizeof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature) == 0x000008, "Wrong size on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature");
static_assert(offsetof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature, LastDamageDealerUID) == 0x000000, "Member 'BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature::LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature, bProjectileFlownThroughObject) == 0x000004, "Member 'BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_DamageInteractable_K2Node_ComponentBoundEvent_6_OnDamageAccumulated__DelegateSignature::bProjectileFlownThroughObject' has a wrong offset!");

// Function BP_Interactable_Radio_120.BP_Interactable_Radio_120_C.BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Interactable_Radio_120.BP_Interactable_Radio_120_C.BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Interactable_Radio_120_C_BndEvt__BP_Interactable_Radio_120_ReceiverOn_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Interactable_Radio_120.BP_Interactable_Radio_120_C.ExecuteUbergraph_BP_Interactable_Radio_120
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnbreakable_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUID                                   K2Node_ComponentBoundEvent_LastDamageDealerUID;    // 0x0090(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bProjectileFlownThroughObject; // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120) == 0x000008, "Wrong alignment on BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120");
static_assert(sizeof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120) == 0x0000B0, "Wrong size on BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, EntryPoint) == 0x000000, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_IsEnabled_ReturnValue) == 0x000004, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, Temp_delegate_Variable) == 0x000008, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, Temp_delegate_Variable_1) == 0x000018, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, Temp_delegate_Variable_2) == 0x000028, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, Temp_delegate_Variable_3) == 0x000038, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, Temp_delegate_Variable_4) == 0x000048, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_IsUnbreakable_ReturnValue) == 0x000070, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_IsUnbreakable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_PostAkEvent_ReturnValue) == 0x000074, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_IsBroken_ReturnValue) == 0x000078, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_IsEnabled_ReturnValue_1) == 0x000079, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, K2Node_ComponentBoundEvent_DataObject_1) == 0x000080, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, K2Node_ComponentBoundEvent_DataObject) == 0x000088, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, K2Node_ComponentBoundEvent_LastDamageDealerUID) == 0x000090, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::K2Node_ComponentBoundEvent_LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, K2Node_ComponentBoundEvent_bProjectileFlownThroughObject) == 0x000094, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::K2Node_ComponentBoundEvent_bProjectileFlownThroughObject' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_PostAkEvent_ReturnValue_1) == 0x000098, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_PostAkEvent_ReturnValue_2) == 0x00009C, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_PostAkEvent_ReturnValue_3) == 0x0000A0, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_PostAkEvent_ReturnValue_4) == 0x0000A4, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120, CallFunc_IsEnabled_ReturnValue_2) == 0x0000A8, "Member 'BP_Interactable_Radio_120_C_ExecuteUbergraph_BP_Interactable_Radio_120::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");

}

