#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_ele_wall_lamp_04

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_L_ele_wall_lamp_04.BP_L_ele_wall_lamp_04_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_L_ele_wall_lamp_04_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_L_ele_wall_lamp_04_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_L_ele_wall_lamp_04_C_UserConstructionScript");
static_assert(sizeof(BP_L_ele_wall_lamp_04_C_UserConstructionScript) == 0x000018, "Wrong size on BP_L_ele_wall_lamp_04_C_UserConstructionScript");
static_assert(offsetof(BP_L_ele_wall_lamp_04_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_L_ele_wall_lamp_04_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_ele_wall_lamp_04_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_L_ele_wall_lamp_04_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_L_ele_wall_lamp_04_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_L_ele_wall_lamp_04_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

}

