#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lever_Vertical

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Lever_Vertical_C_BndEvt__BP_Button_ReceiverOff_K2Node_ComponentBoundEvent_11_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Lever_Vertical_C_BndEvt__BP_Button_SignalReceiver_K2Node_ComponentBoundEvent_8_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature final
{
public:
	struct FUID                                   LastDamageDealerUID;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bProjectileFlownThroughObject;                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature) == 0x000004, "Wrong alignment on BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature");
static_assert(sizeof(BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature) == 0x000008, "Wrong size on BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature");
static_assert(offsetof(BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature, LastDamageDealerUID) == 0x000000, "Member 'BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature::LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature, bProjectileFlownThroughObject) == 0x000004, "Member 'BP_Lever_Vertical_C_BndEvt__BP_Lever_Vertical_DamageInteractable_K2Node_ComponentBoundEvent_0_OnDamageAccumulated__DelegateSignature::bProjectileFlownThroughObject' has a wrong offset!");

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.ExecuteUbergraph_BP_Lever_Vertical
// 0x0058 (0x0058 - 0x0000)
struct BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Toggle_ReturnValue;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnbreakable_ReturnValue;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrerequisiteRequired_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrerequisiteRequired_ReturnValue_1;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue_1;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPrerequisiteRequired_ReturnValue_2;     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUID                                   K2Node_ComponentBoundEvent_LastDamageDealerUID;    // 0x004C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bProjectileFlownThroughObject; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInteractPaint;                       // 0x0051(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical) == 0x000008, "Wrong alignment on BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical");
static_assert(sizeof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical) == 0x000058, "Wrong size on BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, EntryPoint) == 0x000000, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, Temp_delegate_Variable) == 0x000004, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, K2Node_ComponentBoundEvent_DataObject_1) == 0x000028, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, K2Node_ComponentBoundEvent_DataObject) == 0x000030, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsBroken_ReturnValue) == 0x000038, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_Toggle_ReturnValue) == 0x000039, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_Toggle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsEnabled_ReturnValue) == 0x00003A, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsSelfSufficient_ReturnValue) == 0x00003B, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsSelfSufficient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsUnbreakable_ReturnValue) == 0x00003D, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsUnbreakable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_PostAkEvent_ReturnValue_1) == 0x000044, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsPrerequisiteRequired_ReturnValue) == 0x000048, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsPrerequisiteRequired_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsPrerequisiteRequired_ReturnValue_1) == 0x000049, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsPrerequisiteRequired_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsSelfSufficient_ReturnValue_1) == 0x00004A, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsSelfSufficient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, CallFunc_IsPrerequisiteRequired_ReturnValue_2) == 0x00004B, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::CallFunc_IsPrerequisiteRequired_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, K2Node_ComponentBoundEvent_LastDamageDealerUID) == 0x00004C, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::K2Node_ComponentBoundEvent_LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, K2Node_ComponentBoundEvent_bProjectileFlownThroughObject) == 0x000050, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::K2Node_ComponentBoundEvent_bProjectileFlownThroughObject' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical, K2Node_Event_bInteractPaint) == 0x000051, "Member 'BP_Lever_Vertical_C_ExecuteUbergraph_BP_Lever_Vertical::K2Node_Event_bInteractPaint' has a wrong offset!");

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.OnPaintSettingsChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Lever_Vertical_C_OnPaintSettingsChanged final
{
public:
	bool                                          bInteractPaint;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_OnPaintSettingsChanged) == 0x000001, "Wrong alignment on BP_Lever_Vertical_C_OnPaintSettingsChanged");
static_assert(sizeof(BP_Lever_Vertical_C_OnPaintSettingsChanged) == 0x000001, "Wrong size on BP_Lever_Vertical_C_OnPaintSettingsChanged");
static_assert(offsetof(BP_Lever_Vertical_C_OnPaintSettingsChanged, bInteractPaint) == 0x000000, "Member 'BP_Lever_Vertical_C_OnPaintSettingsChanged::bInteractPaint' has a wrong offset!");

// Function BP_Lever_Vertical.BP_Lever_Vertical_C.StateChange
// 0x0038 (0x0038 - 0x0000)
struct BP_Lever_Vertical_C_StateChange final
{
public:
	bool                                          CallFunc_IsSelfSufficient_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_1;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Lever_Vertical_C*               K2Node_DynamicCast_AsAnim_BP_Lever_Vertical;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimBP_Lever_Vertical_C*               K2Node_DynamicCast_AsAnim_BP_Lever_Vertical_1;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lever_Vertical_C_StateChange) == 0x000008, "Wrong alignment on BP_Lever_Vertical_C_StateChange");
static_assert(sizeof(BP_Lever_Vertical_C_StateChange) == 0x000038, "Wrong size on BP_Lever_Vertical_C_StateChange");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_IsSelfSufficient_ReturnValue) == 0x000000, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_IsSelfSufficient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_IsBroken_ReturnValue) == 0x000001, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_IsBroken_ReturnValue_1) == 0x000002, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_IsBroken_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, K2Node_DynamicCast_AsAnim_BP_Lever_Vertical) == 0x000018, "Member 'BP_Lever_Vertical_C_StateChange::K2Node_DynamicCast_AsAnim_BP_Lever_Vertical' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Lever_Vertical_C_StateChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, K2Node_DynamicCast_AsAnim_BP_Lever_Vertical_1) == 0x000028, "Member 'BP_Lever_Vertical_C_StateChange::K2Node_DynamicCast_AsAnim_BP_Lever_Vertical_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Lever_Vertical_C_StateChange::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Lever_Vertical_C_StateChange, CallFunc_IsEnabled_ReturnValue) == 0x000031, "Member 'BP_Lever_Vertical_C_StateChange::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");

}

