#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Latch_Cit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Latch_Cit.BP_Latch_Cit_C
// 0x0040 (0x0328 - 0x02E8)
class ABP_Latch_Cit_C final : public AInteractableObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_BaseForceFeedbackSphere_C*          BP_BaseForceFeedbackSphere;                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverUnlock;                                    // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalSenderComponent*                 SenderUnlock;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USingleClickComponent*                  SingleClick;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractVolume;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEventOpen;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Latch_SingleClick_K2Node_ComponentBoundEvent_0_InteractSignature__DelegateSignature();
	void ExecuteUbergraph_BP_Latch_Cit(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Latch_Cit_C">();
	}
	static class ABP_Latch_Cit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Latch_Cit_C>();
	}
};
static_assert(alignof(ABP_Latch_Cit_C) == 0x000008, "Wrong alignment on ABP_Latch_Cit_C");
static_assert(sizeof(ABP_Latch_Cit_C) == 0x000328, "Wrong size on ABP_Latch_Cit_C");
static_assert(offsetof(ABP_Latch_Cit_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_Latch_Cit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, BP_BaseForceFeedbackSphere) == 0x0002F0, "Member 'ABP_Latch_Cit_C::BP_BaseForceFeedbackSphere' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, ReceiverUnlock) == 0x0002F8, "Member 'ABP_Latch_Cit_C::ReceiverUnlock' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, Ak) == 0x000300, "Member 'ABP_Latch_Cit_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, SenderUnlock) == 0x000308, "Member 'ABP_Latch_Cit_C::SenderUnlock' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, SingleClick) == 0x000310, "Member 'ABP_Latch_Cit_C::SingleClick' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, InteractVolume) == 0x000318, "Member 'ABP_Latch_Cit_C::InteractVolume' has a wrong offset!");
static_assert(offsetof(ABP_Latch_Cit_C, AkEventOpen) == 0x000320, "Member 'ABP_Latch_Cit_C::AkEventOpen' has a wrong offset!");

}

