#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_FakeInteriorLight_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_L_FakeInteriorLight_01.BP_L_FakeInteriorLight_01_C
// 0x0048 (0x02E0 - 0x0298)
class ABP_L_FakeInteriorLight_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_mod_fake_interior_02;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 Color;                                             // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Distance;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Power;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Temperature;                                   // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        TemperatureState;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_L_FakeInteriorLight_01(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_L_FakeInteriorLight_01_C">();
	}
	static class ABP_L_FakeInteriorLight_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_L_FakeInteriorLight_01_C>();
	}
};
static_assert(alignof(ABP_L_FakeInteriorLight_01_C) == 0x000008, "Wrong alignment on ABP_L_FakeInteriorLight_01_C");
static_assert(sizeof(ABP_L_FakeInteriorLight_01_C) == 0x0002E0, "Wrong size on ABP_L_FakeInteriorLight_01_C");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, UberGraphFrame) == 0x000298, "Member 'ABP_L_FakeInteriorLight_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, SM_mod_fake_interior_02) == 0x0002A0, "Member 'ABP_L_FakeInteriorLight_01_C::SM_mod_fake_interior_02' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_L_FakeInteriorLight_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, Color) == 0x0002B0, "Member 'ABP_L_FakeInteriorLight_01_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, Distance) == 0x0002B8, "Member 'ABP_L_FakeInteriorLight_01_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, Power) == 0x0002C0, "Member 'ABP_L_FakeInteriorLight_01_C::Power' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, Use_Temperature) == 0x0002C8, "Member 'ABP_L_FakeInteriorLight_01_C::Use_Temperature' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, Temperature) == 0x0002D0, "Member 'ABP_L_FakeInteriorLight_01_C::Temperature' has a wrong offset!");
static_assert(offsetof(ABP_L_FakeInteriorLight_01_C, TemperatureState) == 0x0002D8, "Member 'ABP_L_FakeInteriorLight_01_C::TemperatureState' has a wrong offset!");

}

