#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Light_Param

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_LightPresset_Radius_structs.hpp"
#include "S_LightPresset_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_LightPresset_Color_structs.hpp"


namespace SDK::Params
{

// Function BP_Light_Param.BP_Light_Param_C.ExecuteUbergraph_BP_Light_Param
// 0x0820 (0x0820 - 0x0000)
struct BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_AttenuationRadius;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ShadowBias;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ShadowSlopeBias;                // 0x0060(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ContactShadowLength;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_CustomEvent_LightFunctionMaterial;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InnerConeAngle;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_OuterConeAngle;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_InnerIntensityMultiplier;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Light_Falloff_Exponen;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_2;      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_3;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_4;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_5;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_5;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_LightIntensity;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_Map_Keys_Keys_1;                          // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_OnOff;                                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPointLightComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USpotLightComponent*>            CallFunc_GetComponentsByTag_ReturnValue_1;         // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item_1;                         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_Array_Get_Item_3;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPointLightComponent*>           CallFunc_GetComponentsByTag_ReturnValue_2;         // 0x01D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPointLightComponent*                   CallFunc_Array_Get_Item_4;                         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CallFunc_Array_Get_Item_5;                         // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    CallFunc_Array_Get_Item_6;                         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_7;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Map_Find_Value;                           // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecalComponent*>                CallFunc_GetComponentsByTag_ReturnValue_3;         // 0x0270(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_11;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue_4;         // 0x0290(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_11;              // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_11;                // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_11;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_12;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_Array_Get_Item_8;                         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_9;                         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue_5;         // 0x02C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_10;                        // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_12;              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_12;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Intensity_Decal;                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ScaleDecal_Z;                   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_OffsetDecal_Z;                  // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Lenght;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Fix_Rotate_Decal;               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Turn_OF_Decal;                  // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Use_location;                   // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32B[0x5];                                      // 0x032B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_12;                // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_13;                  // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDecalComponent*>                CallFunc_GetComponentsByTag_ReturnValue_6;         // 0x03E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UDecalComponent*                        CallFunc_Array_Get_Item_11;                        // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_Array_Get_Item_12;                        // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0400(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x04E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X;                            // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x05E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_13;              // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_11;               // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpotLightComponent*>            CallFunc_GetComponentsByTag_ReturnValue_7;         // 0x06E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_13;                 // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    CallFunc_Array_Get_Item_13;                        // 0x06F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0700(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_12;               // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0750(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0768(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_13;                // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_14;              // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_14;                  // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_13;               // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_14;                        // 0x0790(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Map_Find_Value_1;                         // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_14;                 // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x07B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_14;               // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x3];                                      // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_14;                // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast; // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast_1; // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLightFalloffExponent_NewLightFalloffExponent_ImplicitCast; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOuterConeAngle_NewOuterConeAngle_ImplicitCast; // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetInnerConeAngle_NewInnerConeAngle_ImplicitCast; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ContactShadowLength_ImplicitCast; // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_ContactShadowLength_ImplicitCast_1; // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShadowSlopeBias_NewValue_ImplicitCast; // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShadowSlopeBias_NewValue_ImplicitCast_1; // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShadowBias_NewValue_ImplicitCast;      // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetShadowBias_NewValue_ImplicitCast_1;    // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0804(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param) == 0x000008, "Wrong alignment on BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param");
static_assert(sizeof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param) == 0x000820, "Wrong size on BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, EntryPoint) == 0x000000, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Map_Values_Values) == 0x000020, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_AttenuationRadius) == 0x000050, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_AttenuationRadius' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_ShadowBias) == 0x000058, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_ShadowBias' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_ShadowSlopeBias) == 0x000060, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_ShadowSlopeBias' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_ContactShadowLength) == 0x000068, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_ContactShadowLength' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_LightFunctionMaterial) == 0x000070, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_LightFunctionMaterial' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_InnerConeAngle) == 0x000078, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_InnerConeAngle' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_OuterConeAngle) == 0x000080, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_OuterConeAngle' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_InnerIntensityMultiplier) == 0x000088, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_InnerIntensityMultiplier' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_CustomEvent_Light_Falloff_Exponen) == 0x000090, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_CustomEvent_Light_Falloff_Exponen' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000099, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue) == 0x0000A0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x0000A8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue_1) == 0x0000B0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue_2) == 0x0000B9, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue_2) == 0x0000C0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue_3) == 0x0000C8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue_3) == 0x0000D0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue_4) == 0x0000D8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue_4) == 0x0000E0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_NotEqual_DoubleDouble_ReturnValue_5) == 0x0000E8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_NotEqual_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_FClamp_ReturnValue_5) == 0x0000F0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_FClamp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_1) == 0x0000FC, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_Event_LightIntensity) == 0x000108, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_Event_LightIntensity' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Map_Keys_Keys_1) == 0x000118, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000128, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_3) == 0x00012C, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000130, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x000131, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_2) == 0x000134, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_IsEnabled_ReturnValue) == 0x000138, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, K2Node_Event_OnOff) == 0x000139, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::K2Node_Event_OnOff' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_3) == 0x00013C, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Loop_Counter_Variable_1) == 0x000140, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_4) == 0x000144, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Add_IntInt_ReturnValue_1) == 0x000148, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Loop_Counter_Variable_2) == 0x00014C, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GetComponentsByTag_ReturnValue) == 0x000150, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_5) == 0x000160, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Add_IntInt_ReturnValue_2) == 0x000164, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_GetComponentsByTag_ReturnValue_1) == 0x000168, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_GetComponentsByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_6) == 0x000178, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_4) == 0x00017C, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Loop_Counter_Variable_3) == 0x000180, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_5) == 0x000184, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Get_Item_1) == 0x000188, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_IsValid_ReturnValue_1) == 0x000190, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Add_IntInt_ReturnValue_3) == 0x000194, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_7) == 0x000198, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Get_Item_2) == 0x0001A0, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, CallFunc_Array_Length_ReturnValue_8) == 0x0001A8, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param, Temp_int_Array_Index_Variable_6) == 0x0001AC, "Member 'BP_Light_Param_C_ExecuteUbergraph_BP_Light_Param::Temp_int_Array_Index_Variable_6' has a wrong offset!");
