#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_gen_kerosene_lamp_02_01

#include "Basic.hpp"

#include "BP_Light_Param_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_L_gen_kerosene_lamp_02_01.BP_L_gen_kerosene_lamp_02_01_C
// 0x0028 (0x07B0 - 0x0788)
class ABP_L_gen_kerosene_lamp_02_01_C final : public ABP_Light_Param_C
{
public:
	class UPointLightComponent*                   MainLight;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fire_Kerosene_2;                                // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_gen_kerosene_lamp_02;                           // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Attenuation_Radius;                                // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Light_Falloff_Exponent;                            // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayFlickeringSound();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_L_gen_kerosene_lamp_02_01_C">();
	}
	static class ABP_L_gen_kerosene_lamp_02_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_L_gen_kerosene_lamp_02_01_C>();
	}
};
static_assert(alignof(ABP_L_gen_kerosene_lamp_02_01_C) == 0x000008, "Wrong alignment on ABP_L_gen_kerosene_lamp_02_01_C");
static_assert(sizeof(ABP_L_gen_kerosene_lamp_02_01_C) == 0x0007B0, "Wrong size on ABP_L_gen_kerosene_lamp_02_01_C");
static_assert(offsetof(ABP_L_gen_kerosene_lamp_02_01_C, MainLight) == 0x000788, "Member 'ABP_L_gen_kerosene_lamp_02_01_C::MainLight' has a wrong offset!");
static_assert(offsetof(ABP_L_gen_kerosene_lamp_02_01_C, NS_Fire_Kerosene_2) == 0x000790, "Member 'ABP_L_gen_kerosene_lamp_02_01_C::NS_Fire_Kerosene_2' has a wrong offset!");
static_assert(offsetof(ABP_L_gen_kerosene_lamp_02_01_C, SM_gen_kerosene_lamp_02) == 0x000798, "Member 'ABP_L_gen_kerosene_lamp_02_01_C::SM_gen_kerosene_lamp_02' has a wrong offset!");
static_assert(offsetof(ABP_L_gen_kerosene_lamp_02_01_C, Attenuation_Radius) == 0x0007A0, "Member 'ABP_L_gen_kerosene_lamp_02_01_C::Attenuation_Radius' has a wrong offset!");
static_assert(offsetof(ABP_L_gen_kerosene_lamp_02_01_C, Light_Falloff_Exponent) == 0x0007A8, "Member 'ABP_L_gen_kerosene_lamp_02_01_C::Light_Falloff_Exponent' has a wrong offset!");

}

