#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Latch_Cit

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Latch_Cit.BP_Latch_Cit_C.BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Latch_Cit_C_BndEvt__BP_Latch_ReceiverUnlock_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Latch_Cit.BP_Latch_Cit_C.ExecuteUbergraph_BP_Latch_Cit
// 0x0028 (0x0028 - 0x0000)
struct BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit) == 0x000008, "Wrong alignment on BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit");
static_assert(sizeof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit) == 0x000028, "Wrong size on BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit");
static_assert(offsetof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit, EntryPoint) == 0x000000, "Member 'BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit, Temp_delegate_Variable) == 0x000004, "Member 'BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit, CallFunc_IsEnabled_ReturnValue) == 0x000014, "Member 'BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit, K2Node_ComponentBoundEvent_DataObject) == 0x000018, "Member 'BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit, CallFunc_PostAkEvent_ReturnValue) == 0x000020, "Member 'BP_Latch_Cit_C_ExecuteUbergraph_BP_Latch_Cit::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

