#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_L_AmbientLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "E_AmLightMeshType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_L_AmbientLight.BP_L_AmbientLight_C
// 0x0058 (0x02F0 - 0x0298)
class ABP_L_AmbientLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Emissive;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    StaticMeshes;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_AmLightMeshType                             Type;                                              // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Multiply;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Power;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Temperature;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temperature;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        TemperatureState;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_L_AmbientLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_L_AmbientLight_C">();
	}
	static class ABP_L_AmbientLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_L_AmbientLight_C>();
	}
};
static_assert(alignof(ABP_L_AmbientLight_C) == 0x000008, "Wrong alignment on ABP_L_AmbientLight_C");
static_assert(sizeof(ABP_L_AmbientLight_C) == 0x0002F0, "Wrong size on ABP_L_AmbientLight_C");
static_assert(offsetof(ABP_L_AmbientLight_C, UberGraphFrame) == 0x000298, "Member 'ABP_L_AmbientLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, SM_Emissive) == 0x0002A0, "Member 'ABP_L_AmbientLight_C::SM_Emissive' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_L_AmbientLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, StaticMeshes) == 0x0002B0, "Member 'ABP_L_AmbientLight_C::StaticMeshes' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Type) == 0x0002C0, "Member 'ABP_L_AmbientLight_C::Type' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Color) == 0x0002C4, "Member 'ABP_L_AmbientLight_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Multiply) == 0x0002C8, "Member 'ABP_L_AmbientLight_C::Multiply' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Power) == 0x0002D0, "Member 'ABP_L_AmbientLight_C::Power' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Use_Temperature) == 0x0002D8, "Member 'ABP_L_AmbientLight_C::Use_Temperature' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, Temperature) == 0x0002E0, "Member 'ABP_L_AmbientLight_C::Temperature' has a wrong offset!");
static_assert(offsetof(ABP_L_AmbientLight_C, TemperatureState) == 0x0002E8, "Member 'ABP_L_AmbientLight_C::TemperatureState' has a wrong offset!");

}

