#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mod_stairs_02_for_kit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.Invert Stairs Direction
// 0x0160 (0x0160 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction) == 0x000008, "Wrong alignment on BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction) == 0x000160, "Wrong size on BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, Temp_bool_Variable) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, Temp_struct_Variable) == 0x000008, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000020, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000028, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000040, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, K2Node_Select_Default) == 0x000058, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x000158, "Member 'BP_mod_stairs_02_for_kit_C_Invert_Stairs_Direction::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.PositionLastStepsAndRailings
// 0x03A0 (0x03A0 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings final
{
public:
	struct FVector                                Temp_struct_Variable;                              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x02B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings) == 0x000008, "Wrong alignment on BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings) == 0x0003A0, "Wrong size on BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_struct_Variable) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_struct_Variable_1) == 0x000018, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_bool_Variable) == 0x000030, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_struct_Variable_2) == 0x000038, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_struct_Variable_3) == 0x000050, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, Temp_bool_Variable_1) == 0x000068, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, K2Node_Select_Default) == 0x000088, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, K2Node_Select_Default_1) == 0x0000A0, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000B8, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001A0, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001B8, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001D0, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0002B8, "Member 'BP_mod_stairs_02_for_kit_C_PositionLastStepsAndRailings::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.PositionRemainderRailings
// 0x01C0 (0x01C0 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_PositionRemainderRailings final
{
public:
	struct FVector                                RailingOffset_0;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue_1;     // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue_1;                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings) == 0x000010, "Wrong alignment on BP_mod_stairs_02_for_kit_C_PositionRemainderRailings");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings) == 0x0001C0, "Wrong size on BP_mod_stairs_02_for_kit_C_PositionRemainderRailings");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, RailingOffset_0) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::RailingOffset_0' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_bool_Variable) == 0x000018, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_struct_Variable) == 0x000020, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_struct_Variable_1) == 0x000038, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_bool_Variable_1) == 0x000050, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_struct_Variable_2) == 0x000058, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, Temp_struct_Variable_3) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000088, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, K2Node_Select_Default) == 0x000090, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000C0, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, K2Node_Select_Default_1) == 0x000120, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000138, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_Conv_VectorToTransform_ReturnValue_1) == 0x000150, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_Conv_VectorToTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_AddInstance_ReturnValue) == 0x0001B0, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_PositionRemainderRailings, CallFunc_AddInstance_ReturnValue_1) == 0x0001B4, "Member 'BP_mod_stairs_02_for_kit_C_PositionRemainderRailings::CallFunc_AddInstance_ReturnValue_1' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.SpawnInstancedMainActor
// 0x01F0 (0x01F0 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transforms;                                        // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x00F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor) == 0x000010, "Wrong alignment on BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor) == 0x0001F0, "Wrong size on BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, StaticMesh) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, Transforms) == 0x000010, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::Transforms' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_SetStaticMesh_ReturnValue) == 0x000088, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, Temp_int_Variable) == 0x0000A8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000AC, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x0000F0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Add_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Array_AddUnique_ReturnValue) == 0x0001DC, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x0001E0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedMainActor::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.SpawnInstancedRailingActor
// 0x02B0 (0x02B0 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transforms;                                        // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ShortOffset;                                       // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x0160(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_3;                            // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_VectorFloat_B_ImplicitCast;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor) == 0x000010, "Wrong alignment on BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor) == 0x0002B0, "Wrong size on BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, StaticMesh) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Transforms) == 0x000010, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Transforms' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Left) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Left' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, ShortOffset) == 0x000078, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::ShortOffset' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_struct_Variable) == 0x0000B0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_struct_Variable_1) == 0x0000C8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_bool_Variable) == 0x0000E0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E4, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_int_Variable) == 0x0000E8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, K2Node_Select_Default) == 0x0000F0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000108, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000110, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000140, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000148, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x000160, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Add_IntInt_ReturnValue) == 0x000248, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_struct_Variable_2) == 0x000250, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Array_AddUnique_ReturnValue) == 0x000268, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_bool_Variable_1) == 0x00026C, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, Temp_struct_Variable_3) == 0x000270, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, K2Node_Select_Default_1) == 0x000288, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor, CallFunc_Multiply_VectorFloat_B_ImplicitCast) == 0x0002A0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingActor::CallFunc_Multiply_VectorFloat_B_ImplicitCast' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.SpawnInstancedRailingRemainderActor
// 0x0260 (0x0260 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transforms;                                        // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Left;                                              // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ShortOffset;                                       // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Temp_struct_Variable_1;                            // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_3;                            // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor) == 0x000010, "Wrong alignment on BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor");
static_assert(sizeof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor) == 0x000260, "Wrong size on BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, StaticMesh) == 0x000000, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Transforms) == 0x000010, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Transforms' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Left) == 0x000070, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Left' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, ShortOffset) == 0x000078, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::ShortOffset' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_struct_Variable) == 0x0000A8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_SetStaticMesh_ReturnValue) == 0x0000C0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x0000E0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_struct_Variable_1) == 0x0001C8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_bool_Variable) == 0x0001E0, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, K2Node_Select_Default) == 0x0001E8, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000200, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_bool_Variable_1) == 0x000201, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_struct_Variable_2) == 0x000208, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, CallFunc_Array_AddUnique_ReturnValue) == 0x000220, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, Temp_struct_Variable_3) == 0x000228, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor, K2Node_Select_Default_1) == 0x000240, "Member 'BP_mod_stairs_02_for_kit_C_SpawnInstancedRailingRemainderActor::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_mod_stairs_02_for_kit.BP_mod_stairs_02_for_kit_C.SpawnStaticMeshActorsFromBP
// 0x0370 (0x0370 - 0x0000)
struct BP_mod_stairs_02_for_kit_C_SpawnStaticMeshActorsFromBP final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0xC];                                      // 0x0104(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_3;     // 0x0180(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_4;     // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_5;     // 0x0240(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x02B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x02CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3[0xD];                                      // 0x02D3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_6;     // 0x02E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
