#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mod_stairs_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Stalker2_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_mod_stairs_01_C_BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.ExecuteUbergraph_BP_mod_stairs_01
// 0x00D8 (0x00D8 - 0x0000)
struct BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Event_CollisionType;                        // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_4;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_3;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_2;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTopBlocked_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoundInProximity_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInteractPaint;                       // 0x00B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01");
static_assert(sizeof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01) == 0x0000D8, "Wrong size on BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, EntryPoint) == 0x000000, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000004, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_Event_CollisionType) == 0x000018, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_Event_CollisionType' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_ComponentBoundEvent_DataObject_4) == 0x000030, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_ComponentBoundEvent_DataObject_4' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_ComponentBoundEvent_DataObject_3) == 0x000038, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_ComponentBoundEvent_DataObject_3' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_ComponentBoundEvent_DataObject_2) == 0x000040, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_ComponentBoundEvent_DataObject_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_ComponentBoundEvent_DataObject_1) == 0x000048, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_ComponentBoundEvent_DataObject) == 0x000050, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_IsTopBlocked_ReturnValue) == 0x000058, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_IsTopBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000078, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_PostAkEvent_ReturnValue) == 0x000090, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000098, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_IsSoundInProximity_ReturnValue) == 0x0000A0, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_IsSoundInProximity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_CustomEvent_CallbackType) == 0x0000A1, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_CustomEvent_CallbackInfo) == 0x0000A8, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_Event_bInteractPaint) == 0x0000B0, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_Event_bInteractPaint' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000B2, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000B8, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000D5, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000D6, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01, CallFunc_BooleanOR_ReturnValue) == 0x0000D7, "Member 'BP_mod_stairs_01_C_ExecuteUbergraph_BP_mod_stairs_01::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.OnPaintSettingsChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_mod_stairs_01_C_OnPaintSettingsChanged final
{
public:
	bool                                          bInteractPaint;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_OnPaintSettingsChanged) == 0x000001, "Wrong alignment on BP_mod_stairs_01_C_OnPaintSettingsChanged");
static_assert(sizeof(BP_mod_stairs_01_C_OnPaintSettingsChanged) == 0x000001, "Wrong size on BP_mod_stairs_01_C_OnPaintSettingsChanged");
static_assert(offsetof(BP_mod_stairs_01_C_OnPaintSettingsChanged, bInteractPaint) == 0x000000, "Member 'BP_mod_stairs_01_C_OnPaintSettingsChanged::bInteractPaint' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.OnUnfoldSoundEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_mod_stairs_01_C_OnUnfoldSoundEnded final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_OnUnfoldSoundEnded) == 0x000008, "Wrong alignment on BP_mod_stairs_01_C_OnUnfoldSoundEnded");
static_assert(sizeof(BP_mod_stairs_01_C_OnUnfoldSoundEnded) == 0x000010, "Wrong size on BP_mod_stairs_01_C_OnUnfoldSoundEnded");
static_assert(offsetof(BP_mod_stairs_01_C_OnUnfoldSoundEnded, CallbackType) == 0x000000, "Member 'BP_mod_stairs_01_C_OnUnfoldSoundEnded::CallbackType' has a wrong offset!");
static_assert(offsetof(BP_mod_stairs_01_C_OnUnfoldSoundEnded, CallbackInfo) == 0x000008, "Member 'BP_mod_stairs_01_C_OnUnfoldSoundEnded::CallbackInfo' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.ProtectMeshLock
// 0x0001 (0x0001 - 0x0000)
struct BP_mod_stairs_01_C_ProtectMeshLock final
{
public:
	ECollisionEnabled                             CollisionType;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_mod_stairs_01_C_ProtectMeshLock) == 0x000001, "Wrong alignment on BP_mod_stairs_01_C_ProtectMeshLock");
static_assert(sizeof(BP_mod_stairs_01_C_ProtectMeshLock) == 0x000001, "Wrong size on BP_mod_stairs_01_C_ProtectMeshLock");
static_assert(offsetof(BP_mod_stairs_01_C_ProtectMeshLock, CollisionType) == 0x000000, "Member 'BP_mod_stairs_01_C_ProtectMeshLock::CollisionType' has a wrong offset!");

// Function BP_mod_stairs_01.BP_mod_stairs_01_C.UserConstructionScript
// 0x13B0 (0x13B0 - 0x0000)
struct BP_mod_stairs_01_C_UserConstructionScript final
{
public:
	struct FTransform                             InstanceTransform;                                 // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_2;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_3;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_4;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_5;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_6;                            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_7;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_8;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_9;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_10;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_11;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_12;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_13;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_14;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_15;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_16;                           // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_17;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_18;                           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_19;                           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_20;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_21;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_22;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_23;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ELadderType                                   Temp_byte_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_24;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_25;                           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_26;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_27;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_28;                           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_29;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_30;                           // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_31;                           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_32;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_33;                           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_34;                           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_35;                           // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_36;                           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_37;                           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_38;                           // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_39;                           // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_40;                           // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_41;                           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_42;                           // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_43;                           // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_44;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_45;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_46;                           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_47;                           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_48;                           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_49;                           // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_50;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_51;                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_52;                           // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_53;                           // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_2;       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_54;                           // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_55;                           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_56;                           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_57;                           // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array;                            // 0x02E8(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_1;                          // 0x02F8(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_2;                          // 0x0308(0x0010)(ReferenceParm)
	class UStaticMesh*                            Temp_object_Variable_58;                           // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_59;                           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_3;                          // 0x0340(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_4;                          // 0x0350(0x0010)(ReferenceParm)
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_5;                          // 0x0368(0x0010)(ReferenceParm)
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_6;                          // 0x0380(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_7;                          // 0x0390(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_8;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_9;                          // 0x03B0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_10;                         // 0x03C0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_11;                         // 0x03D0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_Select_Default_2;                           // 0x03E0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_12;                         // 0x03F0(0x0010)(ReferenceParm)
	class UStaticMesh*                            K2Node_Select_Default_3;                           // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_13;                         // 0x0408(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_14;                         // 0x0418(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_15;                         // 0x0428(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_16;                         // 0x0438(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_17;                         // 0x0448(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_18;                         // 0x0458(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_19;                         // 0x0468(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_20;                         // 0x0478(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_Select_Default_4;                           // 0x0488(0x0010)(ReferenceParm)
	class UStaticMesh*                            K2Node_Select_Default_5;                           // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_21;                         // 0x04A0(0x0010)(ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_22;                         // 0x04B0(0x0010)(ReferenceParm)
	class UStaticMesh*                            Temp_object_Variable_60;                           // 0x04C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_Select_Default_6;                           // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Temp_object_Variable_61;                           // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x04F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable_62;                           // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0xF];                                      // 0x0601(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetInstanceTransform_OutInstanceTransform; // 0x0610(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInstanceTransform_ReturnValue;         // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_672[0x6];                                      // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInstanceCount_ReturnValue;             // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0730(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0818(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
