#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mill_Rotator_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mill_Rotator_01.BP_Mill_Rotator_01_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_Mill_Rotator_01_C final : public AActor
{
public:
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_uni_old_mill_01_pillar_big_d;                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mill_Rotator_01_C">();
	}
	static class ABP_Mill_Rotator_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mill_Rotator_01_C>();
	}
};
static_assert(alignof(ABP_Mill_Rotator_01_C) == 0x000008, "Wrong alignment on ABP_Mill_Rotator_01_C");
static_assert(sizeof(ABP_Mill_Rotator_01_C) == 0x0002B0, "Wrong size on ABP_Mill_Rotator_01_C");
static_assert(offsetof(ABP_Mill_Rotator_01_C, RotatingMovement) == 0x000298, "Member 'ABP_Mill_Rotator_01_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_Mill_Rotator_01_C, SM_uni_old_mill_01_pillar_big_d) == 0x0002A0, "Member 'ABP_Mill_Rotator_01_C::SM_uni_old_mill_01_pillar_big_d' has a wrong offset!");
static_assert(offsetof(ABP_Mill_Rotator_01_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_Mill_Rotator_01_C::DefaultSceneRoot' has a wrong offset!");

}

