#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mod_stairs_01

#include "Basic.hpp"

#include "S2_ladder_type_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S2_ladder_material_structs.hpp"
#include "Stalker2_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_mod_stairs_01.BP_mod_stairs_01_C
// 0x0238 (0x0608 - 0x03D0)
class ABP_mod_stairs_01_C final : public AVerticalLadder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FoldedBottomSupportMesh;                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FoldedTopSupportMesh;                              // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               UnhideLadderReceiver;                              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               HideLadderReceiver;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               UnblockLadderTopReceiver;                          // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               BlockLadderTopReceiver;                            // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               EnableFoldedLadderReceiver;                        // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* FoldedMesh;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* ProtectMesh;                                       // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* SupportMesh;                                       // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FirstMesh;                                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LastMesh;                                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* MainMesh;                                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_Minus_Meters;                               // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ES2_ladder_type                               Stairs_Type;                                       // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StairsSubType;                                     // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Stairs_MainMesh;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Stairs_FirstMesh;                                  // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Stairs_LastMesh;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RelativeAddToNextMesh_Height;                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WithSupportMesh_addLoc;                            // 0x0470(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            SupportMesh_Mesh;                                  // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WithProtectMesh_addLoc;                            // 0x0490(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ProtectMesh_Mesh;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         StairsType_FirstMesh;                              // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StairsType_LastMesh;                               // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StairsType_ProtectMesh;                            // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StairsType_SupportMesh;                            // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WithProtectMesh_StepHeight;                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MainMeshPosAdjust;                                 // 0x04C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RandomDestructScale;                               // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Stairs_MainMesh_des;                               // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    Stairs_FirstMesh_des;                              // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    Stairs_LastMesh_des;                               // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    SupportMesh_Mesh_des;                              // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    ProtectMesh_Mesh_des;                              // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMeshComponent*>           ProtectMesh_Mesh_des_using;                        // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        RelativeAddToNextMesh_Height_ProtectMesh;          // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           OnfoldAkComponent;                                 // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ES2_ladder_material                           Ladder_Material;                                   // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Out_Instance_Transform_Location;                   // 0x0560(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar;                                            // 0x0578(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialWood;                                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialMetal;                                     // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MaterialMetalCollector;                            // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      YellowMaterial;                                    // 0x05A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      DefaultMaterial;                                   // 0x05D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__BP_mod_stairs_01_BlockLadderTopReceiver_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_mod_stairs_01_EnableFoldedLadderReceiver_K2Node_ComponentBoundEvent_0_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_mod_stairs_01_HideLadderReceiver_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_mod_stairs_01_LadderComponent_K2Node_ComponentBoundEvent_3_OnUnfoldingStarted__DelegateSignature();
	void BndEvt__BP_mod_stairs_01_LadderComponent_K2Node_ComponentBoundEvent_4_OnUnfoldingEnded__DelegateSignature();
	void BndEvt__BP_mod_stairs_01_UnblockLadderTopReceiver_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_mod_stairs_01_UnhideLadderReceiver_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void ExecuteUbergraph_BP_mod_stairs_01(int32 EntryPoint);
	void OnPaintSettingsChanged(const bool bInteractPaint);
	void OnUnfoldSoundEnded(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void ProtectMeshLock(const ECollisionEnabled CollisionType);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_mod_stairs_01_C">();
	}
	static class ABP_mod_stairs_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_mod_stairs_01_C>();
	}
};
static_assert(alignof(ABP_mod_stairs_01_C) == 0x000008, "Wrong alignment on ABP_mod_stairs_01_C");
static_assert(sizeof(ABP_mod_stairs_01_C) == 0x000608, "Wrong size on ABP_mod_stairs_01_C");
static_assert(offsetof(ABP_mod_stairs_01_C, UberGraphFrame) == 0x0003D0, "Member 'ABP_mod_stairs_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, FoldedBottomSupportMesh) == 0x0003D8, "Member 'ABP_mod_stairs_01_C::FoldedBottomSupportMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, FoldedTopSupportMesh) == 0x0003E0, "Member 'ABP_mod_stairs_01_C::FoldedTopSupportMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, UnhideLadderReceiver) == 0x0003E8, "Member 'ABP_mod_stairs_01_C::UnhideLadderReceiver' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, HideLadderReceiver) == 0x0003F0, "Member 'ABP_mod_stairs_01_C::HideLadderReceiver' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, UnblockLadderTopReceiver) == 0x0003F8, "Member 'ABP_mod_stairs_01_C::UnblockLadderTopReceiver' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, BlockLadderTopReceiver) == 0x000400, "Member 'ABP_mod_stairs_01_C::BlockLadderTopReceiver' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, EnableFoldedLadderReceiver) == 0x000408, "Member 'ABP_mod_stairs_01_C::EnableFoldedLadderReceiver' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, FoldedMesh) == 0x000410, "Member 'ABP_mod_stairs_01_C::FoldedMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, ProtectMesh) == 0x000418, "Member 'ABP_mod_stairs_01_C::ProtectMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, SupportMesh) == 0x000420, "Member 'ABP_mod_stairs_01_C::SupportMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, FirstMesh) == 0x000428, "Member 'ABP_mod_stairs_01_C::FirstMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, LastMesh) == 0x000430, "Member 'ABP_mod_stairs_01_C::LastMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, MainMesh) == 0x000438, "Member 'ABP_mod_stairs_01_C::MainMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Height_Minus_Meters) == 0x000440, "Member 'ABP_mod_stairs_01_C::Height_Minus_Meters' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_Type) == 0x000444, "Member 'ABP_mod_stairs_01_C::Stairs_Type' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, StairsSubType) == 0x000448, "Member 'ABP_mod_stairs_01_C::StairsSubType' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_MainMesh) == 0x000450, "Member 'ABP_mod_stairs_01_C::Stairs_MainMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_FirstMesh) == 0x000458, "Member 'ABP_mod_stairs_01_C::Stairs_FirstMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_LastMesh) == 0x000460, "Member 'ABP_mod_stairs_01_C::Stairs_LastMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, RelativeAddToNextMesh_Height) == 0x000468, "Member 'ABP_mod_stairs_01_C::RelativeAddToNextMesh_Height' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, WithSupportMesh_addLoc) == 0x000470, "Member 'ABP_mod_stairs_01_C::WithSupportMesh_addLoc' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, SupportMesh_Mesh) == 0x000488, "Member 'ABP_mod_stairs_01_C::SupportMesh_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, WithProtectMesh_addLoc) == 0x000490, "Member 'ABP_mod_stairs_01_C::WithProtectMesh_addLoc' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, ProtectMesh_Mesh) == 0x0004A8, "Member 'ABP_mod_stairs_01_C::ProtectMesh_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, StairsType_FirstMesh) == 0x0004B0, "Member 'ABP_mod_stairs_01_C::StairsType_FirstMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, StairsType_LastMesh) == 0x0004B4, "Member 'ABP_mod_stairs_01_C::StairsType_LastMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, StairsType_ProtectMesh) == 0x0004B8, "Member 'ABP_mod_stairs_01_C::StairsType_ProtectMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, StairsType_SupportMesh) == 0x0004BC, "Member 'ABP_mod_stairs_01_C::StairsType_SupportMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, WithProtectMesh_StepHeight) == 0x0004C0, "Member 'ABP_mod_stairs_01_C::WithProtectMesh_StepHeight' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, MainMeshPosAdjust) == 0x0004C8, "Member 'ABP_mod_stairs_01_C::MainMeshPosAdjust' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, RandomDestructScale) == 0x0004E0, "Member 'ABP_mod_stairs_01_C::RandomDestructScale' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_MainMesh_des) == 0x0004E8, "Member 'ABP_mod_stairs_01_C::Stairs_MainMesh_des' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_FirstMesh_des) == 0x0004F8, "Member 'ABP_mod_stairs_01_C::Stairs_FirstMesh_des' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Stairs_LastMesh_des) == 0x000508, "Member 'ABP_mod_stairs_01_C::Stairs_LastMesh_des' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, SupportMesh_Mesh_des) == 0x000518, "Member 'ABP_mod_stairs_01_C::SupportMesh_Mesh_des' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, ProtectMesh_Mesh_des) == 0x000528, "Member 'ABP_mod_stairs_01_C::ProtectMesh_Mesh_des' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, ProtectMesh_Mesh_des_using) == 0x000538, "Member 'ABP_mod_stairs_01_C::ProtectMesh_Mesh_des_using' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, RelativeAddToNextMesh_Height_ProtectMesh) == 0x000548, "Member 'ABP_mod_stairs_01_C::RelativeAddToNextMesh_Height_ProtectMesh' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, OnfoldAkComponent) == 0x000550, "Member 'ABP_mod_stairs_01_C::OnfoldAkComponent' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Ladder_Material) == 0x000558, "Member 'ABP_mod_stairs_01_C::Ladder_Material' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, Out_Instance_Transform_Location) == 0x000560, "Member 'ABP_mod_stairs_01_C::Out_Instance_Transform_Location' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, NewVar) == 0x000578, "Member 'ABP_mod_stairs_01_C::NewVar' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, MaterialWood) == 0x000590, "Member 'ABP_mod_stairs_01_C::MaterialWood' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, MaterialMetal) == 0x000598, "Member 'ABP_mod_stairs_01_C::MaterialMetal' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, MaterialMetalCollector) == 0x0005A0, "Member 'ABP_mod_stairs_01_C::MaterialMetalCollector' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, YellowMaterial) == 0x0005A8, "Member 'ABP_mod_stairs_01_C::YellowMaterial' has a wrong offset!");
static_assert(offsetof(ABP_mod_stairs_01_C, DefaultMaterial) == 0x0005D8, "Member 'ABP_mod_stairs_01_C::DefaultMaterial' has a wrong offset!");

}

