#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Military_Radio

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Military_Radio.BP_Military_Radio_C.BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Military_Radio_C_BndEvt__BP_Interactable_Radio_120_ReceiverOff_K2Node_ComponentBoundEvent_5_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Military_Radio.BP_Military_Radio_C.BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature final
{
public:
	struct FUID                                   LastDamageDealerUID;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bProjectileFlownThroughObject;                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature) == 0x000004, "Wrong alignment on BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature");
static_assert(sizeof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature) == 0x000008, "Wrong size on BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature");
static_assert(offsetof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature, LastDamageDealerUID) == 0x000000, "Member 'BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature::LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature, bProjectileFlownThroughObject) == 0x000004, "Member 'BP_Military_Radio_C_BndEvt__BP_Military_Radio_DamageInteractable_K2Node_ComponentBoundEvent_1_OnDamageAccumulated__DelegateSignature::bProjectileFlownThroughObject' has a wrong offset!");

// Function BP_Military_Radio.BP_Military_Radio_C.BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Military_Radio_C_BndEvt__BP_Military_Radio_ReceiverOn_K2Node_ComponentBoundEvent_6_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Military_Radio.BP_Military_Radio_C.ExecuteUbergraph_BP_Military_Radio
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnbreakable_ReturnValue;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_1;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_7;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUID                                   K2Node_ComponentBoundEvent_LastDamageDealerUID;    // 0x00C8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bProjectileFlownThroughObject; // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_2;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_3;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio) == 0x000008, "Wrong alignment on BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio");
static_assert(sizeof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio) == 0x0000E0, "Wrong size on BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, EntryPoint) == 0x000000, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable) == 0x000004, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_3) == 0x000034, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_4) == 0x000044, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_5) == 0x000054, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_6) == 0x000064, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsUnbreakable_ReturnValue) == 0x000074, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsUnbreakable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue) == 0x000078, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_1) == 0x00007C, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsBroken_ReturnValue) == 0x000080, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, Temp_delegate_Variable_7) == 0x000084, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_2) == 0x000094, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsEnabled_ReturnValue) == 0x000098, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, K2Node_ComponentBoundEvent_DataObject_1) == 0x0000A0, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, K2Node_ComponentBoundEvent_DataObject) == 0x0000A8, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsBroken_ReturnValue_1) == 0x0000B0, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsBroken_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsSelfSufficient_ReturnValue) == 0x0000B1, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsSelfSufficient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_3) == 0x0000B4, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_4) == 0x0000B8, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_5) == 0x0000BC, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_6) == 0x0000C0, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_PostAkEvent_ReturnValue_7) == 0x0000C4, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_PostAkEvent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, K2Node_ComponentBoundEvent_LastDamageDealerUID) == 0x0000C8, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::K2Node_ComponentBoundEvent_LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, K2Node_ComponentBoundEvent_bProjectileFlownThroughObject) == 0x0000CC, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::K2Node_ComponentBoundEvent_bProjectileFlownThroughObject' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsBroken_ReturnValue_2) == 0x0000CD, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsBroken_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio, CallFunc_IsBroken_ReturnValue_3) == 0x0000D8, "Member 'BP_Military_Radio_C_ExecuteUbergraph_BP_Military_Radio::CallFunc_IsBroken_ReturnValue_3' has a wrong offset!");

// Function BP_Military_Radio.BP_Military_Radio_C.FInteractOff
// 0x0018 (0x0018 - 0x0000)
struct BP_Military_Radio_C_FInteractOff final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Military_Radio_C*               K2Node_DynamicCast_AsAnim_BP_Military_Radio;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_FInteractOff) == 0x000008, "Wrong alignment on BP_Military_Radio_C_FInteractOff");
static_assert(sizeof(BP_Military_Radio_C_FInteractOff) == 0x000018, "Wrong size on BP_Military_Radio_C_FInteractOff");
static_assert(offsetof(BP_Military_Radio_C_FInteractOff, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_Military_Radio_C_FInteractOff::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_FInteractOff, K2Node_DynamicCast_AsAnim_BP_Military_Radio) == 0x000008, "Member 'BP_Military_Radio_C_FInteractOff::K2Node_DynamicCast_AsAnim_BP_Military_Radio' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_FInteractOff, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Military_Radio_C_FInteractOff::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Military_Radio.BP_Military_Radio_C.FInteractOn
// 0x0018 (0x0018 - 0x0000)
struct BP_Military_Radio_C_FInteractOn final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Military_Radio_C*               K2Node_DynamicCast_AsAnim_BP_Military_Radio;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Military_Radio_C_FInteractOn) == 0x000008, "Wrong alignment on BP_Military_Radio_C_FInteractOn");
static_assert(sizeof(BP_Military_Radio_C_FInteractOn) == 0x000018, "Wrong size on BP_Military_Radio_C_FInteractOn");
static_assert(offsetof(BP_Military_Radio_C_FInteractOn, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'BP_Military_Radio_C_FInteractOn::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_FInteractOn, K2Node_DynamicCast_AsAnim_BP_Military_Radio) == 0x000008, "Member 'BP_Military_Radio_C_FInteractOn::K2Node_DynamicCast_AsAnim_BP_Military_Radio' has a wrong offset!");
static_assert(offsetof(BP_Military_Radio_C_FInteractOn, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Military_Radio_C_FInteractOn::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

