#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OvenFire_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OvenFire_1.BP_OvenFire_1_C
// 0x0068 (0x0300 - 0x0298)
class ABP_OvenFire_1_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UApplyEffectComponent*                  ApplyEffect;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      BurnTriggerCollider;                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticEnvironmentNiagaraComponent*     StaticEnvironmentNiagara;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FireBarrel_01;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   MainLight;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_LightInt_Coefficient_02_286F73B94C61DBBC5FE590AE906AD510; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_286F73B94C61DBBC5FE590AE906AD510; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_LightInt_Coefficient_01_7C8E00EC428A26B6FA3B1E88EB41A30D; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_7C8E00EC428A26B6FA3B1E88EB41A30D; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         MainLight_Int;                                     // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_BonFire_BurnTriggerCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_fireBarrel_BurnTriggerCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_OvenFire_1(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OvenFire_1_C">();
	}
	static class ABP_OvenFire_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OvenFire_1_C>();
	}
};
static_assert(alignof(ABP_OvenFire_1_C) == 0x000008, "Wrong alignment on ABP_OvenFire_1_C");
static_assert(sizeof(ABP_OvenFire_1_C) == 0x000300, "Wrong size on ABP_OvenFire_1_C");
static_assert(offsetof(ABP_OvenFire_1_C, UberGraphFrame) == 0x000298, "Member 'ABP_OvenFire_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, ApplyEffect) == 0x0002A0, "Member 'ABP_OvenFire_1_C::ApplyEffect' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, BurnTriggerCollider) == 0x0002A8, "Member 'ABP_OvenFire_1_C::BurnTriggerCollider' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Ak) == 0x0002B0, "Member 'ABP_OvenFire_1_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, StaticEnvironmentNiagara) == 0x0002B8, "Member 'ABP_OvenFire_1_C::StaticEnvironmentNiagara' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, SM_FireBarrel_01) == 0x0002C0, "Member 'ABP_OvenFire_1_C::SM_FireBarrel_01' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, MainLight) == 0x0002C8, "Member 'ABP_OvenFire_1_C::MainLight' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_OvenFire_1_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline_0_LightInt_Coefficient_02_286F73B94C61DBBC5FE590AE906AD510) == 0x0002D8, "Member 'ABP_OvenFire_1_C::Timeline_0_LightInt_Coefficient_02_286F73B94C61DBBC5FE590AE906AD510' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline_0__Direction_286F73B94C61DBBC5FE590AE906AD510) == 0x0002DC, "Member 'ABP_OvenFire_1_C::Timeline_0__Direction_286F73B94C61DBBC5FE590AE906AD510' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline_0) == 0x0002E0, "Member 'ABP_OvenFire_1_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline_LightInt_Coefficient_01_7C8E00EC428A26B6FA3B1E88EB41A30D) == 0x0002E8, "Member 'ABP_OvenFire_1_C::Timeline_LightInt_Coefficient_01_7C8E00EC428A26B6FA3B1E88EB41A30D' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline__Direction_7C8E00EC428A26B6FA3B1E88EB41A30D) == 0x0002EC, "Member 'ABP_OvenFire_1_C::Timeline__Direction_7C8E00EC428A26B6FA3B1E88EB41A30D' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, Timeline) == 0x0002F0, "Member 'ABP_OvenFire_1_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_OvenFire_1_C, MainLight_Int) == 0x0002F8, "Member 'ABP_OvenFire_1_C::MainLight_Int' has a wrong offset!");

}

