#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpeningContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "Enum_InteractObject_Axis_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OpeningContainer.BP_OpeningContainer_C
// 0x0098 (0x0380 - 0x02E8)
class ABP_OpeningContainer_C : public AInteractableObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USingleClickComponent*                  SingleClickClose;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitReceiverComponent*                  HitReceiver;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHittableComponent*                     Hittable;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Glass;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USingleClickComponent*                  SingleClickOpen;                                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenRotatCoef_Rotation_6863A0524BD515A65680CE95AB943B8B; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenRotatCoef__Direction_6863A0524BD515A65680CE95AB943B8B; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenRotatCoef;                                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	Enum_InteractObject_Axis                      RotatorAxis;                                       // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OpenAngle;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartAngle;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          OpenAKEvent;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CloseAKEvent;                                      // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DestructAkEvent;                                   // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_OpeningContainer_HitReceiver_K2Node_ComponentBoundEvent_0_MeleeHitSignature__DelegateSignature(const struct FCommonHitArgs& Common, const struct FMeleeHitArgs& HitArgs);
	void BndEvt__BP_OpeningContainer_HitReceiver_K2Node_ComponentBoundEvent_1_BulletProjectileHitSignature__DelegateSignature(const struct FCommonHitArgs& Common, const struct FBulletProjectileHitArgs& HitArgs);
	void BndEvt__BP_OpeningContainer_HitReceiver_K2Node_ComponentBoundEvent_3_ExplosionHitSignature__DelegateSignature(const struct FCommonHitArgs& Common, const struct FExplosionHitArgs& HitArgs);
	void BndEvt__BP_OpeningContainer_SingleClick_K2Node_ComponentBoundEvent_0_InteractSignature__DelegateSignature();
	void BndEvt__BP_OpeningContainer_SingleClickClose_K2Node_ComponentBoundEvent_4_InteractSignature__DelegateSignature();
	void ExecuteUbergraph_BP_OpeningContainer(int32 EntryPoint);
	void OpenRotatCoef__FinishedFunc();
	void OpenRotatCoef__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OpeningContainer_C">();
	}
	static class ABP_OpeningContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OpeningContainer_C>();
	}
};
static_assert(alignof(ABP_OpeningContainer_C) == 0x000008, "Wrong alignment on ABP_OpeningContainer_C");
static_assert(sizeof(ABP_OpeningContainer_C) == 0x000380, "Wrong size on ABP_OpeningContainer_C");
static_assert(offsetof(ABP_OpeningContainer_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_OpeningContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, SingleClickClose) == 0x0002F0, "Member 'ABP_OpeningContainer_C::SingleClickClose' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Ak) == 0x0002F8, "Member 'ABP_OpeningContainer_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Niagara) == 0x000300, "Member 'ABP_OpeningContainer_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, HitReceiver) == 0x000308, "Member 'ABP_OpeningContainer_C::HitReceiver' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Hittable) == 0x000310, "Member 'ABP_OpeningContainer_C::Hittable' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Glass) == 0x000318, "Member 'ABP_OpeningContainer_C::Glass' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Door) == 0x000320, "Member 'ABP_OpeningContainer_C::Door' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Scene) == 0x000328, "Member 'ABP_OpeningContainer_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, SingleClickOpen) == 0x000330, "Member 'ABP_OpeningContainer_C::SingleClickOpen' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, OpenRotatCoef_Rotation_6863A0524BD515A65680CE95AB943B8B) == 0x000338, "Member 'ABP_OpeningContainer_C::OpenRotatCoef_Rotation_6863A0524BD515A65680CE95AB943B8B' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, OpenRotatCoef__Direction_6863A0524BD515A65680CE95AB943B8B) == 0x00033C, "Member 'ABP_OpeningContainer_C::OpenRotatCoef__Direction_6863A0524BD515A65680CE95AB943B8B' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, OpenRotatCoef) == 0x000340, "Member 'ABP_OpeningContainer_C::OpenRotatCoef' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, RotatorAxis) == 0x000348, "Member 'ABP_OpeningContainer_C::RotatorAxis' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, OpenAngle) == 0x000350, "Member 'ABP_OpeningContainer_C::OpenAngle' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, StartAngle) == 0x000358, "Member 'ABP_OpeningContainer_C::StartAngle' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, Rate) == 0x000360, "Member 'ABP_OpeningContainer_C::Rate' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, OpenAKEvent) == 0x000368, "Member 'ABP_OpeningContainer_C::OpenAKEvent' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, CloseAKEvent) == 0x000370, "Member 'ABP_OpeningContainer_C::CloseAKEvent' has a wrong offset!");
static_assert(offsetof(ABP_OpeningContainer_C, DestructAkEvent) == 0x000378, "Member 'ABP_OpeningContainer_C::DestructAkEvent' has a wrong offset!");

}

