#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Speaker

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Speaker.BP_Speaker_C.BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature final
{
public:
	struct FUID                                   LastDamageDealerUID;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bProjectileFlownThroughObject;                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature) == 0x000004, "Wrong alignment on BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature");
static_assert(sizeof(BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature) == 0x000008, "Wrong size on BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature");
static_assert(offsetof(BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature, LastDamageDealerUID) == 0x000000, "Member 'BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature::LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature, bProjectileFlownThroughObject) == 0x000004, "Member 'BP_Speaker_C_BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature::bProjectileFlownThroughObject' has a wrong offset!");

// Function BP_Speaker.BP_Speaker_C.BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Speaker.BP_Speaker_C.BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Speaker_C_BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Speaker.BP_Speaker_C.BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(sizeof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature");
static_assert(offsetof(BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature, DataObject) == 0x000000, "Member 'BP_Speaker_C_BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature::DataObject' has a wrong offset!");

// Function BP_Speaker.BP_Speaker_C.ExecuteUbergraph_BP_Speaker
// 0x0098 (0x0098 - 0x0000)
struct BP_Speaker_C_ExecuteUbergraph_BP_Speaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUID                                   K2Node_ComponentBoundEvent_LastDamageDealerUID;    // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bProjectileFlownThroughObject; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnbreakable_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_2;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_DataObject_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_1;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEventAndWaitForEnd_ReturnValue;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_DataObject;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEventAndWaitForEnd_ReturnValue_1;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_2;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBroken_ReturnValue_3;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEventAndWaitForEnd_ReturnValue_2;   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfSufficient_ReturnValue;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker) == 0x000008, "Wrong alignment on BP_Speaker_C_ExecuteUbergraph_BP_Speaker");
static_assert(sizeof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker) == 0x000098, "Wrong size on BP_Speaker_C_ExecuteUbergraph_BP_Speaker");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, EntryPoint) == 0x000000, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, K2Node_ComponentBoundEvent_LastDamageDealerUID) == 0x000004, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::K2Node_ComponentBoundEvent_LastDamageDealerUID' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, K2Node_ComponentBoundEvent_bProjectileFlownThroughObject) == 0x000008, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::K2Node_ComponentBoundEvent_bProjectileFlownThroughObject' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, Temp_delegate_Variable) == 0x00000C, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, Temp_delegate_Variable_1) == 0x00001C, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsUnbreakable_ReturnValue) == 0x00002C, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsUnbreakable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, K2Node_ComponentBoundEvent_DataObject_2) == 0x000030, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::K2Node_ComponentBoundEvent_DataObject_2' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, K2Node_ComponentBoundEvent_DataObject_1) == 0x000038, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::K2Node_ComponentBoundEvent_DataObject_1' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsBroken_ReturnValue) == 0x000040, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsBroken_ReturnValue_1) == 0x000041, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsBroken_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEvent_ReturnValue) == 0x000044, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEventAndWaitForEnd_ReturnValue) == 0x000048, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEventAndWaitForEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, K2Node_ComponentBoundEvent_DataObject) == 0x000050, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::K2Node_ComponentBoundEvent_DataObject' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEventAndWaitForEnd_ReturnValue_1) == 0x000058, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEventAndWaitForEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsBroken_ReturnValue_2) == 0x00005C, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsBroken_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEvent_ReturnValue_1) == 0x000060, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsBroken_ReturnValue_3) == 0x000064, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsBroken_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEventAndWaitForEnd_ReturnValue_2) == 0x000068, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEventAndWaitForEnd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsEnabled_ReturnValue) == 0x00006C, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_IsSelfSufficient_ReturnValue) == 0x00006D, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_IsSelfSufficient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, Temp_delegate_Variable_2) == 0x000070, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEvent_ReturnValue_2) == 0x000080, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, Temp_delegate_Variable_3) == 0x000084, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Speaker_C_ExecuteUbergraph_BP_Speaker, CallFunc_PostAkEvent_ReturnValue_3) == 0x000094, "Member 'BP_Speaker_C_ExecuteUbergraph_BP_Speaker::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");

}

