#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Speaker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Speaker.BP_Speaker_C
// 0x0080 (0x0368 - 0x02E8)
class ABP_Speaker_C final : public AInteractableObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USignalReceiverComponent*               ReceiverTurnOffMusic;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           InteractableRadioAk;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Destruct_Radio;                                 // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ele_speaker_01_b;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ele_speaker_01_a;                               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalSenderComponent*                 SenderPlayDialog;                                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverPlayDialog;                                // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USignalReceiverComponent*               ReceiverPlayMusic;                                 // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHittableComponent*                     Hittable;                                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamageInteractableComponent*           DamageInteractable;                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SFX_Destruct;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PlayList_TurnOn;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PlayList_TurnOff;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SFX_TurnOn;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SFX_TurnOff;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Speaker_DamageInteractable_K2Node_ComponentBoundEvent_4_OnDamageAccumulated__DelegateSignature(const struct FUID& LastDamageDealerUID, bool bProjectileFlownThroughObject);
	void BndEvt__BP_Speaker_ReceiverPlayDialog_K2Node_ComponentBoundEvent_2_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Speaker_ReceiverPlayMusic_K2Node_ComponentBoundEvent_1_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void BndEvt__BP_Speaker_ReceiverTurnOffMusic_K2Node_ComponentBoundEvent_3_SignalReceiverComponentReceiveSignature__DelegateSignature(class UObject* DataObject);
	void ExecuteUbergraph_BP_Speaker(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Speaker_C">();
	}
	static class ABP_Speaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Speaker_C>();
	}
};
static_assert(alignof(ABP_Speaker_C) == 0x000008, "Wrong alignment on ABP_Speaker_C");
static_assert(sizeof(ABP_Speaker_C) == 0x000368, "Wrong size on ABP_Speaker_C");
static_assert(offsetof(ABP_Speaker_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_Speaker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, ReceiverTurnOffMusic) == 0x0002F0, "Member 'ABP_Speaker_C::ReceiverTurnOffMusic' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, InteractableRadioAk) == 0x0002F8, "Member 'ABP_Speaker_C::InteractableRadioAk' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, NS_Destruct_Radio) == 0x000300, "Member 'ABP_Speaker_C::NS_Destruct_Radio' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SM_ele_speaker_01_b) == 0x000308, "Member 'ABP_Speaker_C::SM_ele_speaker_01_b' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SM_ele_speaker_01_a) == 0x000310, "Member 'ABP_Speaker_C::SM_ele_speaker_01_a' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SenderPlayDialog) == 0x000318, "Member 'ABP_Speaker_C::SenderPlayDialog' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, ReceiverPlayDialog) == 0x000320, "Member 'ABP_Speaker_C::ReceiverPlayDialog' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, ReceiverPlayMusic) == 0x000328, "Member 'ABP_Speaker_C::ReceiverPlayMusic' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, Hittable) == 0x000330, "Member 'ABP_Speaker_C::Hittable' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, DamageInteractable) == 0x000338, "Member 'ABP_Speaker_C::DamageInteractable' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SFX_Destruct) == 0x000340, "Member 'ABP_Speaker_C::SFX_Destruct' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, PlayList_TurnOn) == 0x000348, "Member 'ABP_Speaker_C::PlayList_TurnOn' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, PlayList_TurnOff) == 0x000350, "Member 'ABP_Speaker_C::PlayList_TurnOff' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SFX_TurnOn) == 0x000358, "Member 'ABP_Speaker_C::SFX_TurnOn' has a wrong offset!");
static_assert(offsetof(ABP_Speaker_C, SFX_TurnOff) == 0x000360, "Member 'ABP_Speaker_C::SFX_TurnOff' has a wrong offset!");

}

