#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkeletalItemContainer

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkeletalItemContainer.BP_SkeletalItemContainer_C
// 0x0020 (0x0400 - 0x03E0)
class ABP_SkeletalItemContainer_C : public AInteractableItemContainer
{
public:
	class UExplosionComponent*                    Explosion;                                         // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UItemContainerHoldComponent*            ItemContainerHold;                                 // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableGravity;                                    // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkeletalItemContainer_C">();
	}
	static class ABP_SkeletalItemContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkeletalItemContainer_C>();
	}
};
static_assert(alignof(ABP_SkeletalItemContainer_C) == 0x000008, "Wrong alignment on ABP_SkeletalItemContainer_C");
static_assert(sizeof(ABP_SkeletalItemContainer_C) == 0x000400, "Wrong size on ABP_SkeletalItemContainer_C");
static_assert(offsetof(ABP_SkeletalItemContainer_C, Explosion) == 0x0003E0, "Member 'ABP_SkeletalItemContainer_C::Explosion' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalItemContainer_C, ItemContainerHold) == 0x0003E8, "Member 'ABP_SkeletalItemContainer_C::ItemContainerHold' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalItemContainer_C, MeshComponent) == 0x0003F0, "Member 'ABP_SkeletalItemContainer_C::MeshComponent' has a wrong offset!");
static_assert(offsetof(ABP_SkeletalItemContainer_C, bEnableGravity) == 0x0003F8, "Member 'ABP_SkeletalItemContainer_C::bEnableGravity' has a wrong offset!");

}

