#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Water_base

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Water_base.BP_Water_base_C
// 0x0018 (0x02B0 - 0x0298)
class ABP_Water_base_C : public AActor
{
public:
	class UStaticMeshComponent*                   NavCollision;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWaterComponent*                        Water;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Water_base_C">();
	}
	static class ABP_Water_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Water_base_C>();
	}
};
static_assert(alignof(ABP_Water_base_C) == 0x000008, "Wrong alignment on ABP_Water_base_C");
static_assert(sizeof(ABP_Water_base_C) == 0x0002B0, "Wrong size on ABP_Water_base_C");
static_assert(offsetof(ABP_Water_base_C, NavCollision) == 0x000298, "Member 'ABP_Water_base_C::NavCollision' has a wrong offset!");
static_assert(offsetof(ABP_Water_base_C, StaticMesh) == 0x0002A0, "Member 'ABP_Water_base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Water_base_C, Water) == 0x0002A8, "Member 'ABP_Water_base_C::Water' has a wrong offset!");

}

