#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldMapScene

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WorldMapScene.BP_WorldMapScene_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_WorldMapScene_C final : public AWorldMapScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Map;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void SetScale(float InScale);
	void SetOffset(const struct FVector2D& InOffset);
	void SetNotSelectedAreaBrightness(float InBrightness);
	void SetMouseUV(const struct FVector& InUV);
	void SetCaptureEveryFrame(bool bIsEnabled);
	void ExecuteUbergraph_BP_WorldMapScene(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WorldMapScene_C">();
	}
	static class ABP_WorldMapScene_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WorldMapScene_C>();
	}
};
static_assert(alignof(ABP_WorldMapScene_C) == 0x000008, "Wrong alignment on ABP_WorldMapScene_C");
static_assert(sizeof(ABP_WorldMapScene_C) == 0x0002B8, "Wrong size on ABP_WorldMapScene_C");
static_assert(offsetof(ABP_WorldMapScene_C, UberGraphFrame) == 0x000298, "Member 'ABP_WorldMapScene_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WorldMapScene_C, Map) == 0x0002A0, "Member 'ABP_WorldMapScene_C::Map' has a wrong offset!");
static_assert(offsetof(ABP_WorldMapScene_C, SceneCaptureComponent2D) == 0x0002A8, "Member 'ABP_WorldMapScene_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_WorldMapScene_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_WorldMapScene_C::DefaultSceneRoot' has a wrong offset!");

}

