#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicKeyFrameTracks

#include "Basic.hpp"

#include "CinematicKeyFrameTracks_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class CinematicKeyFrameTracks.MovieSceneKeyFrameEventSection
// 0x0028 (0x0118 - 0x00F0)
class UMovieSceneKeyFrameEventSection final : public UMovieSceneSection
{
public:
	struct FCinematicKeyFrameData                 Data;                                              // 0x00F0(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneKeyFrameEventSection">();
	}
	static class UMovieSceneKeyFrameEventSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneKeyFrameEventSection>();
	}
};
static_assert(alignof(UMovieSceneKeyFrameEventSection) == 0x000008, "Wrong alignment on UMovieSceneKeyFrameEventSection");
static_assert(sizeof(UMovieSceneKeyFrameEventSection) == 0x000118, "Wrong size on UMovieSceneKeyFrameEventSection");
static_assert(offsetof(UMovieSceneKeyFrameEventSection, Data) == 0x0000F0, "Member 'UMovieSceneKeyFrameEventSection::Data' has a wrong offset!");

// Class CinematicKeyFrameTracks.MovieSceneKeyFrameEventTrack
// 0x0018 (0x00B0 - 0x0098)
class UMovieSceneKeyFrameEventTrack : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneKeyFrameEventTrack">();
	}
	static class UMovieSceneKeyFrameEventTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneKeyFrameEventTrack>();
	}
};
static_assert(alignof(UMovieSceneKeyFrameEventTrack) == 0x000008, "Wrong alignment on UMovieSceneKeyFrameEventTrack");
static_assert(sizeof(UMovieSceneKeyFrameEventTrack) == 0x0000B0, "Wrong size on UMovieSceneKeyFrameEventTrack");
static_assert(offsetof(UMovieSceneKeyFrameEventTrack, Sections) == 0x0000A0, "Member 'UMovieSceneKeyFrameEventTrack::Sections' has a wrong offset!");

}

