#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicHapticFeedbackTracks

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// ScriptStruct CinematicHapticFeedbackTracks.CinematicHapticFeedbackData
// 0x0008 (0x0008 - 0x0000)
struct FCinematicHapticFeedbackData final
{
public:
	struct FGameplayTag                           ForceFeedbackTag;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCinematicHapticFeedbackData) == 0x000004, "Wrong alignment on FCinematicHapticFeedbackData");
static_assert(sizeof(FCinematicHapticFeedbackData) == 0x000008, "Wrong size on FCinematicHapticFeedbackData");
static_assert(offsetof(FCinematicHapticFeedbackData, ForceFeedbackTag) == 0x000000, "Member 'FCinematicHapticFeedbackData::ForceFeedbackTag' has a wrong offset!");

// ScriptStruct CinematicHapticFeedbackTracks.MovieSceneHapticFeedbackEventTemplate
// 0x0008 (0x0028 - 0x0020)
struct FMovieSceneHapticFeedbackEventTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FCinematicHapticFeedbackData           Data;                                              // 0x0020(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneHapticFeedbackEventTemplate) == 0x000008, "Wrong alignment on FMovieSceneHapticFeedbackEventTemplate");
static_assert(sizeof(FMovieSceneHapticFeedbackEventTemplate) == 0x000028, "Wrong size on FMovieSceneHapticFeedbackEventTemplate");
static_assert(offsetof(FMovieSceneHapticFeedbackEventTemplate, Data) == 0x000020, "Member 'FMovieSceneHapticFeedbackEventTemplate::Data' has a wrong offset!");

}

