#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicSubtitleTracks

#include "Basic.hpp"

#include "CinematicSubtitleTracks_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CinematicKeyFrameTracks_classes.hpp"


namespace SDK
{

// Class CinematicSubtitleTracks.MovieSceneSubtitleEventSection
// 0x0020 (0x0110 - 0x00F0)
class UMovieSceneSubtitleEventSection final : public UMovieSceneSection
{
public:
	struct FCinematicSubtitleData                 Data;                                              // 0x00F0(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSubtitleEventSection">();
	}
	static class UMovieSceneSubtitleEventSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubtitleEventSection>();
	}
};
static_assert(alignof(UMovieSceneSubtitleEventSection) == 0x000008, "Wrong alignment on UMovieSceneSubtitleEventSection");
static_assert(sizeof(UMovieSceneSubtitleEventSection) == 0x000110, "Wrong size on UMovieSceneSubtitleEventSection");
static_assert(offsetof(UMovieSceneSubtitleEventSection, Data) == 0x0000F0, "Member 'UMovieSceneSubtitleEventSection::Data' has a wrong offset!");

// Class CinematicSubtitleTracks.MovieSceneSubtitleEventTrack
// 0x0000 (0x00B0 - 0x00B0)
class UMovieSceneSubtitleEventTrack final : public UMovieSceneKeyFrameEventTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSubtitleEventTrack">();
	}
	static class UMovieSceneSubtitleEventTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubtitleEventTrack>();
	}
};
static_assert(alignof(UMovieSceneSubtitleEventTrack) == 0x000008, "Wrong alignment on UMovieSceneSubtitleEventTrack");
static_assert(sizeof(UMovieSceneSubtitleEventTrack) == 0x0000B0, "Wrong size on UMovieSceneSubtitleEventTrack");

}

