#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicSubtitleTracks

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK
{

// ScriptStruct CinematicSubtitleTracks.CinematicSubtitleData
// 0x0020 (0x0020 - 0x0000)
struct FCinematicSubtitleData final
{
public:
	class FString                                 PhraseSID;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpeakerSID;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCinematicSubtitleData) == 0x000008, "Wrong alignment on FCinematicSubtitleData");
static_assert(sizeof(FCinematicSubtitleData) == 0x000020, "Wrong size on FCinematicSubtitleData");
static_assert(offsetof(FCinematicSubtitleData, PhraseSID) == 0x000000, "Member 'FCinematicSubtitleData::PhraseSID' has a wrong offset!");
static_assert(offsetof(FCinematicSubtitleData, SpeakerSID) == 0x000010, "Member 'FCinematicSubtitleData::SpeakerSID' has a wrong offset!");

// ScriptStruct CinematicSubtitleTracks.MovieSceneSubtitleEventTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneSubtitleEventTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FCinematicSubtitleData                 Data;                                              // 0x0020(0x0020)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneSubtitleEventTemplate) == 0x000008, "Wrong alignment on FMovieSceneSubtitleEventTemplate");
static_assert(sizeof(FMovieSceneSubtitleEventTemplate) == 0x000040, "Wrong size on FMovieSceneSubtitleEventTemplate");
static_assert(offsetof(FMovieSceneSubtitleEventTemplate, Data) == 0x000020, "Member 'FMovieSceneSubtitleEventTemplate::Data' has a wrong offset!");

}

