#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CtrlRig_Exoskeleton

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CtrlRig_Exoskeleton.CtrlRig_Exoskeleton_C
// 0x0000 (0x0560 - 0x0560)
class UCtrlRig_Exoskeleton_C final : public UControlRig
{
public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CtrlRig_Exoskeleton_C">();
	}
	static class UCtrlRig_Exoskeleton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCtrlRig_Exoskeleton_C>();
	}
};
static_assert(alignof(UCtrlRig_Exoskeleton_C) == 0x000008, "Wrong alignment on UCtrlRig_Exoskeleton_C");
static_assert(sizeof(UCtrlRig_Exoskeleton_C) == 0x000560, "Wrong size on UCtrlRig_Exoskeleton_C");

// RigVMMemoryStorageGeneratorClass CtrlRig_Exoskeleton.RigVMMemory_Literal
// 0x0368 (0x0390 - 0x0028)
class URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___AimItem_Item__Const;                  // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__Const;               // 0x0038(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_Item__Const;     // 0x0080(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___RigUnit_GetTransform_Space__Const;    // 0x008C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___RigUnit_GetTransform_bInitial__Const : 1; // 0x008D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Secondary__Const;             // 0x0090(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___AimItem_Weight__Const;                // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_DebugSettings__Const;         // 0x00E0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_Item__Const;                // 0x0150(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_Item__Const;   // 0x015C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Secondary__Const;           // 0x0168(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_Item__Const;              // 0x01B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0x01BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Secondary__Const;         // 0x01C8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_2_Item__Const;                // 0x0210(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_Item__Const;   // 0x021C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_Secondary__Const;           // 0x0228(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_2_Item__Const;              // 0x0270(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_4_Item__Const;   // 0x027C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_1_Item__Const;            // 0x0288(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_5_Item__Const;   // 0x0294(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_Item__Const;              // 0x02A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_6_Item__Const;   // 0x02AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_Item__Const;            // 0x02B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_7_Item__Const;   // 0x02C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_Item__Const;          // 0x02D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_8_Item__Const;   // 0x02DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_1_Item__Const;        // 0x02E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_9_Item__Const;   // 0x02F4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_1_1_Item__Const;      // 0x0300(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_10_Item__Const;  // 0x030C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_2_Item__Const;            // 0x0318(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_11_Item__Const;  // 0x0324(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_2_Item__Const;          // 0x0330(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_12_Item__Const;  // 0x033C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_2_Item__Const;        // 0x0348(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_13_Item__Const;  // 0x0354(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_1_2_Item__Const;      // 0x0360(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_14_Item__Const;  // 0x036C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_1_1_1_1_1_1_Item__Const;    // 0x0378(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_15_Item__Const;  // 0x0384(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemory_Literal">();
	}
	static class URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMMemory_Literal>();
	}
};
static_assert(alignof(URigVMMemory_Literal) == 0x000010, "Wrong alignment on URigVMMemory_Literal");
static_assert(sizeof(URigVMMemory_Literal) == 0x000390, "Wrong size on URigVMMemory_Literal");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_Item__Const) == 0x000028, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_Primary__Const) == 0x000038, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_Primary__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_Item__Const) == 0x000080, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_Space__Const) == 0x00008C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_Secondary__Const) == 0x000090, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_Secondary__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_Weight__Const) == 0x0000D8, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_Weight__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_DebugSettings__Const) == 0x0000E0, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_Item__Const) == 0x000150, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_1_Item__Const) == 0x00015C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_Secondary__Const) == 0x000168, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_Secondary__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_1_Item__Const) == 0x0001B0, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_2_Item__Const) == 0x0001BC, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_1_Secondary__Const) == 0x0001C8, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_1_Secondary__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_Item__Const) == 0x000210, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_3_Item__Const) == 0x00021C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_3_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_Secondary__Const) == 0x000228, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_Secondary__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_2_Item__Const) == 0x000270, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_4_Item__Const) == 0x00027C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_4_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_1_1_1_Item__Const) == 0x000288, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_5_Item__Const) == 0x000294, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_5_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_Item__Const) == 0x0002A0, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_6_Item__Const) == 0x0002AC, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_6_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_Item__Const) == 0x0002B8, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_7_Item__Const) == 0x0002C4, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_7_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_Item__Const) == 0x0002D0, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_8_Item__Const) == 0x0002DC, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_8_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_1_Item__Const) == 0x0002E8, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_9_Item__Const) == 0x0002F4, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_9_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_1_1_Item__Const) == 0x000300, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_10_Item__Const) == 0x00030C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_10_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_2_Item__Const) == 0x000318, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_11_Item__Const) == 0x000324, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_11_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_2_Item__Const) == 0x000330, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_12_Item__Const) == 0x00033C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_12_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_2_Item__Const) == 0x000348, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_13_Item__Const) == 0x000354, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_13_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_1_2_Item__Const) == 0x000360, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_14_Item__Const) == 0x00036C, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_14_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___AimItem_2_1_1_1_1_1_1_Item__Const) == 0x000378, "Member 'URigVMMemory_Literal::RigVMModel___AimItem_2_1_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_15_Item__Const) == 0x000384, "Member 'URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_15_Item__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass CtrlRig_Exoskeleton.RigVMMemory_Work
// 0x0F38 (0x0F60 - 0x0028)
class URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0028(0x0038)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_Transform;       // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__IO;                  // 0x00D0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_CachedItem;                   // 0x0118(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_PrimaryCachedSpace;           // 0x0128(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_SecondaryCachedSpace;         // 0x0138(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x0150(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x01B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Primary__IO;                // 0x01C0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_CachedItem;                 // 0x0208(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_PrimaryCachedSpace;         // 0x0218(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_SecondaryCachedSpace;       // 0x0228(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_2_Transform;     // 0x0240(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_2_CachedIndex;   // 0x02A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Primary__IO;              // 0x02B0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_CachedItem;               // 0x02F8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_PrimaryCachedSpace;       // 0x0308(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_SecondaryCachedSpace;     // 0x0318(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_Transform;     // 0x0330(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_CachedIndex;   // 0x0390(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_Primary__IO;                // 0x03A0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_CachedItem;                 // 0x03E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_PrimaryCachedSpace;         // 0x03F8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_SecondaryCachedSpace;       // 0x0408(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_Transform;     // 0x0420(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_CachedIndex;   // 0x0480(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_2_Primary__IO;              // 0x0490(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_2_CachedItem;               // 0x04D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_2_PrimaryCachedSpace;       // 0x04E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_2_SecondaryCachedSpace;     // 0x04F8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_5_Transform;     // 0x0510(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_5_CachedIndex;   // 0x0570(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_1_Primary__IO;            // 0x0580(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_1_CachedItem;             // 0x05C8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_1_PrimaryCachedSpace;     // 0x05D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_1_1_SecondaryCachedSpace;   // 0x05E8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_6_Transform;     // 0x0600(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_6_CachedIndex;   // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_Primary__IO;              // 0x0670(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_CachedItem;               // 0x06B8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_PrimaryCachedSpace;       // 0x06C8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_SecondaryCachedSpace;     // 0x06D8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_6E8[0x8];                                      // 0x06E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_Transform;     // 0x06F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_CachedIndex;   // 0x0750(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_Primary__IO;            // 0x0760(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_CachedItem;             // 0x07A8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_PrimaryCachedSpace;     // 0x07B8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_SecondaryCachedSpace;   // 0x07C8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_8_Transform;     // 0x07E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_8_CachedIndex;   // 0x0840(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_Primary__IO;          // 0x0850(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_CachedItem;           // 0x0898(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_PrimaryCachedSpace;   // 0x08A8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_SecondaryCachedSpace; // 0x08B8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_Transform;     // 0x08D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_CachedIndex;   // 0x0930(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_1_Primary__IO;        // 0x0940(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_CachedItem;         // 0x0988(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_PrimaryCachedSpace; // 0x0998(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_SecondaryCachedSpace; // 0x09A8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_9B8[0x8];                                      // 0x09B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_10_Transform;    // 0x09C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_10_CachedIndex;  // 0x0A20(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_1_1_Primary__IO;      // 0x0A30(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_CachedItem;       // 0x0A78(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_PrimaryCachedSpace; // 0x0A88(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_SecondaryCachedSpace; // 0x0A98(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_AA8[0x8];                                      // 0x0AA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_11_Transform;    // 0x0AB0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_11_CachedIndex;  // 0x0B10(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_2_Primary__IO;            // 0x0B20(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_2_CachedItem;             // 0x0B68(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_2_PrimaryCachedSpace;     // 0x0B78(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_2_SecondaryCachedSpace;   // 0x0B88(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_B98[0x8];                                      // 0x0B98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_12_Transform;    // 0x0BA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_12_CachedIndex;  // 0x0C00(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_2_Primary__IO;          // 0x0C10(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_2_CachedItem;           // 0x0C58(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_2_PrimaryCachedSpace;   // 0x0C68(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_2_SecondaryCachedSpace; // 0x0C78(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_C88[0x8];                                      // 0x0C88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_13_Transform;    // 0x0C90(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_13_CachedIndex;  // 0x0CF0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_2_Primary__IO;        // 0x0D00(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_2_CachedItem;         // 0x0D48(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_2_PrimaryCachedSpace; // 0x0D58(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_2_SecondaryCachedSpace; // 0x0D68(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_D78[0x8];                                      // 0x0D78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_14_Transform;    // 0x0D80(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_14_CachedIndex;  // 0x0DE0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_1_2_Primary__IO;      // 0x0DF0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_2_CachedItem;       // 0x0E38(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_2_PrimaryCachedSpace; // 0x0E48(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_2_SecondaryCachedSpace; // 0x0E58(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_E68[0x8];                                      // 0x0E68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_15_Transform;    // 0x0E70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_15_CachedIndex;  // 0x0ED0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_2_1_1_1_1_1_1_Primary__IO;    // 0x0EE0(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_1_CachedItem;     // 0x0F28(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_1_PrimaryCachedSpace; // 0x0F38(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_2_1_1_1_1_1_1_SecondaryCachedSpace; // 0x0F48(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemory_Work">();
	}
	static class URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigVMMemory_Work>();
	}
};
static_assert(alignof(URigVMMemory_Work) == 0x000010, "Wrong alignment on URigVMMemory_Work");
static_assert(sizeof(URigVMMemory_Work) == 0x000F60, "Wrong size on URigVMMemory_Work");
static_assert(offsetof(URigVMMemory_Work, ExecuteContext_) == 0x000028, "Member 'URigVMMemory_Work::ExecuteContext_' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Work, RigVMModel___RigUnit_GetTransform_Transform) == 0x000060, "Member 'URigVMMemory_Work::RigVMModel___RigUnit_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(URigVMMemory_Work, RigVMModel___RigUnit_GetTransform_CachedIndex) == 0x0000C0, "Member 'URigVMMemory_Work::RigVMModel___RigUnit_GetTransform_CachedIndex' has a wrong offset!");
