#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FenceGenerator

#include "Basic.hpp"

#include "MeshOverrideStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FenceGenerator.FenceGenerator_C.AlignToSurface
// 0x0238 (0x0238 - 0x0000)
struct FenceGenerator_C_AlignToSurface final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0050(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FenceGenerator_C_AlignToSurface) == 0x000008, "Wrong alignment on FenceGenerator_C_AlignToSurface");
static_assert(sizeof(FenceGenerator_C_AlignToSurface) == 0x000238, "Wrong size on FenceGenerator_C_AlignToSurface");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, Temp_int_Variable) == 0x000000, "Member 'FenceGenerator_C_AlignToSurface::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000008, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000010, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakVector_X) == 0x000030, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakVector_Y) == 0x000038, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakVector_Z) == 0x000040, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000048, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, Temp_object_Variable) == 0x000050, "Member 'FenceGenerator_C_AlignToSurface::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_LineTraceSingle_OutHit) == 0x000078, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_LineTraceSingle_ReturnValue) == 0x000160, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_bBlockingHit) == 0x000161, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_bInitialOverlap) == 0x000162, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_Time) == 0x000164, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_Distance) == 0x000168, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_Location) == 0x000170, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_ImpactPoint) == 0x000188, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_Normal) == 0x0001A0, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_PhysMat) == 0x0001D0, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_HitActor) == 0x0001D8, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_HitComponent) == 0x0001E0, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_HitBoneName) == 0x0001E8, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_BoneName) == 0x0001F0, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_TraceStart) == 0x000208, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_AlignToSurface, CallFunc_BreakHitResult_TraceEnd) == 0x000220, "Member 'FenceGenerator_C_AlignToSurface::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function FenceGenerator.FenceGenerator_C.BuildFence
// 0x07F0 (0x07F0 - 0x0000)
struct FenceGenerator_C_BuildFence final
{
public:
	class UStaticMesh*                            FenceMesh_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            PicketMesh_0;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FenceMeshEnd;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FenceMeshStart;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalEndScale;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalStartScale;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LocalFenceMeshStart;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalLoopIndex;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            LocalFenceMeshEnd;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LocalPicketMesh;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LocalTangentScale;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalNextSplinePointIndex;                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalCurrentSplinePointIndex;                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalEndRoll;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalStartRoll;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            LocalFenceMesh;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   LocalCurrentSplineMesh;                            // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalEndTangent;                                   // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalStartTangent;                                 // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalEndLocation;                                  // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalStartLocation;                                // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_2;                              // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMesh;                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMeshEnd;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMeshStart;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_PicketMesh;                 // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_3;                              // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMesh_1;                // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMeshEnd_1;             // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_FenceMeshStart_1;           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_GetMeshesData_PicketMesh_1;               // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x0350(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0368(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue_1;   // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtSplinePoint_ReturnValue;    // 0x0420(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtSplinePoint_ReturnValue;      // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0510(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_3;               // 0x0570(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0580(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_1; // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue_2; // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue; // 0x06D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0718(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0728(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue; // 0x0740(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0758(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue_1;    // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0778(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_1;                           // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x0795(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796[0x2];                                      // 0x0796(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_FloatToVector_InFloat_ImplicitCast;  // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEndRoll_EndRoll_ImplicitCast;          // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartRoll_StartRoll_ImplicitCast;      // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast; // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTangentAtDistanceAlongSpline_Distance_ImplicitCast; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast; // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FenceGenerator_C_BuildFence) == 0x000010, "Wrong alignment on FenceGenerator_C_BuildFence");
static_assert(sizeof(FenceGenerator_C_BuildFence) == 0x0007F0, "Wrong size on FenceGenerator_C_BuildFence");
static_assert(offsetof(FenceGenerator_C_BuildFence, FenceMesh_0) == 0x000000, "Member 'FenceGenerator_C_BuildFence::FenceMesh_0' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, PicketMesh_0) == 0x000008, "Member 'FenceGenerator_C_BuildFence::PicketMesh_0' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, FenceMeshEnd) == 0x000010, "Member 'FenceGenerator_C_BuildFence::FenceMeshEnd' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, FenceMeshStart) == 0x000018, "Member 'FenceGenerator_C_BuildFence::FenceMeshStart' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalEndScale) == 0x000020, "Member 'FenceGenerator_C_BuildFence::LocalEndScale' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalStartScale) == 0x000030, "Member 'FenceGenerator_C_BuildFence::LocalStartScale' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalFenceMeshStart) == 0x000040, "Member 'FenceGenerator_C_BuildFence::LocalFenceMeshStart' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalLoopIndex) == 0x000048, "Member 'FenceGenerator_C_BuildFence::LocalLoopIndex' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalFenceMeshEnd) == 0x000050, "Member 'FenceGenerator_C_BuildFence::LocalFenceMeshEnd' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalPicketMesh) == 0x000058, "Member 'FenceGenerator_C_BuildFence::LocalPicketMesh' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalTangentScale) == 0x000060, "Member 'FenceGenerator_C_BuildFence::LocalTangentScale' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalNextSplinePointIndex) == 0x000068, "Member 'FenceGenerator_C_BuildFence::LocalNextSplinePointIndex' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalCurrentSplinePointIndex) == 0x00006C, "Member 'FenceGenerator_C_BuildFence::LocalCurrentSplinePointIndex' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalEndRoll) == 0x000070, "Member 'FenceGenerator_C_BuildFence::LocalEndRoll' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalStartRoll) == 0x000078, "Member 'FenceGenerator_C_BuildFence::LocalStartRoll' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalFenceMesh) == 0x000080, "Member 'FenceGenerator_C_BuildFence::LocalFenceMesh' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalCurrentSplineMesh) == 0x000088, "Member 'FenceGenerator_C_BuildFence::LocalCurrentSplineMesh' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalEndTangent) == 0x000090, "Member 'FenceGenerator_C_BuildFence::LocalEndTangent' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalStartTangent) == 0x0000A8, "Member 'FenceGenerator_C_BuildFence::LocalStartTangent' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalEndLocation) == 0x0000C0, "Member 'FenceGenerator_C_BuildFence::LocalEndLocation' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, LocalStartLocation) == 0x0000D8, "Member 'FenceGenerator_C_BuildFence::LocalStartLocation' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_byte_Variable) == 0x0000F0, "Member 'FenceGenerator_C_BuildFence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_bool_Variable) == 0x0000F1, "Member 'FenceGenerator_C_BuildFence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_byte_Variable_1) == 0x0000F2, "Member 'FenceGenerator_C_BuildFence::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_byte_Variable_2) == 0x0000F3, "Member 'FenceGenerator_C_BuildFence::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_int_Variable) == 0x0000F4, "Member 'FenceGenerator_C_BuildFence::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'FenceGenerator_C_BuildFence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMesh) == 0x000100, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMesh' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMeshEnd) == 0x000108, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMeshEnd' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMeshStart) == 0x000110, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMeshStart' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_PicketMesh) == 0x000118, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_PicketMesh' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'FenceGenerator_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000124, "Member 'FenceGenerator_C_BuildFence::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_2) == 0x000128, "Member 'FenceGenerator_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_byte_Variable_3) == 0x00012C, "Member 'FenceGenerator_C_BuildFence::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_RandomFloatInRange_ReturnValue) == 0x000130, "Member 'FenceGenerator_C_BuildFence::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_SetStaticMesh_ReturnValue) == 0x000138, "Member 'FenceGenerator_C_BuildFence::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_VLerp_ReturnValue) == 0x000140, "Member 'FenceGenerator_C_BuildFence::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000158, "Member 'FenceGenerator_C_BuildFence::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_SelectInt_ReturnValue) == 0x000160, "Member 'FenceGenerator_C_BuildFence::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeRotator_ReturnValue) == 0x000168, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000180, "Member 'FenceGenerator_C_BuildFence::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_bool_Variable_1) == 0x000181, "Member 'FenceGenerator_C_BuildFence::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000182, "Member 'FenceGenerator_C_BuildFence::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, K2Node_Select_Default) == 0x000183, "Member 'FenceGenerator_C_BuildFence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Greater_IntInt_ReturnValue) == 0x000184, "Member 'FenceGenerator_C_BuildFence::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeVector_ReturnValue) == 0x000188, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeVector_ReturnValue_1) == 0x0001A0, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeTransform_ReturnValue) == 0x0001C0, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeTransform_ReturnValue_1) == 0x000220, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_AddComponent_ReturnValue) == 0x000280, "Member 'FenceGenerator_C_BuildFence::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_AddComponent_ReturnValue_1) == 0x000288, "Member 'FenceGenerator_C_BuildFence::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeVector_ReturnValue_2) == 0x000290, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, Temp_int_Variable_1) == 0x0002A8, "Member 'FenceGenerator_C_BuildFence::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeTransform_ReturnValue_2) == 0x0002B0, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_3) == 0x000310, "Member 'FenceGenerator_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_AddComponent_ReturnValue_2) == 0x000318, "Member 'FenceGenerator_C_BuildFence::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMesh_1) == 0x000320, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMesh_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMeshEnd_1) == 0x000328, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMeshEnd_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_FenceMeshStart_1) == 0x000330, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_FenceMeshStart_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetMeshesData_PicketMesh_1) == 0x000338, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetMeshesData_PicketMesh_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Add_IntInt_ReturnValue_4) == 0x000340, "Member 'FenceGenerator_C_BuildFence::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000344, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Subtract_IntInt_ReturnValue) == 0x000348, "Member 'FenceGenerator_C_BuildFence::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00034C, "Member 'FenceGenerator_C_BuildFence::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00034D, "Member 'FenceGenerator_C_BuildFence::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x000350, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000368, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakVector_X) == 0x000380, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakVector_Y) == 0x000388, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakVector_Z) == 0x000390, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeVector2D_ReturnValue) == 0x000398, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0003A8, "Member 'FenceGenerator_C_BuildFence::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x0003C0, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetRotationAtSplinePoint_ReturnValue_1) == 0x0003D8, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetRotationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Roll) == 0x0003F0, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Pitch) == 0x0003F4, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Yaw) == 0x0003F8, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Roll_1) == 0x0003FC, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Pitch_1) == 0x000400, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Yaw_1) == 0x000404, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000408, "Member 'FenceGenerator_C_BuildFence::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000410, "Member 'FenceGenerator_C_BuildFence::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetTransformAtSplinePoint_ReturnValue) == 0x000420, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetTransformAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetTangentAtSplinePoint_ReturnValue) == 0x000480, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakTransform_Location) == 0x000498, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakTransform_Rotation) == 0x0004B0, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakTransform_Scale) == 0x0004C8, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Roll_2) == 0x0004E0, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Pitch_2) == 0x0004E4, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_BreakRotator_Yaw_2) == 0x0004E8, "Member 'FenceGenerator_C_BuildFence::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeRotator_ReturnValue_1) == 0x0004F0, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_MakeTransform_ReturnValue_3) == 0x000510, "Member 'FenceGenerator_C_BuildFence::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_AddComponent_ReturnValue_3) == 0x000570, "Member 'FenceGenerator_C_BuildFence::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x000578, "Member 'FenceGenerator_C_BuildFence::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(FenceGenerator_C_BuildFence, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000580, "Member 'FenceGenerator_C_BuildFence::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
