#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyCorridor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FlyCorridor.FlyCorridorDebugComponent.ShowCorridor
// 0x0048 (0x0048 - 0x0000)
struct FlyCorridorDebugComponent_ShowCorridor final
{
public:
	const class UAnimMontage*                     AnimMontage;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartLocation;                                     // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawTime;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ZScale;                                            // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FlyCorridorDebugComponent_ShowCorridor) == 0x000008, "Wrong alignment on FlyCorridorDebugComponent_ShowCorridor");
static_assert(sizeof(FlyCorridorDebugComponent_ShowCorridor) == 0x000048, "Wrong size on FlyCorridorDebugComponent_ShowCorridor");
static_assert(offsetof(FlyCorridorDebugComponent_ShowCorridor, AnimMontage) == 0x000000, "Member 'FlyCorridorDebugComponent_ShowCorridor::AnimMontage' has a wrong offset!");
static_assert(offsetof(FlyCorridorDebugComponent_ShowCorridor, StartLocation) == 0x000008, "Member 'FlyCorridorDebugComponent_ShowCorridor::StartLocation' has a wrong offset!");
static_assert(offsetof(FlyCorridorDebugComponent_ShowCorridor, EndLocation) == 0x000020, "Member 'FlyCorridorDebugComponent_ShowCorridor::EndLocation' has a wrong offset!");
static_assert(offsetof(FlyCorridorDebugComponent_ShowCorridor, DrawTime) == 0x000038, "Member 'FlyCorridorDebugComponent_ShowCorridor::DrawTime' has a wrong offset!");
static_assert(offsetof(FlyCorridorDebugComponent_ShowCorridor, ZScale) == 0x000040, "Member 'FlyCorridorDebugComponent_ShowCorridor::ZScale' has a wrong offset!");

}

