#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyboardSettingsNavigationPanel

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeyboardSettingsNavigationPanel.KeyboardSettingsNavigationPanel_C
// 0x0030 (0x02C0 - 0x0290)
class UKeyboardSettingsNavigationPanel_C final : public USettingsNavigationPanel
{
public:
	class USettingsNavPanelSlot_C*                Dialogues;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsNavPanelSlot_C*                FightAndExploration;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsNavPanelSlot_C*                General;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsNavPanelSlot_C*                Inventory;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsNavPanelSlot_C*                Moving;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingsNavPanelSlot_C*                PDA;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeyboardSettingsNavigationPanel_C">();
	}
	static class UKeyboardSettingsNavigationPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyboardSettingsNavigationPanel_C>();
	}
};
static_assert(alignof(UKeyboardSettingsNavigationPanel_C) == 0x000008, "Wrong alignment on UKeyboardSettingsNavigationPanel_C");
static_assert(sizeof(UKeyboardSettingsNavigationPanel_C) == 0x0002C0, "Wrong size on UKeyboardSettingsNavigationPanel_C");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, Dialogues) == 0x000290, "Member 'UKeyboardSettingsNavigationPanel_C::Dialogues' has a wrong offset!");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, FightAndExploration) == 0x000298, "Member 'UKeyboardSettingsNavigationPanel_C::FightAndExploration' has a wrong offset!");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, General) == 0x0002A0, "Member 'UKeyboardSettingsNavigationPanel_C::General' has a wrong offset!");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, Inventory) == 0x0002A8, "Member 'UKeyboardSettingsNavigationPanel_C::Inventory' has a wrong offset!");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, Moving) == 0x0002B0, "Member 'UKeyboardSettingsNavigationPanel_C::Moving' has a wrong offset!");
static_assert(offsetof(UKeyboardSettingsNavigationPanel_C, PDA) == 0x0002B8, "Member 'UKeyboardSettingsNavigationPanel_C::PDA' has a wrong offset!");

}

