#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Landscape

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Landscape.EScaleMode
// NumValues: 0x0004
enum class EScaleMode : uint8
{
	Uniform                                  = 0,
	HorizontalUniform                        = 1,
	NonUniform                               = 2,
	EScaleMode_MAX                           = 3,
};

// Enum Landscape.ELandscapeSetupErrors
// NumValues: 0x0005
enum class ELandscapeSetupErrors : uint8
{
	LSE_None                                 = 0,
	LSE_NoLandscapeInfo                      = 1,
	LSE_CollsionXY                           = 2,
	LSE_NoLayerInfo                          = 3,
	LSE_MAX                                  = 4,
};

// Enum Landscape.ERTDrawingType
// NumValues: 0x0006
enum class ERTDrawingType : uint8
{
	RTAtlas                                  = 0,
	RTAtlasToNonAtlas                        = 1,
	RTNonAtlasToAtlas                        = 2,
	RTNonAtlas                               = 3,
	RTMips                                   = 4,
	ERTDrawingType_MAX                       = 5,
};

// Enum Landscape.EHeightmapRTType
// NumValues: 0x000E
enum class EHeightmapRTType : uint8
{
	HeightmapRT_CombinedAtlas                = 0,
	HeightmapRT_CombinedNonAtlas             = 1,
	HeightmapRT_Scratch1                     = 2,
	HeightmapRT_Scratch2                     = 3,
	HeightmapRT_Scratch3                     = 4,
	HeightmapRT_Mip1                         = 5,
	HeightmapRT_Mip2                         = 6,
	HeightmapRT_Mip3                         = 7,
	HeightmapRT_Mip4                         = 8,
	HeightmapRT_Mip5                         = 9,
	HeightmapRT_Mip6                         = 10,
	HeightmapRT_Mip7                         = 11,
	HeightmapRT_Count                        = 12,
	HeightmapRT_MAX                          = 13,
};

// Enum Landscape.EWeightmapRTType
// NumValues: 0x000E
enum class EWeightmapRTType : uint8
{
	WeightmapRT_Scratch_RGBA                 = 0,
	WeightmapRT_Scratch1                     = 1,
	WeightmapRT_Scratch2                     = 2,
	WeightmapRT_Scratch3                     = 3,
	WeightmapRT_Mip0                         = 4,
	WeightmapRT_Mip1                         = 5,
	WeightmapRT_Mip2                         = 6,
	WeightmapRT_Mip3                         = 7,
	WeightmapRT_Mip4                         = 8,
	WeightmapRT_Mip5                         = 9,
	WeightmapRT_Mip6                         = 10,
	WeightmapRT_Mip7                         = 11,
	WeightmapRT_Count                        = 12,
	WeightmapRT_MAX                          = 13,
};

// Enum Landscape.ELandscapeBlendMode
// NumValues: 0x0003
enum class ELandscapeBlendMode : uint8
{
	LSBM_AdditiveBlend                       = 0,
	LSBM_AlphaBlend                          = 1,
	LSBM_MAX                                 = 2,
};

// Enum Landscape.ELandscapeClearMode
// NumValues: 0x0004
enum class ELandscapeClearMode : uint8
{
	Clear_Weightmap                          = 1,
	Clear_Heightmap                          = 2,
	Clear_All                                = 3,
	Clear_MAX                                = 4,
};

// Enum Landscape.EFoliageGeneratorBiome
// NumValues: 0x0022
enum class EFoliageGeneratorBiome : uint8
{
	Unselected                               = 0,
	Biome_0                                  = 1,
	Biome_1                                  = 2,
	Biome_2                                  = 3,
	Biome_3                                  = 4,
	Biome_4                                  = 5,
	Biome_5                                  = 6,
	Biome_6                                  = 7,
	Biome_7                                  = 8,
	Biome_8                                  = 9,
	Biome_9                                  = 10,
	Biome_10                                 = 11,
	Biome_11                                 = 12,
	Biome_12                                 = 13,
	Biome_13                                 = 14,
	Biome_14                                 = 15,
	Biome_15                                 = 16,
	Biome_16                                 = 17,
	Biome_17                                 = 18,
	Biome_18                                 = 19,
	Biome_19                                 = 20,
	Biome_20                                 = 21,
	Biome_21                                 = 22,
	Biome_22                                 = 23,
	Biome_23                                 = 24,
	Biome_24                                 = 25,
	Biome_25                                 = 26,
	Biome_26                                 = 27,
	Biome_27                                 = 28,
	Biome_28                                 = 29,
	Biome_29                                 = 30,
	Biome_30                                 = 31,
	Biome_31                                 = 32,
	EFoliageGeneratorBiome_MAX               = 33,
};

// Enum Landscape.EFoliageGeneratorGrassLayer
// NumValues: 0x000A
enum class EFoliageGeneratorGrassLayer : uint8
{
	Unselected                               = 0,
	GrassLayer_0                             = 1,
	GrassLayer_1                             = 2,
	GrassLayer_2                             = 3,
	GrassLayer_3                             = 4,
	GrassLayer_4                             = 5,
	GrassLayer_5                             = 6,
	GrassLayer_6                             = 7,
	GrassLayer_7                             = 8,
	EFoliageGeneratorGrassLayer_MAX          = 9,
};

// Enum Landscape.EFoliageGeneratorFoliageMapLayer
// NumValues: 0x0012
enum class EFoliageGeneratorFoliageMapLayer : uint8
{
	Unselected                               = 0,
	FoliageMapLayer_0                        = 1,
	FoliageMapLayer_1                        = 2,
	FoliageMapLayer_2                        = 3,
	FoliageMapLayer_3                        = 4,
	FoliageMapLayer_4                        = 5,
	FoliageMapLayer_5                        = 6,
	FoliageMapLayer_6                        = 7,
	FoliageMapLayer_7                        = 8,
	FoliageMapLayer_8                        = 9,
	FoliageMapLayer_9                        = 10,
	FoliageMapLayer_10                       = 11,
	FoliageMapLayer_11                       = 12,
	FoliageMapLayer_12                       = 13,
	FoliageMapLayer_13                       = 14,
	FoliageMapLayer_14                       = 15,
	FoliageMapLayer_15                       = 16,
	EFoliageGeneratorFoliageMapLayer_MAX     = 17,
};

// Enum Landscape.ELandscapeGizmoType
// NumValues: 0x0004
enum class ELandscapeGizmoType : uint8
{
	LGT_None                                 = 0,
	LGT_Height                               = 1,
	LGT_Weight                               = 2,
	LGT_MAX                                  = 3,
};

// Enum Landscape.EGrassScaling
// NumValues: 0x0004
enum class EGrassScaling : uint8
{
	Uniform                                  = 0,
	Free                                     = 1,
	LockXY                                   = 2,
	EGrassScaling_MAX                        = 3,
};

// Enum Landscape.ELandscapeFoliageType
// NumValues: 0x0005
enum class ELandscapeFoliageType : uint8
{
	Trees                                    = 0,
	Bushes                                   = 1,
	Grass                                    = 2,
	LowGrass                                 = 3,
	ELandscapeFoliageType_MAX                = 4,
};

// Enum Landscape.ETreeType
// NumValues: 0x0004
enum class ETreeType : uint8
{
	Unknown                                  = 0,
	InnerTree                                = 1,
	OuterTree                                = 2,
	ETreeType_MAX                            = 3,
};

// Enum Landscape.ESplineModulationColorMask
// NumValues: 0x0005
enum class ESplineModulationColorMask : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	ESplineModulationColorMask_MAX           = 4,
};

// Enum Landscape.LandscapeSplineMeshOrientation
// NumValues: 0x0003
enum class ELandscapeSplineMeshOrientation : uint8
{
	LSMO_XUp                                 = 0,
	LSMO_YUp                                 = 1,
	LSMO_MAX                                 = 2,
};

// Enum Landscape.ELandscapeLayerBlendType
// NumValues: 0x0004
enum class ELandscapeLayerBlendType : uint8
{
	LB_WeightBlend                           = 0,
	LB_AlphaBlend                            = 1,
	LB_HeightBlend                           = 2,
	LB_MAX                                   = 3,
};

// Enum Landscape.ETerrainCoordMappingType
// NumValues: 0x0005
enum class ETerrainCoordMappingType : uint8
{
	TCMT_Auto                                = 0,
	TCMT_XY                                  = 1,
	TCMT_XZ                                  = 2,
	TCMT_YZ                                  = 3,
	TCMT_MAX                                 = 4,
};

// Enum Landscape.ELandscapeCustomizedCoordType
// NumValues: 0x0006
enum class ELandscapeCustomizedCoordType : uint8
{
	LCCT_None                                = 0,
	LCCT_CustomUV0                           = 1,
	LCCT_CustomUV1                           = 2,
	LCCT_CustomUV2                           = 3,
	LCCT_WeightMapUV                         = 4,
	LCCT_MAX                                 = 5,
};

// Enum Landscape.ELandscapeResizeMode
// NumValues: 0x0004
enum class ELandscapeResizeMode : uint8
{
	Resample                                 = 0,
	Clip                                     = 1,
	Expand                                   = 2,
	ELandscapeResizeMode_MAX                 = 3,
};

// Enum Landscape.ELandscapeImportAlphamapType
// NumValues: 0x0003
enum class ELandscapeImportAlphamapType : uint8
{
	Additive                                 = 0,
	Layered                                  = 1,
	ELandscapeImportAlphamapType_MAX         = 2,
};

// Enum Landscape.ELandscapeLayerPaintingRestriction
// NumValues: 0x0005
enum class ELandscapeLayerPaintingRestriction : uint8
{
	None                                     = 0,
	UseMaxLayers                             = 1,
	ExistingOnly                             = 2,
	UseComponentAllowList                    = 3,
	ELandscapeLayerPaintingRestriction_MAX   = 4,
};

// Enum Landscape.ELandscapeLayerDisplayMode
// NumValues: 0x0004
enum class ELandscapeLayerDisplayMode : uint8
{
	Default                                  = 0,
	Alphabetical                             = 1,
	UserSpecific                             = 2,
	ELandscapeLayerDisplayMode_MAX           = 3,
};

// Enum Landscape.ELandscapeLODFalloff
// NumValues: 0x0003
enum class ELandscapeLODFalloff : uint8
{
	Linear                                   = 0,
	SquareRoot                               = 1,
	ELandscapeLODFalloff_MAX                 = 2,
};

// ScriptStruct Landscape.CompressedTransformRanges
// 0x004C (0x004C - 0x0000)
struct FCompressedTransformRanges final
{
public:
	struct FRotator3f                             MinRotation;                                       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator3f                             MaxRotation;                                       // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector3f                              MinScale;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              MaxScale;                                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              MinPosition;                                       // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              MaxPosition;                                       // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScaleMode                                    ScaleMode;                                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHeight8Bit;                                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCompressedTransformRanges) == 0x000004, "Wrong alignment on FCompressedTransformRanges");
static_assert(sizeof(FCompressedTransformRanges) == 0x00004C, "Wrong size on FCompressedTransformRanges");
static_assert(offsetof(FCompressedTransformRanges, MinRotation) == 0x000000, "Member 'FCompressedTransformRanges::MinRotation' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, MaxRotation) == 0x00000C, "Member 'FCompressedTransformRanges::MaxRotation' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, MinScale) == 0x000018, "Member 'FCompressedTransformRanges::MinScale' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, MaxScale) == 0x000024, "Member 'FCompressedTransformRanges::MaxScale' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, MinPosition) == 0x000030, "Member 'FCompressedTransformRanges::MinPosition' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, MaxPosition) == 0x00003C, "Member 'FCompressedTransformRanges::MaxPosition' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, ScaleMode) == 0x000048, "Member 'FCompressedTransformRanges::ScaleMode' has a wrong offset!");
static_assert(offsetof(FCompressedTransformRanges, bIsHeight8Bit) == 0x000049, "Member 'FCompressedTransformRanges::bIsHeight8Bit' has a wrong offset!");

// ScriptStruct Landscape.SubcomponentBakedFoliage
// 0x00C0 (0x00C0 - 0x0000)
struct FSubcomponentBakedFoliage final
{
public:
	TArray<uint32>                                TransformRanges;                                   // 0x0000(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FCompressedTransformRanges             Ranges;                                            // 0x0010(0x004C)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         InstancingRNGSeed;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumTransforms;                                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x5C];                                      // 0x0064(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSubcomponentBakedFoliage) == 0x000008, "Wrong alignment on FSubcomponentBakedFoliage");
static_assert(sizeof(FSubcomponentBakedFoliage) == 0x0000C0, "Wrong size on FSubcomponentBakedFoliage");
static_assert(offsetof(FSubcomponentBakedFoliage, TransformRanges) == 0x000000, "Member 'FSubcomponentBakedFoliage::TransformRanges' has a wrong offset!");
static_assert(offsetof(FSubcomponentBakedFoliage, Ranges) == 0x000010, "Member 'FSubcomponentBakedFoliage::Ranges' has a wrong offset!");
static_assert(offsetof(FSubcomponentBakedFoliage, InstancingRNGSeed) == 0x00005C, "Member 'FSubcomponentBakedFoliage::InstancingRNGSeed' has a wrong offset!");
static_assert(offsetof(FSubcomponentBakedFoliage, NumTransforms) == 0x000060, "Member 'FSubcomponentBakedFoliage::NumTransforms' has a wrong offset!");

// ScriptStruct Landscape.LandscapeProxyMaterialOverride
// 0x0010 (0x0010 - 0x0000)
struct FLandscapeProxyMaterialOverride final
{
public:
	struct FPerPlatformInt                        LODIndex;                                          // 0x0000(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLandscapeProxyMaterialOverride) == 0x000008, "Wrong alignment on FLandscapeProxyMaterialOverride");
static_assert(sizeof(FLandscapeProxyMaterialOverride) == 0x000010, "Wrong size on FLandscapeProxyMaterialOverride");
static_assert(offsetof(FLandscapeProxyMaterialOverride, LODIndex) == 0x000000, "Member 'FLandscapeProxyMaterialOverride::LODIndex' has a wrong offset!");
static_assert(offsetof(FLandscapeProxyMaterialOverride, Material) == 0x000008, "Member 'FLandscapeProxyMaterialOverride::Material' has a wrong offset!");

// ScriptStruct Landscape.HISMOrISMBakedFoliage
// 0x0068 (0x0068 - 0x0000)
struct FHISMOrISMBakedFoliage final
{
public:
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0000(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartCullDistance;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndCullDistance;                                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartFadeInDistance;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndFadeInDistance;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCastsDynamicShadows;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastsContactShadows;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectsDistanceLighting;                          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCollision;                                     // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReceivesDecals;                                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x13];                                      // 0x0055(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHISMOrISMBakedFoliage) == 0x000008, "Wrong alignment on FHISMOrISMBakedFoliage");
static_assert(sizeof(FHISMOrISMBakedFoliage) == 0x000068, "Wrong size on FHISMOrISMBakedFoliage");
static_assert(offsetof(FHISMOrISMBakedFoliage, Mesh) == 0x000000, "Member 'FHISMOrISMBakedFoliage::Mesh' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, StartCullDistance) == 0x000030, "Member 'FHISMOrISMBakedFoliage::StartCullDistance' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, EndCullDistance) == 0x000034, "Member 'FHISMOrISMBakedFoliage::EndCullDistance' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, StartFadeInDistance) == 0x000038, "Member 'FHISMOrISMBakedFoliage::StartFadeInDistance' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, EndFadeInDistance) == 0x00003C, "Member 'FHISMOrISMBakedFoliage::EndFadeInDistance' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, bCastsDynamicShadows) == 0x000050, "Member 'FHISMOrISMBakedFoliage::bCastsDynamicShadows' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, bCastsContactShadows) == 0x000051, "Member 'FHISMOrISMBakedFoliage::bCastsContactShadows' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, bAffectsDistanceLighting) == 0x000052, "Member 'FHISMOrISMBakedFoliage::bAffectsDistanceLighting' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, bHasCollision) == 0x000053, "Member 'FHISMOrISMBakedFoliage::bHasCollision' has a wrong offset!");
static_assert(offsetof(FHISMOrISMBakedFoliage, bReceivesDecals) == 0x000054, "Member 'FHISMOrISMBakedFoliage::bReceivesDecals' has a wrong offset!");

// ScriptStruct Landscape.FoliageTypeBakedFoliage
// 0x0028 (0x0028 - 0x0000)
struct FFoliageTypeBakedFoliage final
{
public:
	uint32                                        ComponentSubdivisionFactor;                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DistantComponentSubdivisionFactor;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHISMOrISMBakedFoliage>         HISMsOrISMs;                                       // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MaxEndCullDistance;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistantEndCullDistance;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinStartFadeInDistance;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFoliageTypeBakedFoliage) == 0x000008, "Wrong alignment on FFoliageTypeBakedFoliage");
static_assert(sizeof(FFoliageTypeBakedFoliage) == 0x000028, "Wrong size on FFoliageTypeBakedFoliage");
static_assert(offsetof(FFoliageTypeBakedFoliage, ComponentSubdivisionFactor) == 0x000000, "Member 'FFoliageTypeBakedFoliage::ComponentSubdivisionFactor' has a wrong offset!");
static_assert(offsetof(FFoliageTypeBakedFoliage, DistantComponentSubdivisionFactor) == 0x000004, "Member 'FFoliageTypeBakedFoliage::DistantComponentSubdivisionFactor' has a wrong offset!");
static_assert(offsetof(FFoliageTypeBakedFoliage, HISMsOrISMs) == 0x000008, "Member 'FFoliageTypeBakedFoliage::HISMsOrISMs' has a wrong offset!");
static_assert(offsetof(FFoliageTypeBakedFoliage, MaxEndCullDistance) == 0x000018, "Member 'FFoliageTypeBakedFoliage::MaxEndCullDistance' has a wrong offset!");
static_assert(offsetof(FFoliageTypeBakedFoliage, MaxDistantEndCullDistance) == 0x00001C, "Member 'FFoliageTypeBakedFoliage::MaxDistantEndCullDistance' has a wrong offset!");
static_assert(offsetof(FFoliageTypeBakedFoliage, MinStartFadeInDistance) == 0x000020, "Member 'FFoliageTypeBakedFoliage::MinStartFadeInDistance' has a wrong offset!");

// ScriptStruct Landscape.BakedFoliage
// 0x0078 (0x0078 - 0x0000)
struct FBakedFoliage final
{
public:
	struct FFoliageTypeBakedFoliage               TreeBakedFoliage;                                  // 0x0000(0x0028)(NativeAccessSpecifierPublic)
	struct FFoliageTypeBakedFoliage               BushBakedFoliage;                                  // 0x0028(0x0028)(NativeAccessSpecifierPublic)
	struct FFoliageTypeBakedFoliage               GrassBakedFoliage;                                 // 0x0050(0x0028)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FBakedFoliage) == 0x000008, "Wrong alignment on FBakedFoliage");
static_assert(sizeof(FBakedFoliage) == 0x000078, "Wrong size on FBakedFoliage");
static_assert(offsetof(FBakedFoliage, TreeBakedFoliage) == 0x000000, "Member 'FBakedFoliage::TreeBakedFoliage' has a wrong offset!");
static_assert(offsetof(FBakedFoliage, BushBakedFoliage) == 0x000028, "Member 'FBakedFoliage::BushBakedFoliage' has a wrong offset!");
static_assert(offsetof(FBakedFoliage, GrassBakedFoliage) == 0x000050, "Member 'FBakedFoliage::GrassBakedFoliage' has a wrong offset!");

// ScriptStruct Landscape.UInt8Interval
// 0x0002 (0x0002 - 0x0000)
struct FUInt8Interval final
{
public:
	uint8                                         LowerBound;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UpperBound;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUInt8Interval) == 0x000001, "Wrong alignment on FUInt8Interval");
static_assert(sizeof(FUInt8Interval) == 0x000002, "Wrong size on FUInt8Interval");
static_assert(offsetof(FUInt8Interval, LowerBound) == 0x000000, "Member 'FUInt8Interval::LowerBound' has a wrong offset!");
static_assert(offsetof(FUInt8Interval, UpperBound) == 0x000001, "Member 'FUInt8Interval::UpperBound' has a wrong offset!");

// ScriptStruct Landscape.CullDistance
// 0x0008 (0x0008 - 0x0000)
struct FCullDistance final
{
public:
	float                                         CullDistance;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullRange;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCullDistance) == 0x000004, "Wrong alignment on FCullDistance");
static_assert(sizeof(FCullDistance) == 0x000008, "Wrong size on FCullDistance");
static_assert(offsetof(FCullDistance, CullDistance) == 0x000000, "Member 'FCullDistance::CullDistance' has a wrong offset!");
static_assert(offsetof(FCullDistance, CullRange) == 0x000004, "Member 'FCullDistance::CullRange' has a wrong offset!");

// ScriptStruct Landscape.LayerMap
// 0x0018 (0x0018 - 0x0000)
struct FLayerMap final
{
public:
	class USRLEAsset*                             Texture;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TileFactor;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         Range;                                             // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLayerMap) == 0x000008, "Wrong alignment on FLayerMap");
static_assert(sizeof(FLayerMap) == 0x000018, "Wrong size on FLayerMap");
static_assert(offsetof(FLayerMap, Texture) == 0x000000, "Member 'FLayerMap::Texture' has a wrong offset!");
static_assert(offsetof(FLayerMap, TileFactor) == 0x000008, "Member 'FLayerMap::TileFactor' has a wrong offset!");
static_assert(offsetof(FLayerMap, Range) == 0x00000C, "Member 'FLayerMap::Range' has a wrong offset!");

// ScriptStruct Landscape.VarietyMap
// 0x0010 (0x0010 - 0x0000)
struct FVarietyMap final
{
public:
	class USRLEAsset*                             Texture;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TileFactor;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlapFactor;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVarietyMap) == 0x000008, "Wrong alignment on FVarietyMap");
static_assert(sizeof(FVarietyMap) == 0x000010, "Wrong size on FVarietyMap");
static_assert(offsetof(FVarietyMap, Texture) == 0x000000, "Member 'FVarietyMap::Texture' has a wrong offset!");
static_assert(offsetof(FVarietyMap, TileFactor) == 0x000008, "Member 'FVarietyMap::TileFactor' has a wrong offset!");
static_assert(offsetof(FVarietyMap, OverlapFactor) == 0x00000C, "Member 'FVarietyMap::OverlapFactor' has a wrong offset!");

// ScriptStruct Landscape.HeightFootprint
// 0x0010 (0x0010 - 0x0000)
struct FHeightFootprint final
{
public:
	float                                         Footprint;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideHoverAndSubmerge;                         // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Hover;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Submerge;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHeightFootprint) == 0x000004, "Wrong alignment on FHeightFootprint");
static_assert(sizeof(FHeightFootprint) == 0x000010, "Wrong size on FHeightFootprint");
static_assert(offsetof(FHeightFootprint, Footprint) == 0x000000, "Member 'FHeightFootprint::Footprint' has a wrong offset!");
static_assert(offsetof(FHeightFootprint, bOverrideHoverAndSubmerge) == 0x000004, "Member 'FHeightFootprint::bOverrideHoverAndSubmerge' has a wrong offset!");
static_assert(offsetof(FHeightFootprint, Hover) == 0x000008, "Member 'FHeightFootprint::Hover' has a wrong offset!");
static_assert(offsetof(FHeightFootprint, Submerge) == 0x00000C, "Member 'FHeightFootprint::Submerge' has a wrong offset!");

// ScriptStruct Landscape.GrassVarietyAdvanced
// 0x00D0 (0x00D0 - 0x0000)
struct FGrassVarietyAdvanced final
{
public:
	class UStaticMesh*                            GrassMesh;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             OverrideMaterials;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FPerPlatformFloat                      GrassDensity;                                      // 0x0018(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseGrid;                                          // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlacementJitter;                                   // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerPlatformInt                        StartCullDistance;                                 // 0x0024(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformInt                        EndCullDistance;                                   // 0x0028(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MinLOD;                                            // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrassScaling                                 Scaling;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         ScaleX;                                            // 0x0034(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         ScaleY;                                            // 0x003C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         ScaleZ;                                            // 0x0044(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RandomRotation;                                    // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxPitchRotation;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRollRotation;                                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpecificSlopeRotationPerAxis;                  // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatInterval                         PitchRotation;                                     // 0x005C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         RollRotation;                                      // 0x0064(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfaceAlignment;                                  // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrunkDiameter;                                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSlopeGroup;                               // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SlopeGroupIndex;                                   // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCastsDynamicShadows;                      // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastsDynamicShadows;                              // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCastsContactShadows;                      // 0x007E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastsContactShadows;                              // 0x007F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLandscapeLightmap;                             // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightingChannels                      LightingChannels;                                  // 0x0081(0x0001)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bReceivesDecals;                                   // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectDistanceFieldLighting;                      // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastDynamicShadow;                                // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastContactShadow;                                // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepInstanceBufferCPUCopy;                        // 0x0086(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        InstanceWorldPositionOffsetDisableDistance;        // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFoliageCollisionFootprint;                     // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FoliageCollisionFootprint;                         // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFoliageCollisionCrownFootprint;                // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FoliageCollisionCrownFootprint;                    // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideGeometryCollisionFootprint;               // 0x009C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GeometryCollisionFootprint;                        // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideGeometryCollisionCrownFootprint;          // 0x00A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GeometryCollisionCrownFootprint;                   // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasHeightFootprint;                               // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHeightFootprint                       HeightFootprint;                                   // 0x00B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         GeneratorWeight;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         ZOffsetRandomInterval;                             // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAffectsDistanceFieldLighting;             // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectsDistanceFieldLighting;                     // 0x00CD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoNotSpawnOnMeshes;                               // 0x00CE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGrassVarietyAdvanced) == 0x000008, "Wrong alignment on FGrassVarietyAdvanced");
static_assert(sizeof(FGrassVarietyAdvanced) == 0x0000D0, "Wrong size on FGrassVarietyAdvanced");
static_assert(offsetof(FGrassVarietyAdvanced, GrassMesh) == 0x000000, "Member 'FGrassVarietyAdvanced::GrassMesh' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, OverrideMaterials) == 0x000008, "Member 'FGrassVarietyAdvanced::OverrideMaterials' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, GrassDensity) == 0x000018, "Member 'FGrassVarietyAdvanced::GrassDensity' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bUseGrid) == 0x00001C, "Member 'FGrassVarietyAdvanced::bUseGrid' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, PlacementJitter) == 0x000020, "Member 'FGrassVarietyAdvanced::PlacementJitter' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, StartCullDistance) == 0x000024, "Member 'FGrassVarietyAdvanced::StartCullDistance' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, EndCullDistance) == 0x000028, "Member 'FGrassVarietyAdvanced::EndCullDistance' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, MinLOD) == 0x00002C, "Member 'FGrassVarietyAdvanced::MinLOD' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, Scaling) == 0x000030, "Member 'FGrassVarietyAdvanced::Scaling' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, ScaleX) == 0x000034, "Member 'FGrassVarietyAdvanced::ScaleX' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, ScaleY) == 0x00003C, "Member 'FGrassVarietyAdvanced::ScaleY' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, ScaleZ) == 0x000044, "Member 'FGrassVarietyAdvanced::ScaleZ' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, RandomRotation) == 0x00004C, "Member 'FGrassVarietyAdvanced::RandomRotation' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, MaxPitchRotation) == 0x000050, "Member 'FGrassVarietyAdvanced::MaxPitchRotation' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, MaxRollRotation) == 0x000054, "Member 'FGrassVarietyAdvanced::MaxRollRotation' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bUseSpecificSlopeRotationPerAxis) == 0x000058, "Member 'FGrassVarietyAdvanced::bUseSpecificSlopeRotationPerAxis' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, PitchRotation) == 0x00005C, "Member 'FGrassVarietyAdvanced::PitchRotation' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, RollRotation) == 0x000064, "Member 'FGrassVarietyAdvanced::RollRotation' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, SurfaceAlignment) == 0x00006C, "Member 'FGrassVarietyAdvanced::SurfaceAlignment' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, TrunkDiameter) == 0x000070, "Member 'FGrassVarietyAdvanced::TrunkDiameter' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideSlopeGroup) == 0x000074, "Member 'FGrassVarietyAdvanced::bOverrideSlopeGroup' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, SlopeGroupIndex) == 0x000078, "Member 'FGrassVarietyAdvanced::SlopeGroupIndex' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideCastsDynamicShadows) == 0x00007C, "Member 'FGrassVarietyAdvanced::bOverrideCastsDynamicShadows' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bCastsDynamicShadows) == 0x00007D, "Member 'FGrassVarietyAdvanced::bCastsDynamicShadows' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideCastsContactShadows) == 0x00007E, "Member 'FGrassVarietyAdvanced::bOverrideCastsContactShadows' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bCastsContactShadows) == 0x00007F, "Member 'FGrassVarietyAdvanced::bCastsContactShadows' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bUseLandscapeLightmap) == 0x000080, "Member 'FGrassVarietyAdvanced::bUseLandscapeLightmap' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, LightingChannels) == 0x000081, "Member 'FGrassVarietyAdvanced::LightingChannels' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bReceivesDecals) == 0x000082, "Member 'FGrassVarietyAdvanced::bReceivesDecals' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bAffectDistanceFieldLighting) == 0x000083, "Member 'FGrassVarietyAdvanced::bAffectDistanceFieldLighting' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bCastDynamicShadow) == 0x000084, "Member 'FGrassVarietyAdvanced::bCastDynamicShadow' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bCastContactShadow) == 0x000085, "Member 'FGrassVarietyAdvanced::bCastContactShadow' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bKeepInstanceBufferCPUCopy) == 0x000086, "Member 'FGrassVarietyAdvanced::bKeepInstanceBufferCPUCopy' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, InstanceWorldPositionOffsetDisableDistance) == 0x000088, "Member 'FGrassVarietyAdvanced::InstanceWorldPositionOffsetDisableDistance' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bHasFoliageCollisionFootprint) == 0x00008C, "Member 'FGrassVarietyAdvanced::bHasFoliageCollisionFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, FoliageCollisionFootprint) == 0x000090, "Member 'FGrassVarietyAdvanced::FoliageCollisionFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bHasFoliageCollisionCrownFootprint) == 0x000094, "Member 'FGrassVarietyAdvanced::bHasFoliageCollisionCrownFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, FoliageCollisionCrownFootprint) == 0x000098, "Member 'FGrassVarietyAdvanced::FoliageCollisionCrownFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideGeometryCollisionFootprint) == 0x00009C, "Member 'FGrassVarietyAdvanced::bOverrideGeometryCollisionFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, GeometryCollisionFootprint) == 0x0000A0, "Member 'FGrassVarietyAdvanced::GeometryCollisionFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideGeometryCollisionCrownFootprint) == 0x0000A4, "Member 'FGrassVarietyAdvanced::bOverrideGeometryCollisionCrownFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, GeometryCollisionCrownFootprint) == 0x0000A8, "Member 'FGrassVarietyAdvanced::GeometryCollisionCrownFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bHasHeightFootprint) == 0x0000AC, "Member 'FGrassVarietyAdvanced::bHasHeightFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, HeightFootprint) == 0x0000B0, "Member 'FGrassVarietyAdvanced::HeightFootprint' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, GeneratorWeight) == 0x0000C0, "Member 'FGrassVarietyAdvanced::GeneratorWeight' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, ZOffsetRandomInterval) == 0x0000C4, "Member 'FGrassVarietyAdvanced::ZOffsetRandomInterval' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bOverrideAffectsDistanceFieldLighting) == 0x0000CC, "Member 'FGrassVarietyAdvanced::bOverrideAffectsDistanceFieldLighting' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bAffectsDistanceFieldLighting) == 0x0000CD, "Member 'FGrassVarietyAdvanced::bAffectsDistanceFieldLighting' has a wrong offset!");
static_assert(offsetof(FGrassVarietyAdvanced, bDoNotSpawnOnMeshes) == 0x0000CE, "Member 'FGrassVarietyAdvanced::bDoNotSpawnOnMeshes' has a wrong offset!");

// ScriptStruct Landscape.GrassVariety
// 0x00E8 (0x00E8 - 0x0000)
struct FGrassVariety final
{
public:
	class UStaticMesh*                            GrassMesh;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSCFoliagePrefab*                      FoliagePrefab;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisabled;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistantFoliage;                                   // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrassVarietyAdvanced                  Advanced;                                          // 0x0018(0x00D0)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGrassVariety) == 0x000008, "Wrong alignment on FGrassVariety");
static_assert(sizeof(FGrassVariety) == 0x0000E8, "Wrong size on FGrassVariety");
static_assert(offsetof(FGrassVariety, GrassMesh) == 0x000000, "Member 'FGrassVariety::GrassMesh' has a wrong offset!");
static_assert(offsetof(FGrassVariety, FoliagePrefab) == 0x000008, "Member 'FGrassVariety::FoliagePrefab' has a wrong offset!");
static_assert(offsetof(FGrassVariety, bDisabled) == 0x000010, "Member 'FGrassVariety::bDisabled' has a wrong offset!");
static_assert(offsetof(FGrassVariety, bDistantFoliage) == 0x000011, "Member 'FGrassVariety::bDistantFoliage' has a wrong offset!");
static_assert(offsetof(FGrassVariety, Advanced) == 0x000018, "Member 'FGrassVariety::Advanced' has a wrong offset!");

// ScriptStruct Landscape.FoliageSubLayerDensity
// 0x0068 (0x0068 - 0x0000)
struct FFoliageSubLayerDensity final
{
public:
	float                                         Density;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistantDensityScale;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCullDistance;                             // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCullDistance                          CullDistance;                                      // 0x000C(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCullDistance                          FarCullDistance;                                   // 0x0014(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseLayerMap;                                      // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLayerMap                              LayerMap;                                          // 0x0020(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseVarietyMap;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVarietyMap                            VarietyMap;                                        // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDisabled;                                         // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHidden;                                           // 0x0051(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NonTransactional, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGrassVariety>                  FoliageVarieties;                                  // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFoliageSubLayerDensity) == 0x000008, "Wrong alignment on FFoliageSubLayerDensity");
static_assert(sizeof(FFoliageSubLayerDensity) == 0x000068, "Wrong size on FFoliageSubLayerDensity");
static_assert(offsetof(FFoliageSubLayerDensity, Density) == 0x000000, "Member 'FFoliageSubLayerDensity::Density' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, DistantDensityScale) == 0x000004, "Member 'FFoliageSubLayerDensity::DistantDensityScale' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, bOverrideCullDistance) == 0x000008, "Member 'FFoliageSubLayerDensity::bOverrideCullDistance' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, CullDistance) == 0x00000C, "Member 'FFoliageSubLayerDensity::CullDistance' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, FarCullDistance) == 0x000014, "Member 'FFoliageSubLayerDensity::FarCullDistance' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, bUseLayerMap) == 0x00001C, "Member 'FFoliageSubLayerDensity::bUseLayerMap' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, LayerMap) == 0x000020, "Member 'FFoliageSubLayerDensity::LayerMap' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, bUseVarietyMap) == 0x000038, "Member 'FFoliageSubLayerDensity::bUseVarietyMap' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, VarietyMap) == 0x000040, "Member 'FFoliageSubLayerDensity::VarietyMap' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, bDisabled) == 0x000050, "Member 'FFoliageSubLayerDensity::bDisabled' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, bHidden) == 0x000051, "Member 'FFoliageSubLayerDensity::bHidden' has a wrong offset!");
static_assert(offsetof(FFoliageSubLayerDensity, FoliageVarieties) == 0x000058, "Member 'FFoliageSubLayerDensity::FoliageVarieties' has a wrong offset!");

// ScriptStruct Landscape.FoliageLayerDensity
// 0x0010 (0x0010 - 0x0000)
struct FFoliageLayerDensity final
{
public:
