#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelBookmarks

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "LevelBookmarks_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LevelBookmarks.JiraBookmarksFlag
// 0x0028 (0x02C0 - 0x0298)
class AJiraBookmarksFlag : public AActor
{
public:
	class UWidgetComponent*                       WidgetComponent;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SceneComponent;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JiraBookmarksFlag">();
	}
	static class AJiraBookmarksFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJiraBookmarksFlag>();
	}
};
static_assert(alignof(AJiraBookmarksFlag) == 0x000008, "Wrong alignment on AJiraBookmarksFlag");
static_assert(sizeof(AJiraBookmarksFlag) == 0x0002C0, "Wrong size on AJiraBookmarksFlag");
static_assert(offsetof(AJiraBookmarksFlag, WidgetComponent) == 0x000298, "Member 'AJiraBookmarksFlag::WidgetComponent' has a wrong offset!");
static_assert(offsetof(AJiraBookmarksFlag, SceneComponent) == 0x0002A0, "Member 'AJiraBookmarksFlag::SceneComponent' has a wrong offset!");

// Class LevelBookmarks.JiraBookmarksFlagWidget
// 0x0080 (0x02F8 - 0x0278)
class UJiraBookmarksFlagWidget : public UUserWidget
{
public:
	class FText                                   IssueID;                                           // 0x0278(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   IssuePriority;                                     // 0x0290(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   IssueVersion;                                      // 0x02A8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   IssueDescription;                                  // 0x02C0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   IssueSummary;                                      // 0x02D8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FColor                                 IssueColor;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JiraBookmarksFlagWidget">();
	}
	static class UJiraBookmarksFlagWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJiraBookmarksFlagWidget>();
	}
};
static_assert(alignof(UJiraBookmarksFlagWidget) == 0x000008, "Wrong alignment on UJiraBookmarksFlagWidget");
static_assert(sizeof(UJiraBookmarksFlagWidget) == 0x0002F8, "Wrong size on UJiraBookmarksFlagWidget");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssueID) == 0x000278, "Member 'UJiraBookmarksFlagWidget::IssueID' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssuePriority) == 0x000290, "Member 'UJiraBookmarksFlagWidget::IssuePriority' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssueVersion) == 0x0002A8, "Member 'UJiraBookmarksFlagWidget::IssueVersion' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssueDescription) == 0x0002C0, "Member 'UJiraBookmarksFlagWidget::IssueDescription' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssueSummary) == 0x0002D8, "Member 'UJiraBookmarksFlagWidget::IssueSummary' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksFlagWidget, IssueColor) == 0x0002F0, "Member 'UJiraBookmarksFlagWidget::IssueColor' has a wrong offset!");

// Class LevelBookmarks.JiraBookmarksSettings
// 0x0058 (0x0090 - 0x0038)
class UJiraBookmarksSettings final : public UDeveloperSettings
{
public:
	int32                                         LevelDesignIssueComponent;                         // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BugIssueType;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocationCustomField;                               // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamCustomFieldID;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JiraBookmarksDefaultTeam;                          // 0x0048(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIssueStatuses                         IssueStatuses;                                     // 0x0050(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint32                                        ReopenTransitionID;                                // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CloseTransitionID;                                 // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InvestigationNeededCustomField;                    // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InvestigationNeededDefaultValue;                   // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ExpectedResultCustomField;                         // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExpectedResultDefaultValue;                        // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JiraBookmarksSettings">();
	}
	static class UJiraBookmarksSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJiraBookmarksSettings>();
	}
};
static_assert(alignof(UJiraBookmarksSettings) == 0x000008, "Wrong alignment on UJiraBookmarksSettings");
static_assert(sizeof(UJiraBookmarksSettings) == 0x000090, "Wrong size on UJiraBookmarksSettings");
static_assert(offsetof(UJiraBookmarksSettings, LevelDesignIssueComponent) == 0x000038, "Member 'UJiraBookmarksSettings::LevelDesignIssueComponent' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, BugIssueType) == 0x00003C, "Member 'UJiraBookmarksSettings::BugIssueType' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, LocationCustomField) == 0x000040, "Member 'UJiraBookmarksSettings::LocationCustomField' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, TeamCustomFieldID) == 0x000044, "Member 'UJiraBookmarksSettings::TeamCustomFieldID' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, JiraBookmarksDefaultTeam) == 0x000048, "Member 'UJiraBookmarksSettings::JiraBookmarksDefaultTeam' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, IssueStatuses) == 0x000050, "Member 'UJiraBookmarksSettings::IssueStatuses' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, ReopenTransitionID) == 0x00005C, "Member 'UJiraBookmarksSettings::ReopenTransitionID' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, CloseTransitionID) == 0x000060, "Member 'UJiraBookmarksSettings::CloseTransitionID' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, InvestigationNeededCustomField) == 0x000064, "Member 'UJiraBookmarksSettings::InvestigationNeededCustomField' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, InvestigationNeededDefaultValue) == 0x000068, "Member 'UJiraBookmarksSettings::InvestigationNeededDefaultValue' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, ExpectedResultCustomField) == 0x000078, "Member 'UJiraBookmarksSettings::ExpectedResultCustomField' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSettings, ExpectedResultDefaultValue) == 0x000080, "Member 'UJiraBookmarksSettings::ExpectedResultDefaultValue' has a wrong offset!");

// Class LevelBookmarks.JiraBookmarksSubsystem
// 0x00E8 (0x0118 - 0x0030)
class UJiraBookmarksSubsystem final : public UWorldSubsystem
{
public:
	class FName                                   CurrentUserID;                                     // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserMail;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    FlagClass;                                         // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x70];                                      // 0x00A8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JiraBookmarksSubsystem">();
	}
	static class UJiraBookmarksSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJiraBookmarksSubsystem>();
	}
};
static_assert(alignof(UJiraBookmarksSubsystem) == 0x000008, "Wrong alignment on UJiraBookmarksSubsystem");
static_assert(sizeof(UJiraBookmarksSubsystem) == 0x000118, "Wrong size on UJiraBookmarksSubsystem");
static_assert(offsetof(UJiraBookmarksSubsystem, CurrentUserID) == 0x000030, "Member 'UJiraBookmarksSubsystem::CurrentUserID' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSubsystem, UserMail) == 0x000038, "Member 'UJiraBookmarksSubsystem::UserMail' has a wrong offset!");
static_assert(offsetof(UJiraBookmarksSubsystem, FlagClass) == 0x0000A0, "Member 'UJiraBookmarksSubsystem::FlagClass' has a wrong offset!");

// Class LevelBookmarks.LevelBookmarksSettings
// 0x0040 (0x0068 - 0x0028)
class ULevelBookmarksSettings final : public UObject
{
public:
	struct FDirectoryPath                         PathToRepository;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SuperUserNames;                                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         JiraBookmarkFlagActor;                             // 0x0048(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelBookmarksSettings">();
	}
	static class ULevelBookmarksSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelBookmarksSettings>();
	}
};
static_assert(alignof(ULevelBookmarksSettings) == 0x000008, "Wrong alignment on ULevelBookmarksSettings");
static_assert(sizeof(ULevelBookmarksSettings) == 0x000068, "Wrong size on ULevelBookmarksSettings");
static_assert(offsetof(ULevelBookmarksSettings, PathToRepository) == 0x000028, "Member 'ULevelBookmarksSettings::PathToRepository' has a wrong offset!");
static_assert(offsetof(ULevelBookmarksSettings, SuperUserNames) == 0x000038, "Member 'ULevelBookmarksSettings::SuperUserNames' has a wrong offset!");
static_assert(offsetof(ULevelBookmarksSettings, JiraBookmarkFlagActor) == 0x000048, "Member 'ULevelBookmarksSettings::JiraBookmarkFlagActor' has a wrong offset!");

}

