#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelBookmarks

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct LevelBookmarks.IssueStatuses
// 0x000C (0x000C - 0x0000)
struct FIssueStatuses final
{
public:
	int32                                         ToDo;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Reopened;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Backlog;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIssueStatuses) == 0x000004, "Wrong alignment on FIssueStatuses");
static_assert(sizeof(FIssueStatuses) == 0x00000C, "Wrong size on FIssueStatuses");
static_assert(offsetof(FIssueStatuses, ToDo) == 0x000000, "Member 'FIssueStatuses::ToDo' has a wrong offset!");
static_assert(offsetof(FIssueStatuses, Reopened) == 0x000004, "Member 'FIssueStatuses::Reopened' has a wrong offset!");
static_assert(offsetof(FIssueStatuses, Backlog) == 0x000008, "Member 'FIssueStatuses::Backlog' has a wrong offset!");

}

