#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Modio.EModioModServerSideStatus
// NumValues: 0x0004
enum class EModioModServerSideStatus : uint8
{
	NotAccepted                              = 0,
	Accepted                                 = 1,
	Deleted                                  = 3,
	EModioModServerSideStatus_MAX            = 4,
};

// Enum Modio.EModioVirusStatus
// NumValues: 0x0003
enum class EModioVirusStatus : uint8
{
	NoThreat                                 = 0,
	Malicious                                = 1,
	EModioVirusStatus_MAX                    = 2,
};

// Enum Modio.EModioVirusScanStatus
// NumValues: 0x0007
enum class EModioVirusScanStatus : uint8
{
	NotScanned                               = 0,
	ScanComplete                             = 1,
	InProgress                               = 2,
	TooLargeToScan                           = 3,
	FileNotFound                             = 4,
	ErrorScanning                            = 5,
	EModioVirusScanStatus_MAX                = 6,
};

// Enum Modio.EModioObjectVisibilityFlags
// NumValues: 0x0003
enum class EModioObjectVisibilityFlags : uint8
{
	Hidden                                   = 0,
	Public                                   = 1,
	EModioObjectVisibilityFlags_MAX          = 2,
};

// Enum Modio.EModioMaturityFlags
// NumValues: 0x0006
enum class EModioMaturityFlags : uint8
{
	None                                     = 0,
	Alcohol                                  = 1,
	Drugs                                    = 2,
	Violence                                 = 4,
	Explicit                                 = 8,
	EModioMaturityFlags_MAX                  = 9,
};

// Enum Modio.EModioModManagementEventType
// NumValues: 0x0009
enum class EModioModManagementEventType : uint8
{
	Installed                                = 0,
	Uninstalled                              = 1,
	Updated                                  = 2,
	Uploaded                                 = 3,
	BeginInstall                             = 4,
	BeginUninstall                           = 5,
	BeginUpdate                              = 6,
	BeginUpload                              = 7,
	EModioModManagementEventType_MAX         = 8,
};

// Enum Modio.EModioAuthenticationProvider
// NumValues: 0x000B
enum class EModioAuthenticationProvider : uint8
{
	XboxLive                                 = 0,
	Steam                                    = 1,
	GoG                                      = 2,
	Itch                                     = 3,
	Switch                                   = 4,
	Discord                                  = 5,
	PSN                                      = 6,
	Epic                                     = 7,
	Oculus                                   = 8,
	OpenID                                   = 9,
	EModioAuthenticationProvider_MAX         = 10,
};

// Enum Modio.EModioEnvironment
// NumValues: 0x0003
enum class EModioEnvironment : uint8
{
	Test                                     = 0,
	Live                                     = 1,
	EModioEnvironment_MAX                    = 2,
};

// Enum Modio.EModioPortal
// NumValues: 0x000B
enum class EModioPortal : uint8
{
	None                                     = 0,
	Apple                                    = 1,
	EpicGamesStore                           = 2,
	GOG                                      = 3,
	Google                                   = 4,
	Itchio                                   = 5,
	Nintendo                                 = 6,
	PSN                                      = 7,
	Steam                                    = 8,
	XboxLive                                 = 9,
	EModioPortal_MAX                         = 10,
};

// Enum Modio.EModioPlatformName
// NumValues: 0x000A
enum class EModioPlatformName : uint8
{
	Windows                                  = 0,
	Mac                                      = 1,
	Linux                                    = 2,
	PS4                                      = 3,
	PS5                                      = 4,
	XBoxOne                                  = 5,
	XSX                                      = 6,
	Switch                                   = 7,
	Unknown                                  = 8,
	EModioPlatformName_MAX                   = 9,
};

// Enum Modio.EModioModfilePlatform
// NumValues: 0x000D
enum class EModioModfilePlatform : uint8
{
	Windows                                  = 0,
	Mac                                      = 1,
	Linux                                    = 2,
	Android                                  = 3,
	iOS                                      = 4,
	XboxOne                                  = 5,
	XboxSeriesX                              = 6,
	PS4                                      = 7,
	PS5                                      = 8,
	Switch                                   = 9,
	Oculus                                   = 10,
	Source                                   = 11,
	EModioModfilePlatform_MAX                = 12,
};

// Enum Modio.EModioLogoSize
// NumValues: 0x0005
enum class EModioLogoSize : uint8
{
	Thumb320                                 = 0,
	Thumb640                                 = 1,
	Thumb1280                                = 2,
	Original                                 = 3,
	EModioLogoSize_MAX                       = 4,
};

// Enum Modio.EModioAvatarSize
// NumValues: 0x0004
enum class EModioAvatarSize : uint8
{
	Original                                 = 0,
	Thumb50                                  = 1,
	Thumb100                                 = 2,
	EModioAvatarSize_MAX                     = 3,
};

// Enum Modio.EModioGallerySize
// NumValues: 0x0004
enum class EModioGallerySize : uint8
{
	Original                                 = 0,
	Thumb320                                 = 1,
	Thumb1280                                = 2,
	EModioGallerySize_MAX                    = 3,
};

// Enum Modio.EModioLogLevel
// NumValues: 0x0005
enum class EModioLogLevel : uint8
{
	Trace                                    = 0,
	Info                                     = 1,
	Warning                                  = 2,
	Error                                    = 3,
	EModioLogLevel_MAX                       = 4,
};

// Enum Modio.EModioLanguage
// NumValues: 0x0010
enum class EModioLanguage : uint8
{
	English                                  = 0,
	Bulgarian                                = 1,
	French                                   = 2,
	German                                   = 3,
	Italian                                  = 4,
	Polish                                   = 5,
	Portuguese                               = 6,
	Hungarian                                = 7,
	Japanese                                 = 8,
	Korean                                   = 9,
	Russian                                  = 10,
	Spanish                                  = 11,
	Thai                                     = 12,
	ChineseSimplified                        = 13,
	ChineseTraditional                       = 14,
	EModioLanguage_MAX                       = 15,
};

// Enum Modio.EModioModChangeType
// NumValues: 0x0004
enum class EModioModChangeType : uint8
{
	Added                                    = 0,
	Removed                                  = 1,
	Updated                                  = 2,
	EModioModChangeType_MAX                  = 3,
};

// Enum Modio.EModioErrorCondition
// NumValues: 0x0018
enum class EModioErrorCondition : uint8
{
	NoError                                  = 0,
	NetworkError                             = 2,
	ConfigurationError                       = 3,
	InvalidArgsError                         = 4,
	FilesystemError                          = 5,
	InternalError                            = 6,
	ApiErrorRefSuccess                       = 7,
	EntityNotFoundError                      = 12,
	UserTermsOfUseError                      = 13,
	SubmitReportError                        = 14,
	UserNotAuthenticatedError                = 15,
	SDKNotInitialized                        = 16,
	UserAlreadyAuthenticatedError            = 17,
	SystemError                              = 18,
	OperationCanceled                        = 19,
	ModManagementDisabled                    = 20,
	RateLimited                              = 21,
	ModBeingProcessed                        = 22,
	InsufficientSpace                        = 23,
	SDKAlreadyInitialized                    = 24,
	ModManagementAlreadyEnabled              = 25,
	InsufficientPermissions                  = 26,
	EmailLoginCodeInvalid                    = 27,
	EModioErrorCondition_MAX                 = 28,
};

// Enum Modio.EModioSortFieldType
// NumValues: 0x0008
enum class EModioSortFieldType : uint8
{
	ID                                       = 0,
	DownloadsToday                           = 1,
	SubscriberCount                          = 2,
	Rating                                   = 3,
	DateMarkedLive                           = 4,
	DateUpdated                              = 5,
	DownloadsTotal                           = 6,
	EModioSortFieldType_MAX                  = 7,
};

// Enum Modio.EModioSortDirection
// NumValues: 0x0003
enum class EModioSortDirection : uint8
{
	Ascending                                = 0,
	Descending                               = 1,
	EModioSortDirection_MAX                  = 2,
};

// Enum Modio.EModioRevenueFilterType
// NumValues: 0x0004
enum class EModioRevenueFilterType : uint8
{
	Free                                     = 0,
	Paid                                     = 1,
	FreeAndPaid                              = 2,
	EModioRevenueFilterType_MAX              = 3,
};

// Enum Modio.EGameMonetizationFlags
// NumValues: 0x0005
enum class EGameMonetizationFlags : uint8
{
	None                                     = 0,
	Monetization                             = 1,
	Marketplace                              = 2,
	PartnerProgram                           = 4,
	EGameMonetizationFlags_MAX               = 5,
};

// Enum Modio.EModioImageState
// NumValues: 0x0005
enum class EModioImageState : uint8
{
	OnDisc                                   = 0,
	LoadingIntoMemory                        = 1,
	InMemory                                 = 2,
	Corrupted                                = 3,
	EModioImageState_MAX                     = 4,
};

// Enum Modio.EModioModState
// NumValues: 0x0007
enum class EModioModState : uint8
{
	InstallationPending                      = 0,
	Installed                                = 1,
	UpdatePending                            = 2,
	Downloading                              = 3,
	Extracting                               = 4,
	UninstallPending                         = 5,
	EModioModState_MAX                       = 6,
};

// Enum Modio.EModioModProgressState
// NumValues: 0x0006
enum class EModioModProgressState : uint8
{
	Initializing                             = 0,
	Downloading                              = 1,
	Extracting                               = 2,
	Compressing                              = 3,
	Uploading                                = 4,
	EModioModProgressState_MAX               = 5,
};

// Enum Modio.EModioRating
// NumValues: 0x0004
enum class EModioRating : uint8
{
	Neutral                                  = 0,
	Positive                                 = 1,
	Negative                                 = 2,
	EModioRating_MAX                         = 3,
};

// Enum Modio.EModioReportType
// NumValues: 0x0009
enum class EModioReportType : uint8
{
	Generic                                  = 0,
	DMCA                                     = 1,
	NotWorking                               = 2,
	RudeContent                              = 3,
	IllegalContent                           = 4,
	StolenContent                            = 5,
	FalseInformation                         = 6,
	Other                                    = 7,
	EModioReportType_MAX                     = 8,
};

// Enum Modio.EFileSizeUnit
// NumValues: 0x0006
enum class EFileSizeUnit : uint8
{
	Largest                                  = 0,
	B                                        = 1,
	KB                                       = 1024,
	MB                                       = 1048576,
	GB                                       = 1073741824,
	EFileSizeUnit_MAX                        = 1073741825,
};

// ScriptStruct Modio.ModioFileMetadataID
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FModioFileMetadataID final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioFileMetadataID) == 0x000008, "Wrong alignment on FModioFileMetadataID");
static_assert(sizeof(FModioFileMetadataID) == 0x000008, "Wrong size on FModioFileMetadataID");

// ScriptStruct Modio.ModioModID
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FModioModID final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioModID) == 0x000008, "Wrong alignment on FModioModID");
static_assert(sizeof(FModioModID) == 0x000008, "Wrong size on FModioModID");

// ScriptStruct Modio.ModioFileMetadata
// 0x0068 (0x0068 - 0x0000)
struct FModioFileMetadata final
{
public:
	struct FModioFileMetadataID                   MetadataId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioModID                            ModId;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DateAdded;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioVirusScanStatus                         CurrentVirusScanStatus;                            // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioVirusStatus                             CurrentVirusStatus;                                // 0x0019(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Filesize;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Changelog;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MetadataBlob;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioFileMetadata) == 0x000008, "Wrong alignment on FModioFileMetadata");
static_assert(sizeof(FModioFileMetadata) == 0x000068, "Wrong size on FModioFileMetadata");
static_assert(offsetof(FModioFileMetadata, MetadataId) == 0x000000, "Member 'FModioFileMetadata::MetadataId' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, ModId) == 0x000008, "Member 'FModioFileMetadata::ModId' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, DateAdded) == 0x000010, "Member 'FModioFileMetadata::DateAdded' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, CurrentVirusScanStatus) == 0x000018, "Member 'FModioFileMetadata::CurrentVirusScanStatus' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, CurrentVirusStatus) == 0x000019, "Member 'FModioFileMetadata::CurrentVirusStatus' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, Filesize) == 0x000020, "Member 'FModioFileMetadata::Filesize' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, Filename) == 0x000028, "Member 'FModioFileMetadata::Filename' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, Version) == 0x000038, "Member 'FModioFileMetadata::Version' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, Changelog) == 0x000048, "Member 'FModioFileMetadata::Changelog' has a wrong offset!");
static_assert(offsetof(FModioFileMetadata, MetadataBlob) == 0x000058, "Member 'FModioFileMetadata::MetadataBlob' has a wrong offset!");

// ScriptStruct Modio.ModioEntitlementParams
// 0x0050 (0x0050 - 0x0000)
struct FModioEntitlementParams final
{
public:
	TMap<class FString, class FString>            ExtendedParameters;                                // 0x0000(0x0050)(Edit, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FModioEntitlementParams) == 0x000008, "Wrong alignment on FModioEntitlementParams");
static_assert(sizeof(FModioEntitlementParams) == 0x000050, "Wrong size on FModioEntitlementParams");
static_assert(offsetof(FModioEntitlementParams, ExtendedParameters) == 0x000000, "Member 'FModioEntitlementParams::ExtendedParameters' has a wrong offset!");

// ScriptStruct Modio.ModioPagedResult
// 0x0014 (0x0014 - 0x0000)
struct FModioPagedResult final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PageSize;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PageCount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TotalResultCount;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ResultCount;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FModioPagedResult) == 0x000004, "Wrong alignment on FModioPagedResult");
static_assert(sizeof(FModioPagedResult) == 0x000014, "Wrong size on FModioPagedResult");
static_assert(offsetof(FModioPagedResult, PageIndex) == 0x000000, "Member 'FModioPagedResult::PageIndex' has a wrong offset!");
static_assert(offsetof(FModioPagedResult, PageSize) == 0x000004, "Member 'FModioPagedResult::PageSize' has a wrong offset!");
static_assert(offsetof(FModioPagedResult, PageCount) == 0x000008, "Member 'FModioPagedResult::PageCount' has a wrong offset!");
static_assert(offsetof(FModioPagedResult, TotalResultCount) == 0x00000C, "Member 'FModioPagedResult::TotalResultCount' has a wrong offset!");
static_assert(offsetof(FModioPagedResult, ResultCount) == 0x000010, "Member 'FModioPagedResult::ResultCount' has a wrong offset!");

// ScriptStruct Modio.ModioModStats
// 0x0058 (0x0058 - 0x0000)
struct FModioModStats final
{
public:
	int64                                         PopularityRankPosition;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         PopularityRankTotalMods;                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DownloadsTotal;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SubscribersTotal;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RatingTotal;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RatingPositive;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RatingNegative;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RatingPercentagePositive;                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RatingWeightedAggregate;                           // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RatingDisplayText;                                 // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModStats) == 0x000008, "Wrong alignment on FModioModStats");
static_assert(sizeof(FModioModStats) == 0x000058, "Wrong size on FModioModStats");
static_assert(offsetof(FModioModStats, PopularityRankPosition) == 0x000000, "Member 'FModioModStats::PopularityRankPosition' has a wrong offset!");
static_assert(offsetof(FModioModStats, PopularityRankTotalMods) == 0x000008, "Member 'FModioModStats::PopularityRankTotalMods' has a wrong offset!");
static_assert(offsetof(FModioModStats, DownloadsTotal) == 0x000010, "Member 'FModioModStats::DownloadsTotal' has a wrong offset!");
static_assert(offsetof(FModioModStats, SubscribersTotal) == 0x000018, "Member 'FModioModStats::SubscribersTotal' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingTotal) == 0x000020, "Member 'FModioModStats::RatingTotal' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingPositive) == 0x000028, "Member 'FModioModStats::RatingPositive' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingNegative) == 0x000030, "Member 'FModioModStats::RatingNegative' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingPercentagePositive) == 0x000038, "Member 'FModioModStats::RatingPercentagePositive' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingWeightedAggregate) == 0x000040, "Member 'FModioModStats::RatingWeightedAggregate' has a wrong offset!");
static_assert(offsetof(FModioModStats, RatingDisplayText) == 0x000048, "Member 'FModioModStats::RatingDisplayText' has a wrong offset!");

// ScriptStruct Modio.ModioUserID
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FModioUserID final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioUserID) == 0x000008, "Wrong alignment on FModioUserID");
static_assert(sizeof(FModioUserID) == 0x000008, "Wrong size on FModioUserID");

// ScriptStruct Modio.ModioUser
// 0x0040 (0x0040 - 0x0000)
struct FModioUser final
{
public:
	struct FModioUserID                           userId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 username;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DateOnline;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileUrl;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayNamePortal;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioUser) == 0x000008, "Wrong alignment on FModioUser");
static_assert(sizeof(FModioUser) == 0x000040, "Wrong size on FModioUser");
static_assert(offsetof(FModioUser, userId) == 0x000000, "Member 'FModioUser::userId' has a wrong offset!");
static_assert(offsetof(FModioUser, username) == 0x000008, "Member 'FModioUser::username' has a wrong offset!");
static_assert(offsetof(FModioUser, DateOnline) == 0x000018, "Member 'FModioUser::DateOnline' has a wrong offset!");
static_assert(offsetof(FModioUser, ProfileUrl) == 0x000020, "Member 'FModioUser::ProfileUrl' has a wrong offset!");
static_assert(offsetof(FModioUser, DisplayNamePortal) == 0x000030, "Member 'FModioUser::DisplayNamePortal' has a wrong offset!");

// ScriptStruct Modio.ModioMetadata
// 0x0020 (0x0020 - 0x0000)
struct FModioMetadata final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioMetadata) == 0x000008, "Wrong alignment on FModioMetadata");
static_assert(sizeof(FModioMetadata) == 0x000020, "Wrong size on FModioMetadata");
static_assert(offsetof(FModioMetadata, Key) == 0x000000, "Member 'FModioMetadata::Key' has a wrong offset!");
static_assert(offsetof(FModioMetadata, Value) == 0x000010, "Member 'FModioMetadata::Value' has a wrong offset!");

// ScriptStruct Modio.ModioModTag
// 0x0010 (0x0010 - 0x0000)
struct FModioModTag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModTag) == 0x000008, "Wrong alignment on FModioModTag");
static_assert(sizeof(FModioModTag) == 0x000010, "Wrong size on FModioModTag");
static_assert(offsetof(FModioModTag, Tag) == 0x000000, "Member 'FModioModTag::Tag' has a wrong offset!");

// ScriptStruct Modio.ModioYoutubeURLList
// 0x0001 (0x0001 - 0x0000)
struct FModioYoutubeURLList final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioYoutubeURLList) == 0x000001, "Wrong alignment on FModioYoutubeURLList");
static_assert(sizeof(FModioYoutubeURLList) == 0x000001, "Wrong size on FModioYoutubeURLList");

// ScriptStruct Modio.ModioSketchfabURLList
// 0x0001 (0x0001 - 0x0000)
struct FModioSketchfabURLList final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioSketchfabURLList) == 0x000001, "Wrong alignment on FModioSketchfabURLList");
static_assert(sizeof(FModioSketchfabURLList) == 0x000001, "Wrong size on FModioSketchfabURLList");

// ScriptStruct Modio.ModioModInfo
// 0x01E0 (0x01E0 - 0x0000)
struct FModioModInfo final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Supported;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProfileName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileSummary;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileDescription;                                // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileDescriptionPlaintext;                       // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileUrl;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioUser                             ProfileSubmittedBy;                                // 0x0060(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	struct FDateTime                              ProfileDateAdded;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ProfileDateUpdated;                                // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ProfileDateLive;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioMaturityFlags                           ProfileMaturityOption;                             // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x00B9(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioObjectVisibilityFlags                   Visibility;                                        // 0x00BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MetadataBlob;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioFileMetadata                     FileInfo;                                          // 0x00D0(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TArray<struct FModioMetadata>                 MetadataKvp;                                       // 0x0138(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TArray<struct FModioModTag>                   Tags;                                              // 0x0148(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	int32                                         NumGalleryImages;                                  // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioYoutubeURLList                   YoutubeURLs;                                       // 0x0160(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0xF];                                      // 0x0161(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioSketchfabURLList                 SketchfabURLs;                                     // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioModStats                         Stats;                                             // 0x0180(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	EModioModServerSideStatus                     ModStatus;                                         // 0x01D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price;                                             // 0x01DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModInfo) == 0x000008, "Wrong alignment on FModioModInfo");
static_assert(sizeof(FModioModInfo) == 0x0001E0, "Wrong size on FModioModInfo");
static_assert(offsetof(FModioModInfo, ModId) == 0x000000, "Member 'FModioModInfo::ModId' has a wrong offset!");
static_assert(offsetof(FModioModInfo, Supported) == 0x000008, "Member 'FModioModInfo::Supported' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileName) == 0x000010, "Member 'FModioModInfo::ProfileName' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileSummary) == 0x000020, "Member 'FModioModInfo::ProfileSummary' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileDescription) == 0x000030, "Member 'FModioModInfo::ProfileDescription' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileDescriptionPlaintext) == 0x000040, "Member 'FModioModInfo::ProfileDescriptionPlaintext' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileUrl) == 0x000050, "Member 'FModioModInfo::ProfileUrl' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileSubmittedBy) == 0x000060, "Member 'FModioModInfo::ProfileSubmittedBy' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileDateAdded) == 0x0000A0, "Member 'FModioModInfo::ProfileDateAdded' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileDateUpdated) == 0x0000A8, "Member 'FModioModInfo::ProfileDateUpdated' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileDateLive) == 0x0000B0, "Member 'FModioModInfo::ProfileDateLive' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ProfileMaturityOption) == 0x0000B8, "Member 'FModioModInfo::ProfileMaturityOption' has a wrong offset!");
static_assert(offsetof(FModioModInfo, bVisible) == 0x0000B9, "Member 'FModioModInfo::bVisible' has a wrong offset!");
static_assert(offsetof(FModioModInfo, Visibility) == 0x0000BA, "Member 'FModioModInfo::Visibility' has a wrong offset!");
static_assert(offsetof(FModioModInfo, MetadataBlob) == 0x0000C0, "Member 'FModioModInfo::MetadataBlob' has a wrong offset!");
static_assert(offsetof(FModioModInfo, FileInfo) == 0x0000D0, "Member 'FModioModInfo::FileInfo' has a wrong offset!");
static_assert(offsetof(FModioModInfo, MetadataKvp) == 0x000138, "Member 'FModioModInfo::MetadataKvp' has a wrong offset!");
static_assert(offsetof(FModioModInfo, Tags) == 0x000148, "Member 'FModioModInfo::Tags' has a wrong offset!");
static_assert(offsetof(FModioModInfo, NumGalleryImages) == 0x000158, "Member 'FModioModInfo::NumGalleryImages' has a wrong offset!");
static_assert(offsetof(FModioModInfo, YoutubeURLs) == 0x000160, "Member 'FModioModInfo::YoutubeURLs' has a wrong offset!");
static_assert(offsetof(FModioModInfo, SketchfabURLs) == 0x000170, "Member 'FModioModInfo::SketchfabURLs' has a wrong offset!");
static_assert(offsetof(FModioModInfo, Stats) == 0x000180, "Member 'FModioModInfo::Stats' has a wrong offset!");
static_assert(offsetof(FModioModInfo, ModStatus) == 0x0001D8, "Member 'FModioModInfo::ModStatus' has a wrong offset!");
static_assert(offsetof(FModioModInfo, Price) == 0x0001DC, "Member 'FModioModInfo::Price' has a wrong offset!");

// ScriptStruct Modio.ModioModInfoList
// 0x0028 (0x0028 - 0x0000)
struct FModioModInfoList final
{
public:
	struct FModioPagedResult                      PagedResult;                                       // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModioModInfo>                  InternalList;                                      // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModInfoList) == 0x000008, "Wrong alignment on FModioModInfoList");
static_assert(sizeof(FModioModInfoList) == 0x000028, "Wrong size on FModioModInfoList");
static_assert(offsetof(FModioModInfoList, PagedResult) == 0x000000, "Member 'FModioModInfoList::PagedResult' has a wrong offset!");
static_assert(offsetof(FModioModInfoList, InternalList) == 0x000018, "Member 'FModioModInfoList::InternalList' has a wrong offset!");

// ScriptStruct Modio.ModioFilterParams
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FModioFilterParams final
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioFilterParams) == 0x000008, "Wrong alignment on FModioFilterParams");
static_assert(sizeof(FModioFilterParams) == 0x0000A8, "Wrong size on FModioFilterParams");

// ScriptStruct Modio.ModioModTagInfo
// 0x0028 (0x0028 - 0x0000)
struct FModioModTagInfo final
{
public:
	class FString                                 TagGroupName;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TagGroupValues;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          bAllowMultipleSelection;                           // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioModTagInfo) == 0x000008, "Wrong alignment on FModioModTagInfo");
static_assert(sizeof(FModioModTagInfo) == 0x000028, "Wrong size on FModioModTagInfo");
static_assert(offsetof(FModioModTagInfo, TagGroupName) == 0x000000, "Member 'FModioModTagInfo::TagGroupName' has a wrong offset!");
static_assert(offsetof(FModioModTagInfo, TagGroupValues) == 0x000010, "Member 'FModioModTagInfo::TagGroupValues' has a wrong offset!");
static_assert(offsetof(FModioModTagInfo, bAllowMultipleSelection) == 0x000020, "Member 'FModioModTagInfo::bAllowMultipleSelection' has a wrong offset!");

// ScriptStruct Modio.ModioModTagOptions
// 0x0028 (0x0028 - 0x0000)
struct FModioModTagOptions final
{
public:
	struct FModioPagedResult                      PagedResult;                                       // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModioModTagInfo>               InternalList;                                      // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModTagOptions) == 0x000008, "Wrong alignment on FModioModTagOptions");
static_assert(sizeof(FModioModTagOptions) == 0x000028, "Wrong size on FModioModTagOptions");
static_assert(offsetof(FModioModTagOptions, PagedResult) == 0x000000, "Member 'FModioModTagOptions::PagedResult' has a wrong offset!");
static_assert(offsetof(FModioModTagOptions, InternalList) == 0x000018, "Member 'FModioModTagOptions::InternalList' has a wrong offset!");

// ScriptStruct Modio.ModioErrorCode
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FModioErrorCode final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioErrorCode) == 0x000008, "Wrong alignment on FModioErrorCode");
static_assert(sizeof(FModioErrorCode) == 0x000008, "Wrong size on FModioErrorCode");

// ScriptStruct Modio.ModioOptionalGameInfo
// 0x0228 (0x0228 - 0x0000)
struct alignas(0x08) FModioOptionalGameInfo final
{
public:
	uint8                                         Pad_0[0x228];                                      // 0x0000(0x0228)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalGameInfo) == 0x000008, "Wrong alignment on FModioOptionalGameInfo");
static_assert(sizeof(FModioOptionalGameInfo) == 0x000228, "Wrong size on FModioOptionalGameInfo");

// ScriptStruct Modio.ModioOptionalImage
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FModioOptionalImage final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalImage) == 0x000008, "Wrong alignment on FModioOptionalImage");
static_assert(sizeof(FModioOptionalImage) == 0x000018, "Wrong size on FModioOptionalImage");

// ScriptStruct Modio.ModioOptionalTransactionRecord
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FModioOptionalTransactionRecord final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalTransactionRecord) == 0x000008, "Wrong alignment on FModioOptionalTransactionRecord");
static_assert(sizeof(FModioOptionalTransactionRecord) == 0x000020, "Wrong size on FModioOptionalTransactionRecord");

// ScriptStruct Modio.ModioOptionalModDependencyList
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FModioOptionalModDependencyList final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalModDependencyList) == 0x000008, "Wrong alignment on FModioOptionalModDependencyList");
static_assert(sizeof(FModioOptionalModDependencyList) == 0x000030, "Wrong size on FModioOptionalModDependencyList");

// ScriptStruct Modio.ModioOptionalModInfo
// 0x01E8 (0x01E8 - 0x0000)
struct alignas(0x08) FModioOptionalModInfo final
{
public:
	uint8                                         Pad_0[0x1E8];                                      // 0x0000(0x01E8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalModInfo) == 0x000008, "Wrong alignment on FModioOptionalModInfo");
static_assert(sizeof(FModioOptionalModInfo) == 0x0001E8, "Wrong size on FModioOptionalModInfo");

// ScriptStruct Modio.ModioOptionalModTagOptions
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FModioOptionalModTagOptions final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalModTagOptions) == 0x000008, "Wrong alignment on FModioOptionalModTagOptions");
static_assert(sizeof(FModioOptionalModTagOptions) == 0x000030, "Wrong size on FModioOptionalModTagOptions");

// ScriptStruct Modio.ModioUserList
// 0x0028 (0x0028 - 0x0000)
struct FModioUserList final
{
public:
	struct FModioPagedResult                      PagedResult;                                       // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModioUser>                     InternalList;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioUserList) == 0x000008, "Wrong alignment on FModioUserList");
static_assert(sizeof(FModioUserList) == 0x000028, "Wrong size on FModioUserList");
static_assert(offsetof(FModioUserList, PagedResult) == 0x000000, "Member 'FModioUserList::PagedResult' has a wrong offset!");
static_assert(offsetof(FModioUserList, InternalList) == 0x000018, "Member 'FModioUserList::InternalList' has a wrong offset!");

// ScriptStruct Modio.ModioOptionalTerms
// 0x00D8 (0x00D8 - 0x0000)
struct alignas(0x08) FModioOptionalTerms final
{
public:
	uint8                                         Pad_0[0xD8];                                       // 0x0000(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalTerms) == 0x000008, "Wrong alignment on FModioOptionalTerms");
static_assert(sizeof(FModioOptionalTerms) == 0x0000D8, "Wrong size on FModioOptionalTerms");

// ScriptStruct Modio.ModioModCollectionEntry
// 0x0218 (0x0218 - 0x0000)
struct alignas(0x08) FModioModCollectionEntry final
{
public:
	uint8                                         Pad_0[0x218];                                      // 0x0000(0x0218)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioModCollectionEntry) == 0x000008, "Wrong alignment on FModioModCollectionEntry");
static_assert(sizeof(FModioModCollectionEntry) == 0x000218, "Wrong size on FModioModCollectionEntry");

// ScriptStruct Modio.ModioOptionalModInfoList
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FModioOptionalModInfoList final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalModInfoList) == 0x000008, "Wrong alignment on FModioOptionalModInfoList");
static_assert(sizeof(FModioOptionalModInfoList) == 0x000030, "Wrong size on FModioOptionalModInfoList");

// ScriptStruct Modio.ModioModManagementEvent
// 0x0018 (0x0018 - 0x0000)
struct FModioModManagementEvent final
{
public:
	struct FModioModID                            ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioModManagementEventType                  Event;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioErrorCode                        Status;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioModManagementEvent) == 0x000008, "Wrong alignment on FModioModManagementEvent");
static_assert(sizeof(FModioModManagementEvent) == 0x000018, "Wrong size on FModioModManagementEvent");
static_assert(offsetof(FModioModManagementEvent, ID) == 0x000000, "Member 'FModioModManagementEvent::ID' has a wrong offset!");
static_assert(offsetof(FModioModManagementEvent, Event) == 0x000008, "Member 'FModioModManagementEvent::Event' has a wrong offset!");
static_assert(offsetof(FModioModManagementEvent, Status) == 0x000010, "Member 'FModioModManagementEvent::Status' has a wrong offset!");

// ScriptStruct Modio.ModioModCreationHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FModioModCreationHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioModCreationHandle) == 0x000008, "Wrong alignment on FModioModCreationHandle");
static_assert(sizeof(FModioModCreationHandle) == 0x000008, "Wrong size on FModioModCreationHandle");

// ScriptStruct Modio.ModioOptionalUserList
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FModioOptionalUserList final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioOptionalUserList) == 0x000008, "Wrong alignment on FModioOptionalUserList");
static_assert(sizeof(FModioOptionalUserList) == 0x000030, "Wrong size on FModioOptionalUserList");

// ScriptStruct Modio.ModioGameID
// 0x0008 (0x0008 - 0x0000)
struct FModioGameID final
{
public:
	int64                                         GameId;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FModioGameID) == 0x000008, "Wrong alignment on FModioGameID");
static_assert(sizeof(FModioGameID) == 0x000008, "Wrong size on FModioGameID");
static_assert(offsetof(FModioGameID, GameId) == 0x000000, "Member 'FModioGameID::GameId' has a wrong offset!");

// ScriptStruct Modio.ModioIcon
// 0x0050 (0x0050 - 0x0000)
struct FModioIcon final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Original;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb64x64;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb128x128;                                      // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb256x256;                                      // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioIcon) == 0x000008, "Wrong alignment on FModioIcon");
static_assert(sizeof(FModioIcon) == 0x000050, "Wrong size on FModioIcon");
static_assert(offsetof(FModioIcon, Filename) == 0x000000, "Member 'FModioIcon::Filename' has a wrong offset!");
static_assert(offsetof(FModioIcon, Original) == 0x000010, "Member 'FModioIcon::Original' has a wrong offset!");
static_assert(offsetof(FModioIcon, Thumb64x64) == 0x000020, "Member 'FModioIcon::Thumb64x64' has a wrong offset!");
static_assert(offsetof(FModioIcon, Thumb128x128) == 0x000030, "Member 'FModioIcon::Thumb128x128' has a wrong offset!");
static_assert(offsetof(FModioIcon, Thumb256x256) == 0x000040, "Member 'FModioIcon::Thumb256x256' has a wrong offset!");

// ScriptStruct Modio.ModioLogo
// 0x0050 (0x0050 - 0x0000)
struct FModioLogo final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Original;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb320x180;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb640x360;                                      // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Thumb1280x720;                                     // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioLogo) == 0x000008, "Wrong alignment on FModioLogo");
static_assert(sizeof(FModioLogo) == 0x000050, "Wrong size on FModioLogo");
static_assert(offsetof(FModioLogo, Filename) == 0x000000, "Member 'FModioLogo::Filename' has a wrong offset!");
static_assert(offsetof(FModioLogo, Original) == 0x000010, "Member 'FModioLogo::Original' has a wrong offset!");
static_assert(offsetof(FModioLogo, Thumb320x180) == 0x000020, "Member 'FModioLogo::Thumb320x180' has a wrong offset!");
static_assert(offsetof(FModioLogo, Thumb640x360) == 0x000030, "Member 'FModioLogo::Thumb640x360' has a wrong offset!");
static_assert(offsetof(FModioLogo, Thumb1280x720) == 0x000040, "Member 'FModioLogo::Thumb1280x720' has a wrong offset!");

// ScriptStruct Modio.ModioHeaderImage
// 0x0020 (0x0020 - 0x0000)
struct FModioHeaderImage final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Original;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FModioHeaderImage) == 0x000008, "Wrong alignment on FModioHeaderImage");
static_assert(sizeof(FModioHeaderImage) == 0x000020, "Wrong size on FModioHeaderImage");
static_assert(offsetof(FModioHeaderImage, Filename) == 0x000000, "Member 'FModioHeaderImage::Filename' has a wrong offset!");
static_assert(offsetof(FModioHeaderImage, Original) == 0x000010, "Member 'FModioHeaderImage::Original' has a wrong offset!");

// ScriptStruct Modio.ModioTheme
// 0x0060 (0x0060 - 0x0000)
struct FModioTheme final
{
public:
	class FString                                 Primary;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Dark;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Light;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Success;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Warning;                                           // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
