#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Modio_structs.hpp"
#include "Engine_structs.hpp"
#include "ModioUI_structs.hpp"
#include "ModioUICore_structs.hpp"


namespace SDK::Params
{

// Function ModioUI.ModioCommonActivatableWidget.BP_ListenForInputAction
// 0x0040 (0x0040 - 0x0000)
struct ModioCommonActivatableWidget_BP_ListenForInputAction final
{
public:
	class UModioCommonButtonBase*                 Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    InputAction;                                       // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnActionFired;                                     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_BP_ListenForInputAction) == 0x000008, "Wrong alignment on ModioCommonActivatableWidget_BP_ListenForInputAction");
static_assert(sizeof(ModioCommonActivatableWidget_BP_ListenForInputAction) == 0x000040, "Wrong size on ModioCommonActivatableWidget_BP_ListenForInputAction");
static_assert(offsetof(ModioCommonActivatableWidget_BP_ListenForInputAction, Button) == 0x000000, "Member 'ModioCommonActivatableWidget_BP_ListenForInputAction::Button' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidget_BP_ListenForInputAction, InputAction) == 0x000008, "Member 'ModioCommonActivatableWidget_BP_ListenForInputAction::InputAction' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidget_BP_ListenForInputAction, DisplayName) == 0x000018, "Member 'ModioCommonActivatableWidget_BP_ListenForInputAction::DisplayName' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidget_BP_ListenForInputAction, OnActionFired) == 0x000030, "Member 'ModioCommonActivatableWidget_BP_ListenForInputAction::OnActionFired' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.ClearListeningInputAction
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonActivatableWidget_ClearListeningInputAction final
{
public:
	class UModioCommonButtonBase*                 Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_ClearListeningInputAction) == 0x000008, "Wrong alignment on ModioCommonActivatableWidget_ClearListeningInputAction");
static_assert(sizeof(ModioCommonActivatableWidget_ClearListeningInputAction) == 0x000008, "Wrong size on ModioCommonActivatableWidget_ClearListeningInputAction");
static_assert(offsetof(ModioCommonActivatableWidget_ClearListeningInputAction, Button) == 0x000000, "Member 'ModioCommonActivatableWidget_ClearListeningInputAction::Button' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.GetRequestIdentifier
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonActivatableWidget_GetRequestIdentifier final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_GetRequestIdentifier) == 0x000008, "Wrong alignment on ModioCommonActivatableWidget_GetRequestIdentifier");
static_assert(sizeof(ModioCommonActivatableWidget_GetRequestIdentifier) == 0x000010, "Wrong size on ModioCommonActivatableWidget_GetRequestIdentifier");
static_assert(offsetof(ModioCommonActivatableWidget_GetRequestIdentifier, ReturnValue) == 0x000000, "Member 'ModioCommonActivatableWidget_GetRequestIdentifier::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.OnViewportResized
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonActivatableWidget_OnViewportResized final
{
public:
	struct FVector2D                              NewViewportSize;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_OnViewportResized) == 0x000008, "Wrong alignment on ModioCommonActivatableWidget_OnViewportResized");
static_assert(sizeof(ModioCommonActivatableWidget_OnViewportResized) == 0x000010, "Wrong size on ModioCommonActivatableWidget_OnViewportResized");
static_assert(offsetof(ModioCommonActivatableWidget_OnViewportResized, NewViewportSize) == 0x000000, "Member 'ModioCommonActivatableWidget_OnViewportResized::NewViewportSize' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.SetDataSource
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonActivatableWidget_SetDataSource final
{
public:
	class UObject*                                NewDataSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_SetDataSource) == 0x000008, "Wrong alignment on ModioCommonActivatableWidget_SetDataSource");
static_assert(sizeof(ModioCommonActivatableWidget_SetDataSource) == 0x000008, "Wrong size on ModioCommonActivatableWidget_SetDataSource");
static_assert(offsetof(ModioCommonActivatableWidget_SetDataSource, NewDataSource) == 0x000000, "Member 'ModioCommonActivatableWidget_SetDataSource::NewDataSource' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.GetAutoBindInputAction
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonActivatableWidget_GetAutoBindInputAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_GetAutoBindInputAction) == 0x000001, "Wrong alignment on ModioCommonActivatableWidget_GetAutoBindInputAction");
static_assert(sizeof(ModioCommonActivatableWidget_GetAutoBindInputAction) == 0x000001, "Wrong size on ModioCommonActivatableWidget_GetAutoBindInputAction");
static_assert(offsetof(ModioCommonActivatableWidget_GetAutoBindInputAction, ReturnValue) == 0x000000, "Member 'ModioCommonActivatableWidget_GetAutoBindInputAction::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidget.GetAutoFocusOnActivation
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonActivatableWidget_GetAutoFocusOnActivation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidget_GetAutoFocusOnActivation) == 0x000001, "Wrong alignment on ModioCommonActivatableWidget_GetAutoFocusOnActivation");
static_assert(sizeof(ModioCommonActivatableWidget_GetAutoFocusOnActivation) == 0x000001, "Wrong size on ModioCommonActivatableWidget_GetAutoFocusOnActivation");
static_assert(offsetof(ModioCommonActivatableWidget_GetAutoFocusOnActivation, ReturnValue) == 0x000000, "Member 'ModioCommonActivatableWidget_GetAutoFocusOnActivation::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsViewBase.IsUserAuthenticated
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonModDetailsViewBase_IsUserAuthenticated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModDetailsViewBase_IsUserAuthenticated) == 0x000001, "Wrong alignment on ModioCommonModDetailsViewBase_IsUserAuthenticated");
static_assert(sizeof(ModioCommonModDetailsViewBase_IsUserAuthenticated) == 0x000001, "Wrong size on ModioCommonModDetailsViewBase_IsUserAuthenticated");
static_assert(offsetof(ModioCommonModDetailsViewBase_IsUserAuthenticated, ReturnValue) == 0x000000, "Member 'ModioCommonModDetailsViewBase_IsUserAuthenticated::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsView.OnRatingSubmissionComplete
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonModDetailsView_OnRatingSubmissionComplete final
{
public:
	struct FModioErrorCode                        errorCode;                                         // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioRating                                  SubmittedRating;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioCommonModDetailsView_OnRatingSubmissionComplete) == 0x000008, "Wrong alignment on ModioCommonModDetailsView_OnRatingSubmissionComplete");
static_assert(sizeof(ModioCommonModDetailsView_OnRatingSubmissionComplete) == 0x000010, "Wrong size on ModioCommonModDetailsView_OnRatingSubmissionComplete");
static_assert(offsetof(ModioCommonModDetailsView_OnRatingSubmissionComplete, errorCode) == 0x000000, "Member 'ModioCommonModDetailsView_OnRatingSubmissionComplete::errorCode' has a wrong offset!");
static_assert(offsetof(ModioCommonModDetailsView_OnRatingSubmissionComplete, SubmittedRating) == 0x000008, "Member 'ModioCommonModDetailsView_OnRatingSubmissionComplete::SubmittedRating' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsView.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonModDetailsView_SetStyle final
{
public:
	TSubclassOf<class UModioCommonModDetailsViewStyle> InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModDetailsView_SetStyle) == 0x000008, "Wrong alignment on ModioCommonModDetailsView_SetStyle");
static_assert(sizeof(ModioCommonModDetailsView_SetStyle) == 0x000008, "Wrong size on ModioCommonModDetailsView_SetStyle");
static_assert(offsetof(ModioCommonModDetailsView_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonModDetailsView_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsView.UpdateOperationProgressBytes
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonModDetailsView_UpdateOperationProgressBytes final
{
public:
	struct FModioUnsigned64                       Current;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FModioUnsigned64                       Total;                                             // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModDetailsView_UpdateOperationProgressBytes) == 0x000008, "Wrong alignment on ModioCommonModDetailsView_UpdateOperationProgressBytes");
static_assert(sizeof(ModioCommonModDetailsView_UpdateOperationProgressBytes) == 0x000010, "Wrong size on ModioCommonModDetailsView_UpdateOperationProgressBytes");
static_assert(offsetof(ModioCommonModDetailsView_UpdateOperationProgressBytes, Current) == 0x000000, "Member 'ModioCommonModDetailsView_UpdateOperationProgressBytes::Current' has a wrong offset!");
static_assert(offsetof(ModioCommonModDetailsView_UpdateOperationProgressBytes, Total) == 0x000008, "Member 'ModioCommonModDetailsView_UpdateOperationProgressBytes::Total' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsView.UpdateOperationProgressPercent
// 0x0004 (0x0004 - 0x0000)
struct ModioCommonModDetailsView_UpdateOperationProgressPercent final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModDetailsView_UpdateOperationProgressPercent) == 0x000004, "Wrong alignment on ModioCommonModDetailsView_UpdateOperationProgressPercent");
static_assert(sizeof(ModioCommonModDetailsView_UpdateOperationProgressPercent) == 0x000004, "Wrong size on ModioCommonModDetailsView_UpdateOperationProgressPercent");
static_assert(offsetof(ModioCommonModDetailsView_UpdateOperationProgressPercent, InPercent) == 0x000000, "Member 'ModioCommonModDetailsView_UpdateOperationProgressPercent::InPercent' has a wrong offset!");

// Function ModioUI.ModioCommonModDetailsView.UpdateSpeed
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonModDetailsView_UpdateSpeed final
{
public:
	struct FModioUnsigned64                       DeltaBytes;                                        // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        DeltaTime;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModDetailsView_UpdateSpeed) == 0x000008, "Wrong alignment on ModioCommonModDetailsView_UpdateSpeed");
static_assert(sizeof(ModioCommonModDetailsView_UpdateSpeed) == 0x000010, "Wrong size on ModioCommonModDetailsView_UpdateSpeed");
static_assert(offsetof(ModioCommonModDetailsView_UpdateSpeed, DeltaBytes) == 0x000000, "Member 'ModioCommonModDetailsView_UpdateSpeed::DeltaBytes' has a wrong offset!");
static_assert(offsetof(ModioCommonModDetailsView_UpdateSpeed, DeltaTime) == 0x000008, "Member 'ModioCommonModDetailsView_UpdateSpeed::DeltaTime' has a wrong offset!");

// Function ModioUI.ModioCommonActionBar.HandleBoundActionsUpdated
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonActionBar_HandleBoundActionsUpdated final
{
public:
	bool                                          bFromOwningPlayer;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActionBar_HandleBoundActionsUpdated) == 0x000001, "Wrong alignment on ModioCommonActionBar_HandleBoundActionsUpdated");
static_assert(sizeof(ModioCommonActionBar_HandleBoundActionsUpdated) == 0x000001, "Wrong size on ModioCommonActionBar_HandleBoundActionsUpdated");
static_assert(offsetof(ModioCommonActionBar_HandleBoundActionsUpdated, bFromOwningPlayer) == 0x000000, "Member 'ModioCommonActionBar_HandleBoundActionsUpdated::bFromOwningPlayer' has a wrong offset!");

// Function ModioUI.ModioCommonActionBar.HandlePlayerAdded
// 0x0004 (0x0004 - 0x0000)
struct ModioCommonActionBar_HandlePlayerAdded final
{
public:
	int32                                         PlayerIdx;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActionBar_HandlePlayerAdded) == 0x000004, "Wrong alignment on ModioCommonActionBar_HandlePlayerAdded");
static_assert(sizeof(ModioCommonActionBar_HandlePlayerAdded) == 0x000004, "Wrong size on ModioCommonActionBar_HandlePlayerAdded");
static_assert(offsetof(ModioCommonActionBar_HandlePlayerAdded, PlayerIdx) == 0x000000, "Member 'ModioCommonActionBar_HandlePlayerAdded::PlayerIdx' has a wrong offset!");

// Function ModioUI.ModioCommonActionBar.MonitorPlayerActions
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonActionBar_MonitorPlayerActions final
{
public:
	const class ULocalPlayer*                     NewPlayer;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActionBar_MonitorPlayerActions) == 0x000008, "Wrong alignment on ModioCommonActionBar_MonitorPlayerActions");
static_assert(sizeof(ModioCommonActionBar_MonitorPlayerActions) == 0x000008, "Wrong size on ModioCommonActionBar_MonitorPlayerActions");
static_assert(offsetof(ModioCommonActionBar_MonitorPlayerActions, NewPlayer) == 0x000000, "Member 'ModioCommonActionBar_MonitorPlayerActions::NewPlayer' has a wrong offset!");

// Function ModioUI.ModioCommonActionBar.GetNumInputActions
// 0x0004 (0x0004 - 0x0000)
struct ModioCommonActionBar_GetNumInputActions final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActionBar_GetNumInputActions) == 0x000004, "Wrong alignment on ModioCommonActionBar_GetNumInputActions");
static_assert(sizeof(ModioCommonActionBar_GetNumInputActions) == 0x000004, "Wrong size on ModioCommonActionBar_GetNumInputActions");
static_assert(offsetof(ModioCommonActionBar_GetNumInputActions, ReturnValue) == 0x000000, "Member 'ModioCommonActionBar_GetNumInputActions::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonActivatableWidgetStack.BP_AddWidgetSmart
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonActivatableWidgetStack_BP_AddWidgetSmart final
{
public:
	TSubclassOf<class UCommonActivatableWidget>   ActivatableWidgetClass;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipIfAlreadyActive;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveIfInStack;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart) == 0x000008, "Wrong alignment on ModioCommonActivatableWidgetStack_BP_AddWidgetSmart");
static_assert(sizeof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart) == 0x000018, "Wrong size on ModioCommonActivatableWidgetStack_BP_AddWidgetSmart");
static_assert(offsetof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart, ActivatableWidgetClass) == 0x000000, "Member 'ModioCommonActivatableWidgetStack_BP_AddWidgetSmart::ActivatableWidgetClass' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart, bSkipIfAlreadyActive) == 0x000008, "Member 'ModioCommonActivatableWidgetStack_BP_AddWidgetSmart::bSkipIfAlreadyActive' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart, bRemoveIfInStack) == 0x000009, "Member 'ModioCommonActivatableWidgetStack_BP_AddWidgetSmart::bRemoveIfInStack' has a wrong offset!");
static_assert(offsetof(ModioCommonActivatableWidgetStack_BP_AddWidgetSmart, ReturnValue) == 0x000010, "Member 'ModioCommonActivatableWidgetStack_BP_AddWidgetSmart::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonModGalleryEntry.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonModGalleryEntry_SetStyle final
{
public:
	TSubclassOf<class UModioCommonModGalleryEntryStyle> InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonModGalleryEntry_SetStyle) == 0x000008, "Wrong alignment on ModioCommonModGalleryEntry_SetStyle");
static_assert(sizeof(ModioCommonModGalleryEntry_SetStyle) == 0x000008, "Wrong size on ModioCommonModGalleryEntry_SetStyle");
static_assert(offsetof(ModioCommonModGalleryEntry_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonModGalleryEntry_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.HandleEmailAuthCodeSent
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonAuthView_HandleEmailAuthCodeSent final
{
public:
	struct FModioErrorCode                        errorCode;                                         // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_HandleEmailAuthCodeSent) == 0x000008, "Wrong alignment on ModioCommonAuthView_HandleEmailAuthCodeSent");
static_assert(sizeof(ModioCommonAuthView_HandleEmailAuthCodeSent) == 0x000008, "Wrong size on ModioCommonAuthView_HandleEmailAuthCodeSent");
static_assert(offsetof(ModioCommonAuthView_HandleEmailAuthCodeSent, errorCode) == 0x000000, "Member 'ModioCommonAuthView_HandleEmailAuthCodeSent::errorCode' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.HandleEmailAuthenticated
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonAuthView_HandleEmailAuthenticated final
{
public:
	struct FModioErrorCode                        errorCode;                                         // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_HandleEmailAuthenticated) == 0x000008, "Wrong alignment on ModioCommonAuthView_HandleEmailAuthenticated");
static_assert(sizeof(ModioCommonAuthView_HandleEmailAuthenticated) == 0x000008, "Wrong size on ModioCommonAuthView_HandleEmailAuthenticated");
static_assert(offsetof(ModioCommonAuthView_HandleEmailAuthenticated, errorCode) == 0x000000, "Member 'ModioCommonAuthView_HandleEmailAuthenticated::errorCode' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.OnEmailAuthCodeViewSubmitClicked
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked final
{
public:
	class FString                                 AuthCode;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked) == 0x000008, "Wrong alignment on ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked");
static_assert(sizeof(ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked) == 0x000010, "Wrong size on ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked");
static_assert(offsetof(ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked, AuthCode) == 0x000000, "Member 'ModioCommonAuthView_OnEmailAuthCodeViewSubmitClicked::AuthCode' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.OnEmailAuthViewSubmitClicked
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonAuthView_OnEmailAuthViewSubmitClicked final
{
public:
	class FString                                 EmailAddress;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_OnEmailAuthViewSubmitClicked) == 0x000008, "Wrong alignment on ModioCommonAuthView_OnEmailAuthViewSubmitClicked");
static_assert(sizeof(ModioCommonAuthView_OnEmailAuthViewSubmitClicked) == 0x000010, "Wrong size on ModioCommonAuthView_OnEmailAuthViewSubmitClicked");
static_assert(offsetof(ModioCommonAuthView_OnEmailAuthViewSubmitClicked, EmailAddress) == 0x000000, "Member 'ModioCommonAuthView_OnEmailAuthViewSubmitClicked::EmailAddress' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.OnTermsOfUseViewLinkClicked
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonAuthView_OnTermsOfUseViewLinkClicked final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_OnTermsOfUseViewLinkClicked) == 0x000008, "Wrong alignment on ModioCommonAuthView_OnTermsOfUseViewLinkClicked");
static_assert(sizeof(ModioCommonAuthView_OnTermsOfUseViewLinkClicked) == 0x000010, "Wrong size on ModioCommonAuthView_OnTermsOfUseViewLinkClicked");
static_assert(offsetof(ModioCommonAuthView_OnTermsOfUseViewLinkClicked, URL) == 0x000000, "Member 'ModioCommonAuthView_OnTermsOfUseViewLinkClicked::URL' has a wrong offset!");

// Function ModioUI.ModioCommonAuthView.SetShowTermsOfView
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonAuthView_SetShowTermsOfView final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonAuthView_SetShowTermsOfView) == 0x000001, "Wrong alignment on ModioCommonAuthView_SetShowTermsOfView");
static_assert(sizeof(ModioCommonAuthView_SetShowTermsOfView) == 0x000001, "Wrong size on ModioCommonAuthView_SetShowTermsOfView");
static_assert(offsetof(ModioCommonAuthView_SetShowTermsOfView, bShow) == 0x000000, "Member 'ModioCommonAuthView_SetShowTermsOfView::bShow' has a wrong offset!");

// Function ModioUI.ModioCommonBorder.HandleOnMouseButtonDownEvent
// 0x0190 (0x0190 - 0x0000)
struct ModioCommonBorder_HandleOnMouseButtonDownEvent final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00D8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonBorder_HandleOnMouseButtonDownEvent) == 0x000008, "Wrong alignment on ModioCommonBorder_HandleOnMouseButtonDownEvent");
static_assert(sizeof(ModioCommonBorder_HandleOnMouseButtonDownEvent) == 0x000190, "Wrong size on ModioCommonBorder_HandleOnMouseButtonDownEvent");
static_assert(offsetof(ModioCommonBorder_HandleOnMouseButtonDownEvent, MyGeometry) == 0x000000, "Member 'ModioCommonBorder_HandleOnMouseButtonDownEvent::MyGeometry' has a wrong offset!");
static_assert(offsetof(ModioCommonBorder_HandleOnMouseButtonDownEvent, MouseEvent) == 0x000040, "Member 'ModioCommonBorder_HandleOnMouseButtonDownEvent::MouseEvent' has a wrong offset!");
static_assert(offsetof(ModioCommonBorder_HandleOnMouseButtonDownEvent, ReturnValue) == 0x0000D8, "Member 'ModioCommonBorder_HandleOnMouseButtonDownEvent::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonTabListWidgetBase.OnTabSelectedInternal
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonTabListWidgetBase_OnTabSelectedInternal final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonTabListWidgetBase_OnTabSelectedInternal) == 0x000004, "Wrong alignment on ModioCommonTabListWidgetBase_OnTabSelectedInternal");
static_assert(sizeof(ModioCommonTabListWidgetBase_OnTabSelectedInternal) == 0x000008, "Wrong size on ModioCommonTabListWidgetBase_OnTabSelectedInternal");
static_assert(offsetof(ModioCommonTabListWidgetBase_OnTabSelectedInternal, TabNameID) == 0x000000, "Member 'ModioCommonTabListWidgetBase_OnTabSelectedInternal::TabNameID' has a wrong offset!");

// Function ModioUI.ModioCommonTabListWidgetBase.RegisterDynamicTab
// 0x0038 (0x0038 - 0x0000)
struct ModioCommonTabListWidgetBase_RegisterDynamicTab final
{
public:
	struct FModioCommonTabDescriptor              TabDescriptor;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioCommonTabListWidgetBase_RegisterDynamicTab) == 0x000008, "Wrong alignment on ModioCommonTabListWidgetBase_RegisterDynamicTab");
static_assert(sizeof(ModioCommonTabListWidgetBase_RegisterDynamicTab) == 0x000038, "Wrong size on ModioCommonTabListWidgetBase_RegisterDynamicTab");
static_assert(offsetof(ModioCommonTabListWidgetBase_RegisterDynamicTab, TabDescriptor) == 0x000000, "Member 'ModioCommonTabListWidgetBase_RegisterDynamicTab::TabDescriptor' has a wrong offset!");
static_assert(offsetof(ModioCommonTabListWidgetBase_RegisterDynamicTab, ReturnValue) == 0x000030, "Member 'ModioCommonTabListWidgetBase_RegisterDynamicTab::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonTabListWidgetBase.SelectTabByIDExtended
// 0x000C (0x000C - 0x0000)
struct ModioCommonTabListWidgetBase_SelectTabByIDExtended final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressClickFeedback;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressOnTabSelectedIfAlreadySelected;           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioCommonTabListWidgetBase_SelectTabByIDExtended) == 0x000004, "Wrong alignment on ModioCommonTabListWidgetBase_SelectTabByIDExtended");
static_assert(sizeof(ModioCommonTabListWidgetBase_SelectTabByIDExtended) == 0x00000C, "Wrong size on ModioCommonTabListWidgetBase_SelectTabByIDExtended");
static_assert(offsetof(ModioCommonTabListWidgetBase_SelectTabByIDExtended, TabNameID) == 0x000000, "Member 'ModioCommonTabListWidgetBase_SelectTabByIDExtended::TabNameID' has a wrong offset!");
static_assert(offsetof(ModioCommonTabListWidgetBase_SelectTabByIDExtended, bSuppressClickFeedback) == 0x000008, "Member 'ModioCommonTabListWidgetBase_SelectTabByIDExtended::bSuppressClickFeedback' has a wrong offset!");
static_assert(offsetof(ModioCommonTabListWidgetBase_SelectTabByIDExtended, bSuppressOnTabSelectedIfAlreadySelected) == 0x000009, "Member 'ModioCommonTabListWidgetBase_SelectTabByIDExtended::bSuppressOnTabSelectedIfAlreadySelected' has a wrong offset!");
static_assert(offsetof(ModioCommonTabListWidgetBase_SelectTabByIDExtended, ReturnValue) == 0x00000A, "Member 'ModioCommonTabListWidgetBase_SelectTabByIDExtended::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonTabListWidgetBase.SetNextTabInputActionData
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonTabListWidgetBase_SetNextTabInputActionData final
{
public:
	struct FDataTableRowHandle                    InNextTabInputActionData;                          // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonTabListWidgetBase_SetNextTabInputActionData) == 0x000008, "Wrong alignment on ModioCommonTabListWidgetBase_SetNextTabInputActionData");
static_assert(sizeof(ModioCommonTabListWidgetBase_SetNextTabInputActionData) == 0x000010, "Wrong size on ModioCommonTabListWidgetBase_SetNextTabInputActionData");
static_assert(offsetof(ModioCommonTabListWidgetBase_SetNextTabInputActionData, InNextTabInputActionData) == 0x000000, "Member 'ModioCommonTabListWidgetBase_SetNextTabInputActionData::InNextTabInputActionData' has a wrong offset!");

// Function ModioUI.ModioCommonTabListWidgetBase.SetPreviousTabInputActionData
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonTabListWidgetBase_SetPreviousTabInputActionData final
{
public:
	struct FDataTableRowHandle                    InPreviousTabInputActionData;                      // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonTabListWidgetBase_SetPreviousTabInputActionData) == 0x000008, "Wrong alignment on ModioCommonTabListWidgetBase_SetPreviousTabInputActionData");
static_assert(sizeof(ModioCommonTabListWidgetBase_SetPreviousTabInputActionData) == 0x000010, "Wrong size on ModioCommonTabListWidgetBase_SetPreviousTabInputActionData");
static_assert(offsetof(ModioCommonTabListWidgetBase_SetPreviousTabInputActionData, InPreviousTabInputActionData) == 0x000000, "Member 'ModioCommonTabListWidgetBase_SetPreviousTabInputActionData::InPreviousTabInputActionData' has a wrong offset!");

// Function ModioUI.ModioCommonButtonBase.SetLabel
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonButtonBase_SetLabel final
{
public:
	class FText                                   NewLabel;                                          // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonButtonBase_SetLabel) == 0x000008, "Wrong alignment on ModioCommonButtonBase_SetLabel");
static_assert(sizeof(ModioCommonButtonBase_SetLabel) == 0x000018, "Wrong size on ModioCommonButtonBase_SetLabel");
static_assert(offsetof(ModioCommonButtonBase_SetLabel, NewLabel) == 0x000000, "Member 'ModioCommonButtonBase_SetLabel::NewLabel' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.HandleOnCheckStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonCheckBox_HandleOnCheckStateChanged final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_HandleOnCheckStateChanged) == 0x000001, "Wrong alignment on ModioCommonCheckBox_HandleOnCheckStateChanged");
static_assert(sizeof(ModioCommonCheckBox_HandleOnCheckStateChanged) == 0x000001, "Wrong size on ModioCommonCheckBox_HandleOnCheckStateChanged");
static_assert(offsetof(ModioCommonCheckBox_HandleOnCheckStateChanged, bIsChecked) == 0x000000, "Member 'ModioCommonCheckBox_HandleOnCheckStateChanged::bIsChecked' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.SetLabel
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonCheckBox_SetLabel final
{
public:
	class FText                                   InLabelText;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_SetLabel) == 0x000008, "Wrong alignment on ModioCommonCheckBox_SetLabel");
static_assert(sizeof(ModioCommonCheckBox_SetLabel) == 0x000018, "Wrong size on ModioCommonCheckBox_SetLabel");
static_assert(offsetof(ModioCommonCheckBox_SetLabel, InLabelText) == 0x000000, "Member 'ModioCommonCheckBox_SetLabel::InLabelText' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonCheckBox_SetStyle final
{
public:
	TSubclassOf<class UModioCommonCheckBoxStyle>  InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_SetStyle) == 0x000008, "Wrong alignment on ModioCommonCheckBox_SetStyle");
static_assert(sizeof(ModioCommonCheckBox_SetStyle) == 0x000008, "Wrong size on ModioCommonCheckBox_SetStyle");
static_assert(offsetof(ModioCommonCheckBox_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonCheckBox_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.GetCheckboxContentPadding
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCheckBox_GetCheckboxContentPadding final
{
public:
	struct FMargin                                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_GetCheckboxContentPadding) == 0x000004, "Wrong alignment on ModioCommonCheckBox_GetCheckboxContentPadding");
static_assert(sizeof(ModioCommonCheckBox_GetCheckboxContentPadding) == 0x000010, "Wrong size on ModioCommonCheckBox_GetCheckboxContentPadding");
static_assert(offsetof(ModioCommonCheckBox_GetCheckboxContentPadding, ReturnValue) == 0x000000, "Member 'ModioCommonCheckBox_GetCheckboxContentPadding::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.GetLabel
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonCheckBox_GetLabel final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_GetLabel) == 0x000008, "Wrong alignment on ModioCommonCheckBox_GetLabel");
static_assert(sizeof(ModioCommonCheckBox_GetLabel) == 0x000018, "Wrong size on ModioCommonCheckBox_GetLabel");
static_assert(offsetof(ModioCommonCheckBox_GetLabel, ReturnValue) == 0x000000, "Member 'ModioCommonCheckBox_GetLabel::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonCheckBox.GetLabelTextBlockText
// 0x0018 (0x0018 - 0x0000)
struct ModioCommonCheckBox_GetLabelTextBlockText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCheckBox_GetLabelTextBlockText) == 0x000008, "Wrong alignment on ModioCommonCheckBox_GetLabelTextBlockText");
static_assert(sizeof(ModioCommonCheckBox_GetLabelTextBlockText) == 0x000018, "Wrong size on ModioCommonCheckBox_GetLabelTextBlockText");
static_assert(offsetof(ModioCommonCheckBox_GetLabelTextBlockText, ReturnValue) == 0x000000, "Member 'ModioCommonCheckBox_GetLabelTextBlockText::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonCodeInputTextBox.SetCodeString
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCodeInputTextBox_SetCodeString final
{
public:
	class FString                                 InCodeString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCodeInputTextBox_SetCodeString) == 0x000008, "Wrong alignment on ModioCommonCodeInputTextBox_SetCodeString");
static_assert(sizeof(ModioCommonCodeInputTextBox_SetCodeString) == 0x000010, "Wrong size on ModioCommonCodeInputTextBox_SetCodeString");
static_assert(offsetof(ModioCommonCodeInputTextBox_SetCodeString, InCodeString) == 0x000000, "Member 'ModioCommonCodeInputTextBox_SetCodeString::InCodeString' has a wrong offset!");

// Function ModioUI.ModioCommonCodeInputTextBox.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonCodeInputTextBox_SetStyle final
{
public:
	TSubclassOf<class UModioCommonCodeInputTextBoxStyle> InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCodeInputTextBox_SetStyle) == 0x000008, "Wrong alignment on ModioCommonCodeInputTextBox_SetStyle");
static_assert(sizeof(ModioCommonCodeInputTextBox_SetStyle) == 0x000008, "Wrong size on ModioCommonCodeInputTextBox_SetStyle");
static_assert(offsetof(ModioCommonCodeInputTextBox_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonCodeInputTextBox_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonCodeInputTextBox.GetCodeString
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCodeInputTextBox_GetCodeString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCodeInputTextBox_GetCodeString) == 0x000008, "Wrong alignment on ModioCommonCodeInputTextBox_GetCodeString");
static_assert(sizeof(ModioCommonCodeInputTextBox_GetCodeString) == 0x000010, "Wrong size on ModioCommonCodeInputTextBox_GetCodeString");
static_assert(offsetof(ModioCommonCodeInputTextBox_GetCodeString, ReturnValue) == 0x000000, "Member 'ModioCommonCodeInputTextBox_GetCodeString::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.ApplySortingAndFiltering
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCollectionView_ApplySortingAndFiltering final
{
public:
	TArray<struct FModioModCollectionEntry>       ModListEntries;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_ApplySortingAndFiltering) == 0x000008, "Wrong alignment on ModioCommonCollectionView_ApplySortingAndFiltering");
static_assert(sizeof(ModioCommonCollectionView_ApplySortingAndFiltering) == 0x000010, "Wrong size on ModioCommonCollectionView_ApplySortingAndFiltering");
static_assert(offsetof(ModioCommonCollectionView_ApplySortingAndFiltering, ModListEntries) == 0x000000, "Member 'ModioCommonCollectionView_ApplySortingAndFiltering::ModListEntries' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.OnFetchExternalCompleted
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonCollectionView_OnFetchExternalCompleted final
{
public:
	struct FModioErrorCode                        errorCode;                                         // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_OnFetchExternalCompleted) == 0x000008, "Wrong alignment on ModioCommonCollectionView_OnFetchExternalCompleted");
static_assert(sizeof(ModioCommonCollectionView_OnFetchExternalCompleted) == 0x000008, "Wrong size on ModioCommonCollectionView_OnFetchExternalCompleted");
static_assert(offsetof(ModioCommonCollectionView_OnFetchExternalCompleted, errorCode) == 0x000000, "Member 'ModioCommonCollectionView_OnFetchExternalCompleted::errorCode' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SetDefaultCategoryFilterParams
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonCollectionView_SetDefaultCategoryFilterParams final
{
public:
	bool                                          bUserAuthenticated;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SetDefaultCategoryFilterParams) == 0x000001, "Wrong alignment on ModioCommonCollectionView_SetDefaultCategoryFilterParams");
static_assert(sizeof(ModioCommonCollectionView_SetDefaultCategoryFilterParams) == 0x000001, "Wrong size on ModioCommonCollectionView_SetDefaultCategoryFilterParams");
static_assert(offsetof(ModioCommonCollectionView_SetDefaultCategoryFilterParams, bUserAuthenticated) == 0x000000, "Member 'ModioCommonCollectionView_SetDefaultCategoryFilterParams::bUserAuthenticated' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SetNoResultsVisibility
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonCollectionView_SetNoResultsVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SetNoResultsVisibility) == 0x000001, "Wrong alignment on ModioCommonCollectionView_SetNoResultsVisibility");
static_assert(sizeof(ModioCommonCollectionView_SetNoResultsVisibility) == 0x000001, "Wrong size on ModioCommonCollectionView_SetNoResultsVisibility");
static_assert(offsetof(ModioCommonCollectionView_SetNoResultsVisibility, bVisible) == 0x000000, "Member 'ModioCommonCollectionView_SetNoResultsVisibility::bVisible' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonCollectionView_SetStyle final
{
public:
	TSubclassOf<class UModioCommonCollectionViewStyle> InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SetStyle) == 0x000008, "Wrong alignment on ModioCommonCollectionView_SetStyle");
static_assert(sizeof(ModioCommonCollectionView_SetStyle) == 0x000008, "Wrong size on ModioCommonCollectionView_SetStyle");
static_assert(offsetof(ModioCommonCollectionView_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonCollectionView_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SortAToZ
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCollectionView_SortAToZ final
{
public:
	TArray<struct FModioModCollectionEntry>       ModListEntries;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SortAToZ) == 0x000008, "Wrong alignment on ModioCommonCollectionView_SortAToZ");
static_assert(sizeof(ModioCommonCollectionView_SortAToZ) == 0x000010, "Wrong size on ModioCommonCollectionView_SortAToZ");
static_assert(offsetof(ModioCommonCollectionView_SortAToZ, ModListEntries) == 0x000000, "Member 'ModioCommonCollectionView_SortAToZ::ModListEntries' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SortRecentlyUpdated
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCollectionView_SortRecentlyUpdated final
{
public:
	TArray<struct FModioModCollectionEntry>       ModListEntries;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SortRecentlyUpdated) == 0x000008, "Wrong alignment on ModioCommonCollectionView_SortRecentlyUpdated");
static_assert(sizeof(ModioCommonCollectionView_SortRecentlyUpdated) == 0x000010, "Wrong size on ModioCommonCollectionView_SortRecentlyUpdated");
static_assert(offsetof(ModioCommonCollectionView_SortRecentlyUpdated, ModListEntries) == 0x000000, "Member 'ModioCommonCollectionView_SortRecentlyUpdated::ModListEntries' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SortSizeOnDisk
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCollectionView_SortSizeOnDisk final
{
public:
	TArray<struct FModioModCollectionEntry>       ModListEntries;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SortSizeOnDisk) == 0x000008, "Wrong alignment on ModioCommonCollectionView_SortSizeOnDisk");
static_assert(sizeof(ModioCommonCollectionView_SortSizeOnDisk) == 0x000010, "Wrong size on ModioCommonCollectionView_SortSizeOnDisk");
static_assert(offsetof(ModioCommonCollectionView_SortSizeOnDisk, ModListEntries) == 0x000000, "Member 'ModioCommonCollectionView_SortSizeOnDisk::ModListEntries' has a wrong offset!");

// Function ModioUI.ModioCommonCollectionView.SortZToA
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonCollectionView_SortZToA final
{
public:
	TArray<struct FModioModCollectionEntry>       ModListEntries;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonCollectionView_SortZToA) == 0x000008, "Wrong alignment on ModioCommonCollectionView_SortZToA");
static_assert(sizeof(ModioCommonCollectionView_SortZToA) == 0x000010, "Wrong size on ModioCommonCollectionView_SortZToA");
static_assert(offsetof(ModioCommonCollectionView_SortZToA, ModListEntries) == 0x000000, "Member 'ModioCommonCollectionView_SortZToA::ModListEntries' has a wrong offset!");

// Function ModioUI.ModioCommonComboBoxString.SetStyle
// 0x0008 (0x0008 - 0x0000)
struct ModioCommonComboBoxString_SetStyle final
{
public:
	TSubclassOf<class UModioCommonComboBoxStringStyle> InStyle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonComboBoxString_SetStyle) == 0x000008, "Wrong alignment on ModioCommonComboBoxString_SetStyle");
static_assert(sizeof(ModioCommonComboBoxString_SetStyle) == 0x000008, "Wrong size on ModioCommonComboBoxString_SetStyle");
static_assert(offsetof(ModioCommonComboBoxString_SetStyle, InStyle) == 0x000000, "Member 'ModioCommonComboBoxString_SetStyle::InStyle' has a wrong offset!");

// Function ModioUI.ModioCommonDialogInfo.HandleDialogButtonClicked
// 0x0001 (0x0001 - 0x0000)
struct ModioCommonDialogInfo_HandleDialogButtonClicked final
{
public:
	EModioCommonDialogButtonType                  ClickedButtonType;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogInfo_HandleDialogButtonClicked) == 0x000001, "Wrong alignment on ModioCommonDialogInfo_HandleDialogButtonClicked");
static_assert(sizeof(ModioCommonDialogInfo_HandleDialogButtonClicked) == 0x000001, "Wrong size on ModioCommonDialogInfo_HandleDialogButtonClicked");
static_assert(offsetof(ModioCommonDialogInfo_HandleDialogButtonClicked, ClickedButtonType) == 0x000000, "Member 'ModioCommonDialogInfo_HandleDialogButtonClicked::ClickedButtonType' has a wrong offset!");

// Function ModioUI.ModioCommonDialogLibrary.CreateConfirmUninstallDialogInfo
// 0x01E8 (0x01E8 - 0x0000)
struct ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo final
{
public:
	struct FModioModInfo                          ModInfo;                                           // 0x0000(0x01E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UModioCommonDialogInfo*                 ReturnValue;                                       // 0x01E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo) == 0x000008, "Wrong alignment on ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo");
static_assert(sizeof(ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo) == 0x0001E8, "Wrong size on ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo");
static_assert(offsetof(ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo, ModInfo) == 0x000000, "Member 'ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo, ReturnValue) == 0x0001E0, "Member 'ModioCommonDialogLibrary_CreateConfirmUninstallDialogInfo::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonDialogLibrary.CreateErrorDialogInfo
// 0x0028 (0x0028 - 0x0000)
struct ModioCommonDialogLibrary_CreateErrorDialogInfo final
{
public:
	struct FModioErrorCode                        errorCode;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TitleText;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UModioCommonDialogInfo*                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogLibrary_CreateErrorDialogInfo) == 0x000008, "Wrong alignment on ModioCommonDialogLibrary_CreateErrorDialogInfo");
static_assert(sizeof(ModioCommonDialogLibrary_CreateErrorDialogInfo) == 0x000028, "Wrong size on ModioCommonDialogLibrary_CreateErrorDialogInfo");
static_assert(offsetof(ModioCommonDialogLibrary_CreateErrorDialogInfo, errorCode) == 0x000000, "Member 'ModioCommonDialogLibrary_CreateErrorDialogInfo::errorCode' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateErrorDialogInfo, TitleText) == 0x000008, "Member 'ModioCommonDialogLibrary_CreateErrorDialogInfo::TitleText' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateErrorDialogInfo, ReturnValue) == 0x000020, "Member 'ModioCommonDialogLibrary_CreateErrorDialogInfo::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonDialogLibrary.CreateManualDialogInfo
// 0x0038 (0x0038 - 0x0000)
struct ModioCommonDialogLibrary_CreateManualDialogInfo final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   DialogText;                                        // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UModioCommonDialogInfo*                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogLibrary_CreateManualDialogInfo) == 0x000008, "Wrong alignment on ModioCommonDialogLibrary_CreateManualDialogInfo");
static_assert(sizeof(ModioCommonDialogLibrary_CreateManualDialogInfo) == 0x000038, "Wrong size on ModioCommonDialogLibrary_CreateManualDialogInfo");
static_assert(offsetof(ModioCommonDialogLibrary_CreateManualDialogInfo, TitleText) == 0x000000, "Member 'ModioCommonDialogLibrary_CreateManualDialogInfo::TitleText' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateManualDialogInfo, DialogText) == 0x000018, "Member 'ModioCommonDialogLibrary_CreateManualDialogInfo::DialogText' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateManualDialogInfo, ReturnValue) == 0x000030, "Member 'ModioCommonDialogLibrary_CreateManualDialogInfo::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonDialogLibrary.CreateUninstallDialogInfo
// 0x01E8 (0x01E8 - 0x0000)
struct ModioCommonDialogLibrary_CreateUninstallDialogInfo final
{
public:
	struct FModioModInfo                          ModInfo;                                           // 0x0000(0x01E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UModioCommonDialogInfo*                 ReturnValue;                                       // 0x01E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogLibrary_CreateUninstallDialogInfo) == 0x000008, "Wrong alignment on ModioCommonDialogLibrary_CreateUninstallDialogInfo");
static_assert(sizeof(ModioCommonDialogLibrary_CreateUninstallDialogInfo) == 0x0001E8, "Wrong size on ModioCommonDialogLibrary_CreateUninstallDialogInfo");
static_assert(offsetof(ModioCommonDialogLibrary_CreateUninstallDialogInfo, ModInfo) == 0x000000, "Member 'ModioCommonDialogLibrary_CreateUninstallDialogInfo::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogLibrary_CreateUninstallDialogInfo, ReturnValue) == 0x0001E0, "Member 'ModioCommonDialogLibrary_CreateUninstallDialogInfo::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonDialogMessageView.SetButtonEnabledState
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonDialogMessageView_SetButtonEnabledState final
{
public:
	class UModioCommonButtonBase*                 Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioCommonDialogMessageView_SetButtonEnabledState) == 0x000008, "Wrong alignment on ModioCommonDialogMessageView_SetButtonEnabledState");
static_assert(sizeof(ModioCommonDialogMessageView_SetButtonEnabledState) == 0x000010, "Wrong size on ModioCommonDialogMessageView_SetButtonEnabledState");
static_assert(offsetof(ModioCommonDialogMessageView_SetButtonEnabledState, Button) == 0x000000, "Member 'ModioCommonDialogMessageView_SetButtonEnabledState::Button' has a wrong offset!");
static_assert(offsetof(ModioCommonDialogMessageView_SetButtonEnabledState, bEnabled) == 0x000008, "Member 'ModioCommonDialogMessageView_SetButtonEnabledState::bEnabled' has a wrong offset!");

// Function ModioUI.ModioCommonDialogMessageView.GetButtons
// 0x0050 (0x0050 - 0x0000)
struct ModioCommonDialogMessageView_GetButtons final
{
public:
	TMap<EModioCommonDialogButtonType, class UModioCommonButtonBase*> ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioCommonDialogMessageView_GetButtons) == 0x000008, "Wrong alignment on ModioCommonDialogMessageView_GetButtons");
static_assert(sizeof(ModioCommonDialogMessageView_GetButtons) == 0x000050, "Wrong size on ModioCommonDialogMessageView_GetButtons");
static_assert(offsetof(ModioCommonDialogMessageView_GetButtons, ReturnValue) == 0x000000, "Member 'ModioCommonDialogMessageView_GetButtons::ReturnValue' has a wrong offset!");

// Function ModioUI.ModioCommonImageBase.LoadImageFromAvatar
// 0x0010 (0x0010 - 0x0000)
struct ModioCommonImageBase_LoadImageFromAvatar final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
