#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "Modio_structs.hpp"


namespace SDK
{

// Enum ModioUICore.EModioUIAsyncOperationWidgetState
// NumValues: 0x0004
enum class EModioUIAsyncOperationWidgetState : uint8
{
	Success                                  = 0,
	Error                                    = 1,
	InProgress                               = 2,
	EModioUIAsyncOperationWidgetState_MAX    = 3,
};

// Enum ModioUICore.EModioUIMediaDownloadEventType
// NumValues: 0x0004
enum class EModioUIMediaDownloadEventType : uint8
{
	ModGalleryImages                         = 0,
	ModCreatorAvatarImage                    = 1,
	ModLogo                                  = 2,
	EModioUIMediaDownloadEventType_MAX       = 3,
};

// Enum ModioUICore.EModioUIModInfoEventType
// NumValues: 0x0003
enum class EModioUIModInfoEventType : uint8
{
	ListAllMods                              = 0,
	GetModInfo                               = 1,
	EModioUIModInfoEventType_MAX             = 2,
};

// Enum ModioUICore.EModioEnabledFilterType
// NumValues: 0x0004
enum class EModioEnabledFilterType : uint8
{
	None                                     = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	EModioEnabledFilterType_MAX              = 3,
};

// Enum ModioUICore.EModioInstalledFilterType
// NumValues: 0x0004
enum class EModioInstalledFilterType : uint8
{
	None                                     = 0,
	CurrentUser                              = 1,
	AnotherUser                              = 2,
	EModioInstalledFilterType_MAX            = 3,
};

// Enum ModioUICore.EModioManualSortType
// NumValues: 0x0005
enum class EModioManualSortType : uint8
{
	AToZ                                     = 0,
	ZToA                                     = 1,
	SizeOnDisk                               = 2,
	RecentlyUpdated                          = 3,
	EModioManualSortType_MAX                 = 4,
};

// ScriptStruct ModioUICore.ModioNotificationParams
// 0x0078 (0x0078 - 0x0000)
struct FModioNotificationParams final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioErrorCode                        errorCode;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                NotificationContextObject;                         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioNotificationParams) == 0x000008, "Wrong alignment on FModioNotificationParams");
static_assert(sizeof(FModioNotificationParams) == 0x000078, "Wrong size on FModioNotificationParams");
static_assert(offsetof(FModioNotificationParams, errorCode) == 0x000060, "Member 'FModioNotificationParams::errorCode' has a wrong offset!");
static_assert(offsetof(FModioNotificationParams, NotificationContextObject) == 0x000068, "Member 'FModioNotificationParams::NotificationContextObject' has a wrong offset!");
static_assert(offsetof(FModioNotificationParams, Duration) == 0x000070, "Member 'FModioNotificationParams::Duration' has a wrong offset!");

// ScriptStruct ModioUICore.ModioModCategoryParams
// 0x0060 (0x0060 - 0x0000)
struct FModioModCategoryParams final
{
public:
	class FText                                   CategoryName;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExcludedTags;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EModioSortDirection                           Direction;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioSortFieldType                           SortField;                                         // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Count;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SearchKeywords;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioInstalledFilterType                     InstalledField;                                    // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioEnabledFilterType                       EnabledFilter;                                     // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModioManualSortType                          ManualSortField;                                   // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModioModCategoryParams) == 0x000008, "Wrong alignment on FModioModCategoryParams");
static_assert(sizeof(FModioModCategoryParams) == 0x000060, "Wrong size on FModioModCategoryParams");
static_assert(offsetof(FModioModCategoryParams, CategoryName) == 0x000000, "Member 'FModioModCategoryParams::CategoryName' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, Tags) == 0x000018, "Member 'FModioModCategoryParams::Tags' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, ExcludedTags) == 0x000028, "Member 'FModioModCategoryParams::ExcludedTags' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, Direction) == 0x000038, "Member 'FModioModCategoryParams::Direction' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, SortField) == 0x000039, "Member 'FModioModCategoryParams::SortField' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, Count) == 0x000040, "Member 'FModioModCategoryParams::Count' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, SearchKeywords) == 0x000048, "Member 'FModioModCategoryParams::SearchKeywords' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, InstalledField) == 0x000058, "Member 'FModioModCategoryParams::InstalledField' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, EnabledFilter) == 0x000059, "Member 'FModioModCategoryParams::EnabledFilter' has a wrong offset!");
static_assert(offsetof(FModioModCategoryParams, ManualSortField) == 0x00005A, "Member 'FModioModCategoryParams::ManualSortField' has a wrong offset!");

}

