#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUI

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Modio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "ModioUI_structs.hpp"
#include "ModioUICore_structs.hpp"
#include "ModioUICore_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ModioUI.ModioCommonActivatableWidget
// 0x0060 (0x0428 - 0x03C8)
class UModioCommonActivatableWidget : public UCommonActivatableWidget
{
public:
	bool                                          bRoutedSetDataSource;                              // 0x03C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C9[0x1F];                                     // 0x03C9(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsFocused)> OnFocusChanged;                                    // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bAutoBindInputAction;                              // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoFocusOnActivation;                            // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DataSource;                                        // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_408[0x20];                                     // 0x0408(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_BindInputActions();
	void BP_ListenForInputAction(class UModioCommonButtonBase* Button, const struct FDataTableRowHandle& InputAction, const class FText& DisplayName, const TDelegate<void()>& OnActionFired);
	void BP_SynchronizeProperties();
	void BP_UnbindInputActions();
	void ClearListeningInputAction(class UModioCommonButtonBase* Button);
	void ClearListeningInputActions();
	void FocusOnDesiredWidget();
	class FString GetRequestIdentifier();
	void OnDataSourceUpdated();
	void OnViewportResized(const struct FVector2D& NewViewportSize);
	void SetDataSource(class UObject* NewDataSource);

	bool GetAutoBindInputAction() const;
	bool GetAutoFocusOnActivation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonActivatableWidget">();
	}
	static class UModioCommonActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonActivatableWidget>();
	}
};
static_assert(alignof(UModioCommonActivatableWidget) == 0x000008, "Wrong alignment on UModioCommonActivatableWidget");
static_assert(sizeof(UModioCommonActivatableWidget) == 0x000428, "Wrong size on UModioCommonActivatableWidget");
static_assert(offsetof(UModioCommonActivatableWidget, bRoutedSetDataSource) == 0x0003C8, "Member 'UModioCommonActivatableWidget::bRoutedSetDataSource' has a wrong offset!");
static_assert(offsetof(UModioCommonActivatableWidget, OnFocusChanged) == 0x0003E8, "Member 'UModioCommonActivatableWidget::OnFocusChanged' has a wrong offset!");
static_assert(offsetof(UModioCommonActivatableWidget, bAutoBindInputAction) == 0x0003F8, "Member 'UModioCommonActivatableWidget::bAutoBindInputAction' has a wrong offset!");
static_assert(offsetof(UModioCommonActivatableWidget, bAutoFocusOnActivation) == 0x0003F9, "Member 'UModioCommonActivatableWidget::bAutoFocusOnActivation' has a wrong offset!");
static_assert(offsetof(UModioCommonActivatableWidget, DataSource) == 0x000400, "Member 'UModioCommonActivatableWidget::DataSource' has a wrong offset!");

// Class ModioUI.ModioCommonModDetailsViewBase
// 0x0068 (0x0490 - 0x0428)
class UModioCommonModDetailsViewBase : public UModioCommonActivatableWidget
{
public:
	uint8                                         Pad_428[0x50];                                     // 0x0428(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UModioCommonModOperationTrackerUserWidget* ModOperationTrackerUserWidget;                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonModOperationTrackerWidget*  ModOperationTrackerWidget;                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsUserAuthenticated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonModDetailsViewBase">();
	}
	static class UModioCommonModDetailsViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonModDetailsViewBase>();
	}
};
static_assert(alignof(UModioCommonModDetailsViewBase) == 0x000008, "Wrong alignment on UModioCommonModDetailsViewBase");
static_assert(sizeof(UModioCommonModDetailsViewBase) == 0x000490, "Wrong size on UModioCommonModDetailsViewBase");
static_assert(offsetof(UModioCommonModDetailsViewBase, ModOperationTrackerUserWidget) == 0x000478, "Member 'UModioCommonModDetailsViewBase::ModOperationTrackerUserWidget' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewBase, ModOperationTrackerWidget) == 0x000480, "Member 'UModioCommonModDetailsViewBase::ModOperationTrackerWidget' has a wrong offset!");

// Class ModioUI.ModioCommonModDetailsView
// 0x0150 (0x05E0 - 0x0490)
class UModioCommonModDetailsView : public UModioCommonModDetailsViewBase
{
public:
	uint8                                         Pad_490[0x20];                                     // 0x0490(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UModioCommonModDetailsViewStyle> ModioStyle;                                        // 0x04B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ModNameTextBlock;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonButtonBase*                 SubscribeButton;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonButtonBase*                 CancelButton;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonButtonBase*                 RateUpButton;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonButtonBase*                 RateDownButton;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonButtonBase*                 ReportButton;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CollectionButton;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ModSummaryTextBlock;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ModFullDescriptionLabelTextBlock;                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ModFullDescriptionTextBlock;                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         OperationContainer;                                // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ProgressBarContainer;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         StatusContainer;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonCheckBox*                   InstalledCheckBox;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonCheckBox*                   EnabledCheckBox;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  OperationProgressLabelTextBlock;                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  OperationProgressTextBlock;                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonProgressBar*                OperationProgressBar;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  FileSizeLabelTextBlock;                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  FileSizeTextBlock;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  LastUpdatedLabelTextBlock;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  LastUpdatedTextBlock;                              // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ReleaseDateLabelTextBlock;                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  ReleaseDateTextBlock;                              // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  SubscribersLabelTextBlock;                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  SubscribersTextBlock;                              // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  CreatedByLabelTextBlock;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  CreatedByTextBlock;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  TagsLabelTextBlock;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonModTagList*                 TagsWidget;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonModGalleryView*             ModGalleryView;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonScrollBox*                  ModioCommonDescriptionScrollBox;                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTextBlock*                  SpeedDetailsTextBlock;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                ModDetailsLoader;                                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonErrorWithRetryWidget*       ErrorWithRetryWidget;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateBottomButtonsInputBindings();
	void ActivateTagsInputBindings();
	void ActivateTopButtonsInputBindings();
	void HandleCancelClicked();
	void HandleCollectionClicked();
	void HandleRateDownClicked();
	void HandleRateUpClicked();
	void HandleReportClicked();
	void HandleSubscribeClicked();
	void HandleSwitchEnabledClicked();
	void HideProgress();
	void OnRatingSubmissionComplete(const struct FModioErrorCode& errorCode, EModioRating SubmittedRating);
	void SetStyle(TSubclassOf<class UModioCommonModDetailsViewStyle> InStyle);
	void ShowProgress();
	void ShowStatus();
	void UpdateInputActions();
	void UpdateOperationProgressBytes(const struct FModioUnsigned64& Current, const struct FModioUnsigned64& Total);
	void UpdateOperationProgressPercent(float InPercent);
	void UpdateSpeed(const struct FModioUnsigned64& DeltaBytes, double DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonModDetailsView">();
	}
	static class UModioCommonModDetailsView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonModDetailsView>();
	}
};
static_assert(alignof(UModioCommonModDetailsView) == 0x000008, "Wrong alignment on UModioCommonModDetailsView");
static_assert(sizeof(UModioCommonModDetailsView) == 0x0005E0, "Wrong size on UModioCommonModDetailsView");
static_assert(offsetof(UModioCommonModDetailsView, ModioStyle) == 0x0004B0, "Member 'UModioCommonModDetailsView::ModioStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModNameTextBlock) == 0x0004B8, "Member 'UModioCommonModDetailsView::ModNameTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, SubscribeButton) == 0x0004C0, "Member 'UModioCommonModDetailsView::SubscribeButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, CancelButton) == 0x0004C8, "Member 'UModioCommonModDetailsView::CancelButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, RateUpButton) == 0x0004D0, "Member 'UModioCommonModDetailsView::RateUpButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, RateDownButton) == 0x0004D8, "Member 'UModioCommonModDetailsView::RateDownButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ReportButton) == 0x0004E0, "Member 'UModioCommonModDetailsView::ReportButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, CollectionButton) == 0x0004E8, "Member 'UModioCommonModDetailsView::CollectionButton' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModSummaryTextBlock) == 0x0004F0, "Member 'UModioCommonModDetailsView::ModSummaryTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModFullDescriptionLabelTextBlock) == 0x0004F8, "Member 'UModioCommonModDetailsView::ModFullDescriptionLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModFullDescriptionTextBlock) == 0x000500, "Member 'UModioCommonModDetailsView::ModFullDescriptionTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, OperationContainer) == 0x000508, "Member 'UModioCommonModDetailsView::OperationContainer' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ProgressBarContainer) == 0x000510, "Member 'UModioCommonModDetailsView::ProgressBarContainer' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, StatusContainer) == 0x000518, "Member 'UModioCommonModDetailsView::StatusContainer' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, InstalledCheckBox) == 0x000520, "Member 'UModioCommonModDetailsView::InstalledCheckBox' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, EnabledCheckBox) == 0x000528, "Member 'UModioCommonModDetailsView::EnabledCheckBox' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, OperationProgressLabelTextBlock) == 0x000530, "Member 'UModioCommonModDetailsView::OperationProgressLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, OperationProgressTextBlock) == 0x000538, "Member 'UModioCommonModDetailsView::OperationProgressTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, OperationProgressBar) == 0x000540, "Member 'UModioCommonModDetailsView::OperationProgressBar' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, FileSizeLabelTextBlock) == 0x000548, "Member 'UModioCommonModDetailsView::FileSizeLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, FileSizeTextBlock) == 0x000550, "Member 'UModioCommonModDetailsView::FileSizeTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, LastUpdatedLabelTextBlock) == 0x000558, "Member 'UModioCommonModDetailsView::LastUpdatedLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, LastUpdatedTextBlock) == 0x000560, "Member 'UModioCommonModDetailsView::LastUpdatedTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ReleaseDateLabelTextBlock) == 0x000568, "Member 'UModioCommonModDetailsView::ReleaseDateLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ReleaseDateTextBlock) == 0x000570, "Member 'UModioCommonModDetailsView::ReleaseDateTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, SubscribersLabelTextBlock) == 0x000578, "Member 'UModioCommonModDetailsView::SubscribersLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, SubscribersTextBlock) == 0x000580, "Member 'UModioCommonModDetailsView::SubscribersTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, CreatedByLabelTextBlock) == 0x000588, "Member 'UModioCommonModDetailsView::CreatedByLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, CreatedByTextBlock) == 0x000590, "Member 'UModioCommonModDetailsView::CreatedByTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, TagsLabelTextBlock) == 0x000598, "Member 'UModioCommonModDetailsView::TagsLabelTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, TagsWidget) == 0x0005A0, "Member 'UModioCommonModDetailsView::TagsWidget' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModGalleryView) == 0x0005A8, "Member 'UModioCommonModDetailsView::ModGalleryView' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModioCommonDescriptionScrollBox) == 0x0005B0, "Member 'UModioCommonModDetailsView::ModioCommonDescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, SpeedDetailsTextBlock) == 0x0005B8, "Member 'UModioCommonModDetailsView::SpeedDetailsTextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ModDetailsLoader) == 0x0005C0, "Member 'UModioCommonModDetailsView::ModDetailsLoader' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsView, ErrorWithRetryWidget) == 0x0005C8, "Member 'UModioCommonModDetailsView::ErrorWithRetryWidget' has a wrong offset!");

// Class ModioUI.ModioCommonSearchTabViewStyle
// 0x0038 (0x0060 - 0x0028)
class UModioCommonSearchTabViewStyle final : public UObject
{
public:
	TSubclassOf<class UModioCommonBorderStyle>    InternalBackgroundBorderStyle;                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonBorderStyle>    OverlayBackgroundBorderStyle;                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      SearchTabTitleTextStyle;                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonEditableTextBoxStyle> SearchTextBoxStyle;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    CloseButtonStyle;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    ResetButtonStyle;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    SearchButtonStyle;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonSearchTabViewStyle">();
	}
	static class UModioCommonSearchTabViewStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonSearchTabViewStyle>();
	}
};
static_assert(alignof(UModioCommonSearchTabViewStyle) == 0x000008, "Wrong alignment on UModioCommonSearchTabViewStyle");
static_assert(sizeof(UModioCommonSearchTabViewStyle) == 0x000060, "Wrong size on UModioCommonSearchTabViewStyle");
static_assert(offsetof(UModioCommonSearchTabViewStyle, InternalBackgroundBorderStyle) == 0x000028, "Member 'UModioCommonSearchTabViewStyle::InternalBackgroundBorderStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, OverlayBackgroundBorderStyle) == 0x000030, "Member 'UModioCommonSearchTabViewStyle::OverlayBackgroundBorderStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, SearchTabTitleTextStyle) == 0x000038, "Member 'UModioCommonSearchTabViewStyle::SearchTabTitleTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, SearchTextBoxStyle) == 0x000040, "Member 'UModioCommonSearchTabViewStyle::SearchTextBoxStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, CloseButtonStyle) == 0x000048, "Member 'UModioCommonSearchTabViewStyle::CloseButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, ResetButtonStyle) == 0x000050, "Member 'UModioCommonSearchTabViewStyle::ResetButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonSearchTabViewStyle, SearchButtonStyle) == 0x000058, "Member 'UModioCommonSearchTabViewStyle::SearchButtonStyle' has a wrong offset!");

// Class ModioUI.ModioCommonModDetailsViewStyle
// 0x0078 (0x00A0 - 0x0028)
class UModioCommonModDetailsViewStyle final : public UObject
{
public:
	TSubclassOf<class UModioCommonModGalleryViewStyle> ModGalleryViewStyle;                               // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      ModNameTextStyle;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    SubscribeButtonStyle;                              // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    CancelButtonStyle;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    RateUpButtonStyle;                                 // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    RateDownButtonStyle;                               // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonButtonStyle>    ReportButtonStyle;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      ModSummaryTextStyle;                               // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      ModFullDescriptionLabelTextStyle;                  // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      ModFullDescriptionTextStyle;                       // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      DownloadProgressLabelTextStyle;                    // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      DownloadProgressTextStyle;                         // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonProgressBarStyle> DownloadProgressBarStyle;                          // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      StatsLabelTextStyle;                               // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonTextStyle>      StatsTextStyle;                                    // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonModDetailsViewStyle">();
	}
	static class UModioCommonModDetailsViewStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonModDetailsViewStyle>();
	}
};
static_assert(alignof(UModioCommonModDetailsViewStyle) == 0x000008, "Wrong alignment on UModioCommonModDetailsViewStyle");
static_assert(sizeof(UModioCommonModDetailsViewStyle) == 0x0000A0, "Wrong size on UModioCommonModDetailsViewStyle");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ModGalleryViewStyle) == 0x000028, "Member 'UModioCommonModDetailsViewStyle::ModGalleryViewStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ModNameTextStyle) == 0x000030, "Member 'UModioCommonModDetailsViewStyle::ModNameTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, SubscribeButtonStyle) == 0x000038, "Member 'UModioCommonModDetailsViewStyle::SubscribeButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, CancelButtonStyle) == 0x000040, "Member 'UModioCommonModDetailsViewStyle::CancelButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, RateUpButtonStyle) == 0x000048, "Member 'UModioCommonModDetailsViewStyle::RateUpButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, RateDownButtonStyle) == 0x000050, "Member 'UModioCommonModDetailsViewStyle::RateDownButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ReportButtonStyle) == 0x000058, "Member 'UModioCommonModDetailsViewStyle::ReportButtonStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ModSummaryTextStyle) == 0x000060, "Member 'UModioCommonModDetailsViewStyle::ModSummaryTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ModFullDescriptionLabelTextStyle) == 0x000068, "Member 'UModioCommonModDetailsViewStyle::ModFullDescriptionLabelTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, ModFullDescriptionTextStyle) == 0x000070, "Member 'UModioCommonModDetailsViewStyle::ModFullDescriptionTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, DownloadProgressLabelTextStyle) == 0x000078, "Member 'UModioCommonModDetailsViewStyle::DownloadProgressLabelTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, DownloadProgressTextStyle) == 0x000080, "Member 'UModioCommonModDetailsViewStyle::DownloadProgressTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, DownloadProgressBarStyle) == 0x000088, "Member 'UModioCommonModDetailsViewStyle::DownloadProgressBarStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, StatsLabelTextStyle) == 0x000090, "Member 'UModioCommonModDetailsViewStyle::StatsLabelTextStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModDetailsViewStyle, StatsTextStyle) == 0x000098, "Member 'UModioCommonModDetailsViewStyle::StatsTextStyle' has a wrong offset!");

// Class ModioUI.ModioCommonActionBar
// 0x0000 (0x0428 - 0x0428)
class UModioCommonActionBar final : public UModioCommonActivatableWidget
{
public:
	void HandleBoundActionsUpdated(bool bFromOwningPlayer);
	void HandleDeferredDisplayUpdate();
	void HandlePlayerAdded(int32 PlayerIdx);
	void MonitorPlayerActions(const class ULocalPlayer* NewPlayer);

	int32 GetNumInputActions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonActionBar">();
	}
	static class UModioCommonActionBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonActionBar>();
	}
};
static_assert(alignof(UModioCommonActionBar) == 0x000008, "Wrong alignment on UModioCommonActionBar");
static_assert(sizeof(UModioCommonActionBar) == 0x000428, "Wrong size on UModioCommonActionBar");

// Class ModioUI.ModioCommonModGalleryItem
// 0x01E8 (0x0210 - 0x0028)
class UModioCommonModGalleryItem final : public UObject
{
public:
	struct FModioModInfo                          ModInfo;                                           // 0x0028(0x01E0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ImageGalleryIndex;                                 // 0x0208(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonModGalleryItem">();
	}
	static class UModioCommonModGalleryItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonModGalleryItem>();
	}
};
static_assert(alignof(UModioCommonModGalleryItem) == 0x000008, "Wrong alignment on UModioCommonModGalleryItem");
static_assert(sizeof(UModioCommonModGalleryItem) == 0x000210, "Wrong size on UModioCommonModGalleryItem");
static_assert(offsetof(UModioCommonModGalleryItem, ModInfo) == 0x000028, "Member 'UModioCommonModGalleryItem::ModInfo' has a wrong offset!");
static_assert(offsetof(UModioCommonModGalleryItem, ImageGalleryIndex) == 0x000208, "Member 'UModioCommonModGalleryItem::ImageGalleryIndex' has a wrong offset!");

// Class ModioUI.ModioCommonActivatableWidgetStack
// 0x0000 (0x0280 - 0x0280)
class UModioCommonActivatableWidgetStack final : public UCommonActivatableWidgetStack
{
public:
	class UCommonActivatableWidget* BP_AddWidgetSmart(TSubclassOf<class UCommonActivatableWidget> ActivatableWidgetClass, bool bSkipIfAlreadyActive, bool bRemoveIfInStack);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonActivatableWidgetStack">();
	}
	static class UModioCommonActivatableWidgetStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonActivatableWidgetStack>();
	}
};
static_assert(alignof(UModioCommonActivatableWidgetStack) == 0x000008, "Wrong alignment on UModioCommonActivatableWidgetStack");
static_assert(sizeof(UModioCommonActivatableWidgetStack) == 0x000280, "Wrong size on UModioCommonActivatableWidgetStack");

// Class ModioUI.ModioCommonModGalleryEntry
// 0x0018 (0x0440 - 0x0428)
class UModioCommonModGalleryEntry final : public UModioCommonActivatableWidget
{
public:
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UModioCommonModGalleryEntryStyle> ModioStyle;                                        // 0x0430(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonDynamicImage*               ModImage;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetStyle(TSubclassOf<class UModioCommonModGalleryEntryStyle> InStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonModGalleryEntry">();
	}
	static class UModioCommonModGalleryEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonModGalleryEntry>();
	}
};
static_assert(alignof(UModioCommonModGalleryEntry) == 0x000008, "Wrong alignment on UModioCommonModGalleryEntry");
static_assert(sizeof(UModioCommonModGalleryEntry) == 0x000440, "Wrong size on UModioCommonModGalleryEntry");
static_assert(offsetof(UModioCommonModGalleryEntry, ModioStyle) == 0x000430, "Member 'UModioCommonModGalleryEntry::ModioStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonModGalleryEntry, ModImage) == 0x000438, "Member 'UModioCommonModGalleryEntry::ModImage' has a wrong offset!");

// Class ModioUI.ModioCommonAuthViewBase
// 0x0020 (0x0448 - 0x0428)
class UModioCommonAuthViewBase : public UModioCommonActivatableWidget
{
public:
	TSubclassOf<class UModioCommonTermsOfUseViewBase> TermsOfUseViewClass;                               // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UModioCommonEmailAuthViewBase> EmailAuthViewClass;                                // 0x0430(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UModioCommonEmailAuthLoadingViewBase> EmailAuthLoadingViewClass;                         // 0x0438(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UModioCommonEmailAuthCodeViewBase> EmailAuthCodeViewBaseClass;                        // 0x0440(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonAuthViewBase">();
	}
	static class UModioCommonAuthViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonAuthViewBase>();
	}
};
static_assert(alignof(UModioCommonAuthViewBase) == 0x000008, "Wrong alignment on UModioCommonAuthViewBase");
static_assert(sizeof(UModioCommonAuthViewBase) == 0x000448, "Wrong size on UModioCommonAuthViewBase");
static_assert(offsetof(UModioCommonAuthViewBase, TermsOfUseViewClass) == 0x000428, "Member 'UModioCommonAuthViewBase::TermsOfUseViewClass' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthViewBase, EmailAuthViewClass) == 0x000430, "Member 'UModioCommonAuthViewBase::EmailAuthViewClass' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthViewBase, EmailAuthLoadingViewClass) == 0x000438, "Member 'UModioCommonAuthViewBase::EmailAuthLoadingViewClass' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthViewBase, EmailAuthCodeViewBaseClass) == 0x000440, "Member 'UModioCommonAuthViewBase::EmailAuthCodeViewBaseClass' has a wrong offset!");

// Class ModioUI.ModioCommonAuthView
// 0x0040 (0x0488 - 0x0448)
class UModioCommonAuthView : public UModioCommonAuthViewBase
{
public:
	uint8                                         Pad_448[0x10];                                     // 0x0448(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UModioCommonWidgetSwitcher*             AuthSwitcher;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonTermsOfUseViewBase*         TermsOfUseView;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonEmailAuthViewBase*          EmailAuthView;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonEmailAuthLoadingViewBase*   EmailAuthLoadingView;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonEmailAuthCodeViewBase*      EmailAuthCodeView;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAuthCancelled;                                    // 0x0480(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleEmailAuthCodeSent(const struct FModioErrorCode& errorCode);
	void HandleEmailAuthenticated(const struct FModioErrorCode& errorCode);
	void OnEmailAuthCodeViewBackClicked();
	void OnEmailAuthCodeViewCancelClicked();
	void OnEmailAuthCodeViewSubmitClicked(const class FString& AuthCode);
	void OnEmailAuthLoadingViewCancelClicked();
	void OnEmailAuthViewBackClicked();
	void OnEmailAuthViewCancelClicked();
	void OnEmailAuthViewSubmitClicked(const class FString& EmailAddress);
	void OnTermsOfUseViewCancelClicked();
	void OnTermsOfUseViewLinkClicked(const class FString& URL);
	void OnTermsOfUseViewSubmitClicked();
	void SetShowTermsOfView(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonAuthView">();
	}
	static class UModioCommonAuthView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonAuthView>();
	}
};
static_assert(alignof(UModioCommonAuthView) == 0x000008, "Wrong alignment on UModioCommonAuthView");
static_assert(sizeof(UModioCommonAuthView) == 0x000488, "Wrong size on UModioCommonAuthView");
static_assert(offsetof(UModioCommonAuthView, AuthSwitcher) == 0x000458, "Member 'UModioCommonAuthView::AuthSwitcher' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthView, TermsOfUseView) == 0x000460, "Member 'UModioCommonAuthView::TermsOfUseView' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthView, EmailAuthView) == 0x000468, "Member 'UModioCommonAuthView::EmailAuthView' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthView, EmailAuthLoadingView) == 0x000470, "Member 'UModioCommonAuthView::EmailAuthLoadingView' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthView, EmailAuthCodeView) == 0x000478, "Member 'UModioCommonAuthView::EmailAuthCodeView' has a wrong offset!");
static_assert(offsetof(UModioCommonAuthView, bAuthCancelled) == 0x000480, "Member 'UModioCommonAuthView::bAuthCancelled' has a wrong offset!");

// Class ModioUI.ModioCommonBorder
// 0x0010 (0x0360 - 0x0350)
class UModioCommonBorder final : public UCommonBorder
{
public:
	uint8                                         Pad_348[0x18];                                     // 0x0348(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FEventReply HandleOnMouseButtonDownEvent(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonBorder">();
	}
	static class UModioCommonBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonBorder>();
	}
};
static_assert(alignof(UModioCommonBorder) == 0x000010, "Wrong alignment on UModioCommonBorder");
static_assert(sizeof(UModioCommonBorder) == 0x000360, "Wrong size on UModioCommonBorder");

// Class ModioUI.ModioCommonBorderStyle
// 0x0000 (0x0120 - 0x0120)
class UModioCommonBorderStyle final : public UCommonBorderStyle
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonBorderStyle">();
	}
	static class UModioCommonBorderStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonBorderStyle>();
	}
};
static_assert(alignof(UModioCommonBorderStyle) == 0x000010, "Wrong alignment on UModioCommonBorderStyle");
static_assert(sizeof(UModioCommonBorderStyle) == 0x000120, "Wrong size on UModioCommonBorderStyle");

// Class ModioUI.ModioCommonBoundActionBar
// 0x0000 (0x0240 - 0x0240)
class UModioCommonBoundActionBar final : public UCommonBoundActionBar
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonBoundActionBar">();
	}
	static class UModioCommonBoundActionBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonBoundActionBar>();
	}
};
static_assert(alignof(UModioCommonBoundActionBar) == 0x000008, "Wrong alignment on UModioCommonBoundActionBar");
static_assert(sizeof(UModioCommonBoundActionBar) == 0x000240, "Wrong size on UModioCommonBoundActionBar");

// Class ModioUI.ModioCommonTabListWidgetBase
// 0x00A0 (0x0428 - 0x0388)
class UModioCommonTabListWidgetBase final : public UCommonTabListWidgetBase
{
public:
	uint8                                         Pad_388[0x18];                                     // 0x0388(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* TabButton)> OnTabButtonClicked;                                // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B0[0x18];                                     // 0x03B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x50];                                     // 0x03D8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleNavigateToNextTab();
	void HandleNavigateToPreviousTab();
	void OnTabSelectedInternal(class FName TabNameID);
	bool RegisterDynamicTab(const struct FModioCommonTabDescriptor& TabDescriptor);
	void RemoveAllDynamicTabs();
	bool SelectTabByIDExtended(class FName TabNameID, bool bSuppressClickFeedback, bool bSuppressOnTabSelectedIfAlreadySelected);
	void SetNextTabInputActionData(const struct FDataTableRowHandle& InNextTabInputActionData);
	void SetPreviousTabInputActionData(const struct FDataTableRowHandle& InPreviousTabInputActionData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonTabListWidgetBase">();
	}
	static class UModioCommonTabListWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonTabListWidgetBase>();
	}
};
static_assert(alignof(UModioCommonTabListWidgetBase) == 0x000008, "Wrong alignment on UModioCommonTabListWidgetBase");
static_assert(sizeof(UModioCommonTabListWidgetBase) == 0x000428, "Wrong size on UModioCommonTabListWidgetBase");
static_assert(offsetof(UModioCommonTabListWidgetBase, OnTabButtonClicked) == 0x0003A0, "Member 'UModioCommonTabListWidgetBase::OnTabButtonClicked' has a wrong offset!");
static_assert(offsetof(UModioCommonTabListWidgetBase, PreviousTabAction) == 0x0003C8, "Member 'UModioCommonTabListWidgetBase::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(UModioCommonTabListWidgetBase, NextTabAction) == 0x0003D0, "Member 'UModioCommonTabListWidgetBase::NextTabAction' has a wrong offset!");

// Class ModioUI.ModioCommonBoundActionButton
// 0x0000 (0x1710 - 0x1710)
class UModioCommonBoundActionButton final : public UCommonBoundActionButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonBoundActionButton">();
	}
	static class UModioCommonBoundActionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonBoundActionButton>();
	}
};
static_assert(alignof(UModioCommonBoundActionButton) == 0x000010, "Wrong alignment on UModioCommonBoundActionButton");
static_assert(sizeof(UModioCommonBoundActionButton) == 0x001710, "Wrong size on UModioCommonBoundActionButton");

// Class ModioUI.ModioCommonButtonBase
// 0x00A0 (0x1790 - 0x16F0)
class UModioCommonButtonBase : public UCommonButtonBase
{
public:
	class FText                                   OverrideActionDisplayName;                         // 0x16F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	bool                                          bShouldTriggerButtonClickOnEnterOrGamepadAccept;   // 0x1708(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1709[0x7];                                     // 0x1709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x1710(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bFocusOnHover;                                     // 0x1728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1729[0x7];                                     // 0x1729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModioCommonTextBlock*                  TextBlock;                                         // 0x1730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UModioCommonImage*                      Icon;                                              // 0x1738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseFocusReceived;                         // 0x1740(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnButtonBaseFocusLost;                             // 0x1750(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1760[0x18];                                    // 0x1760(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UModioCommonButtonStyle>    ModioDefaultStyleClass;                            // 0x1778(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClass*                                 ModioFocusedStyleClass;                            // 0x1780(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1788[0x8];                                     // 0x1788(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetButtonFocus();
	void SetLabel(const class FText& NewLabel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonButtonBase">();
	}
	static class UModioCommonButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonButtonBase>();
	}
};
static_assert(alignof(UModioCommonButtonBase) == 0x000010, "Wrong alignment on UModioCommonButtonBase");
static_assert(sizeof(UModioCommonButtonBase) == 0x001790, "Wrong size on UModioCommonButtonBase");
static_assert(offsetof(UModioCommonButtonBase, OverrideActionDisplayName) == 0x0016F0, "Member 'UModioCommonButtonBase::OverrideActionDisplayName' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, bShouldTriggerButtonClickOnEnterOrGamepadAccept) == 0x001708, "Member 'UModioCommonButtonBase::bShouldTriggerButtonClickOnEnterOrGamepadAccept' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, ButtonText) == 0x001710, "Member 'UModioCommonButtonBase::ButtonText' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, bFocusOnHover) == 0x001728, "Member 'UModioCommonButtonBase::bFocusOnHover' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, TextBlock) == 0x001730, "Member 'UModioCommonButtonBase::TextBlock' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, Icon) == 0x001738, "Member 'UModioCommonButtonBase::Icon' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, OnButtonBaseFocusReceived) == 0x001740, "Member 'UModioCommonButtonBase::OnButtonBaseFocusReceived' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, OnButtonBaseFocusLost) == 0x001750, "Member 'UModioCommonButtonBase::OnButtonBaseFocusLost' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, ModioDefaultStyleClass) == 0x001778, "Member 'UModioCommonButtonBase::ModioDefaultStyleClass' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonBase, ModioFocusedStyleClass) == 0x001780, "Member 'UModioCommonButtonBase::ModioFocusedStyleClass' has a wrong offset!");

// Class ModioUI.ModioCommonButtonStyle
// 0x0010 (0x08C0 - 0x08B0)
class UModioCommonButtonStyle : public UCommonButtonStyle
{
public:
	TSubclassOf<class UModioCommonImageStyle>     NormalIconStyle;                                   // 0x08B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UModioCommonImageStyle>     FocusedIconStyle;                                  // 0x08B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModioCommonButtonStyle">();
	}
	static class UModioCommonButtonStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModioCommonButtonStyle>();
	}
};
static_assert(alignof(UModioCommonButtonStyle) == 0x000010, "Wrong alignment on UModioCommonButtonStyle");
static_assert(sizeof(UModioCommonButtonStyle) == 0x0008C0, "Wrong size on UModioCommonButtonStyle");
static_assert(offsetof(UModioCommonButtonStyle, NormalIconStyle) == 0x0008B0, "Member 'UModioCommonButtonStyle::NormalIconStyle' has a wrong offset!");
static_assert(offsetof(UModioCommonButtonStyle, FocusedIconStyle) == 0x0008B8, "Member 'UModioCommonButtonStyle::FocusedIconStyle' has a wrong offset!");

// Class ModioUI.ModioCommonCheckBox
// 0x0040 (0x0E40 - 0x0E00)
class UModioCommonCheckBox final : public UCheckBox
{
public:
