#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModioUICore

#include "Basic.hpp"

#include "ModioUICore_structs.hpp"
#include "Modio_structs.hpp"


namespace SDK::Params
{

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModEnabled
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModEnabled) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModEnabled");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModEnabled) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModEnabled");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModEnabled, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModEnabled::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.HasModErrors
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_HasModErrors final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_HasModErrors) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_HasModErrors");
static_assert(sizeof(ModioExtendedModInfoUIDetails_HasModErrors) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_HasModErrors");
static_assert(offsetof(ModioExtendedModInfoUIDetails_HasModErrors, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_HasModErrors::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModDownloading
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModDownloading final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModDownloading) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModDownloading");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModDownloading) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModDownloading");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModDownloading, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModDownloading::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModExtracting
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModExtracting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModExtracting) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModExtracting");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModExtracting) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModExtracting");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModExtracting, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModExtracting::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModInQueue
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModInQueue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModInQueue) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModInQueue");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModInQueue) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModInQueue");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModInQueue, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModInQueue::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModInstalled
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModInstalled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModInstalled) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModInstalled");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModInstalled) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModInstalled");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModInstalled, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModInstalled::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioExtendedModInfoUIDetails.IsModSubscribed
// 0x0001 (0x0001 - 0x0000)
struct ModioExtendedModInfoUIDetails_IsModSubscribed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioExtendedModInfoUIDetails_IsModSubscribed) == 0x000001, "Wrong alignment on ModioExtendedModInfoUIDetails_IsModSubscribed");
static_assert(sizeof(ModioExtendedModInfoUIDetails_IsModSubscribed) == 0x000001, "Wrong size on ModioExtendedModInfoUIDetails_IsModSubscribed");
static_assert(offsetof(ModioExtendedModInfoUIDetails_IsModSubscribed, ReturnValue) == 0x000000, "Member 'ModioExtendedModInfoUIDetails_IsModSubscribed::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.GetIsCollectionModDisableUIEnabled
// 0x0001 (0x0001 - 0x0000)
struct ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled) == 0x000001, "Wrong alignment on ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled");
static_assert(sizeof(ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled) == 0x000001, "Wrong size on ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled");
static_assert(offsetof(ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled, ReturnValue) == 0x000000, "Member 'ModioModBrowserInterface_GetIsCollectionModDisableUIEnabled::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.IsDownloadDrawerOpen
// 0x0001 (0x0001 - 0x0000)
struct ModioModBrowserInterface_IsDownloadDrawerOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_IsDownloadDrawerOpen) == 0x000001, "Wrong alignment on ModioModBrowserInterface_IsDownloadDrawerOpen");
static_assert(sizeof(ModioModBrowserInterface_IsDownloadDrawerOpen) == 0x000001, "Wrong size on ModioModBrowserInterface_IsDownloadDrawerOpen");
static_assert(offsetof(ModioModBrowserInterface_IsDownloadDrawerOpen, ReturnValue) == 0x000000, "Member 'ModioModBrowserInterface_IsDownloadDrawerOpen::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.RequestExternalAuthentication
// 0x0001 (0x0001 - 0x0000)
struct ModioModBrowserInterface_RequestExternalAuthentication final
{
public:
	EModioAuthenticationProvider                  Provider;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_RequestExternalAuthentication) == 0x000001, "Wrong alignment on ModioModBrowserInterface_RequestExternalAuthentication");
static_assert(sizeof(ModioModBrowserInterface_RequestExternalAuthentication) == 0x000001, "Wrong size on ModioModBrowserInterface_RequestExternalAuthentication");
static_assert(offsetof(ModioModBrowserInterface_RequestExternalAuthentication, Provider) == 0x000000, "Member 'ModioModBrowserInterface_RequestExternalAuthentication::Provider' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.ShowDetailsForMod
// 0x0008 (0x0008 - 0x0000)
struct ModioModBrowserInterface_ShowDetailsForMod final
{
public:
	struct FModioModID                            ID;                                                // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_ShowDetailsForMod) == 0x000008, "Wrong alignment on ModioModBrowserInterface_ShowDetailsForMod");
static_assert(sizeof(ModioModBrowserInterface_ShowDetailsForMod) == 0x000008, "Wrong size on ModioModBrowserInterface_ShowDetailsForMod");
static_assert(offsetof(ModioModBrowserInterface_ShowDetailsForMod, ID) == 0x000000, "Member 'ModioModBrowserInterface_ShowDetailsForMod::ID' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.ShowDialog
// 0x0008 (0x0008 - 0x0000)
struct ModioModBrowserInterface_ShowDialog final
{
public:
	class UObject*                                DialogDataSource;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_ShowDialog) == 0x000008, "Wrong alignment on ModioModBrowserInterface_ShowDialog");
static_assert(sizeof(ModioModBrowserInterface_ShowDialog) == 0x000008, "Wrong size on ModioModBrowserInterface_ShowDialog");
static_assert(offsetof(ModioModBrowserInterface_ShowDialog, DialogDataSource) == 0x000000, "Member 'ModioModBrowserInterface_ShowDialog::DialogDataSource' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.ShowModUnsubscribeDialog
// 0x0008 (0x0008 - 0x0000)
struct ModioModBrowserInterface_ShowModUnsubscribeDialog final
{
public:
	class UObject*                                DialogDataSource;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_ShowModUnsubscribeDialog) == 0x000008, "Wrong alignment on ModioModBrowserInterface_ShowModUnsubscribeDialog");
static_assert(sizeof(ModioModBrowserInterface_ShowModUnsubscribeDialog) == 0x000008, "Wrong size on ModioModBrowserInterface_ShowModUnsubscribeDialog");
static_assert(offsetof(ModioModBrowserInterface_ShowModUnsubscribeDialog, DialogDataSource) == 0x000000, "Member 'ModioModBrowserInterface_ShowModUnsubscribeDialog::DialogDataSource' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.ShowReportMod
// 0x0008 (0x0008 - 0x0000)
struct ModioModBrowserInterface_ShowReportMod final
{
public:
	class UObject*                                DialogDataSource;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_ShowReportMod) == 0x000008, "Wrong alignment on ModioModBrowserInterface_ShowReportMod");
static_assert(sizeof(ModioModBrowserInterface_ShowReportMod) == 0x000008, "Wrong size on ModioModBrowserInterface_ShowReportMod");
static_assert(offsetof(ModioModBrowserInterface_ShowReportMod, DialogDataSource) == 0x000000, "Member 'ModioModBrowserInterface_ShowReportMod::DialogDataSource' has a wrong offset!");

// Function ModioUICore.ModioModBrowserInterface.ShowSearchResults
// 0x0060 (0x0060 - 0x0000)
struct ModioModBrowserInterface_ShowSearchResults final
{
public:
	struct FModioModCategoryParams                FilterParams;                                      // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModBrowserInterface_ShowSearchResults) == 0x000008, "Wrong alignment on ModioModBrowserInterface_ShowSearchResults");
static_assert(sizeof(ModioModBrowserInterface_ShowSearchResults) == 0x000060, "Wrong size on ModioModBrowserInterface_ShowSearchResults");
static_assert(offsetof(ModioModBrowserInterface_ShowSearchResults, FilterParams) == 0x000000, "Member 'ModioModBrowserInterface_ShowSearchResults::FilterParams' has a wrong offset!");

// Function ModioUICore.ModioModInfoUIDetails.GetFullModInfo
// 0x01E0 (0x01E0 - 0x0000)
struct ModioModInfoUIDetails_GetFullModInfo final
{
public:
	struct FModioModInfo                          ReturnValue;                                       // 0x0000(0x01E0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModInfoUIDetails_GetFullModInfo) == 0x000008, "Wrong alignment on ModioModInfoUIDetails_GetFullModInfo");
static_assert(sizeof(ModioModInfoUIDetails_GetFullModInfo) == 0x0001E0, "Wrong size on ModioModInfoUIDetails_GetFullModInfo");
static_assert(offsetof(ModioModInfoUIDetails_GetFullModInfo, ReturnValue) == 0x000000, "Member 'ModioModInfoUIDetails_GetFullModInfo::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioModInfoUIDetails.GetModID
// 0x0008 (0x0008 - 0x0000)
struct ModioModInfoUIDetails_GetModID final
{
public:
	struct FModioModID                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioModInfoUIDetails_GetModID) == 0x000008, "Wrong alignment on ModioModInfoUIDetails_GetModID");
static_assert(sizeof(ModioModInfoUIDetails_GetModID) == 0x000008, "Wrong size on ModioModInfoUIDetails_GetModID");
static_assert(offsetof(ModioModInfoUIDetails_GetModID, ReturnValue) == 0x000000, "Member 'ModioModInfoUIDetails_GetModID::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioUIAsyncHandlerWidget.LinkAsyncOperationWidget
// 0x0010 (0x0010 - 0x0000)
struct ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget final
{
public:
	TScriptInterface<class IModioUIAsyncOperationWidget> Widget;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget) == 0x000008, "Wrong alignment on ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget");
static_assert(sizeof(ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget) == 0x000010, "Wrong size on ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget");
static_assert(offsetof(ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget, Widget) == 0x000000, "Member 'ModioUIAsyncHandlerWidget_LinkAsyncOperationWidget::Widget' has a wrong offset!");

// Function ModioUICore.ModioUIAsyncHandlerWidget.GetAsyncOperationState
// 0x0001 (0x0001 - 0x0000)
struct ModioUIAsyncHandlerWidget_GetAsyncOperationState final
{
public:
	EModioUIAsyncOperationWidgetState             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAsyncHandlerWidget_GetAsyncOperationState) == 0x000001, "Wrong alignment on ModioUIAsyncHandlerWidget_GetAsyncOperationState");
static_assert(sizeof(ModioUIAsyncHandlerWidget_GetAsyncOperationState) == 0x000001, "Wrong size on ModioUIAsyncHandlerWidget_GetAsyncOperationState");
static_assert(offsetof(ModioUIAsyncHandlerWidget_GetAsyncOperationState, ReturnValue) == 0x000000, "Member 'ModioUIAsyncHandlerWidget_GetAsyncOperationState::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioUIAsyncOperationWidget.NotifyOperationState
// 0x0001 (0x0001 - 0x0000)
struct ModioUIAsyncOperationWidget_NotifyOperationState final
{
public:
	EModioUIAsyncOperationWidgetState             NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAsyncOperationWidget_NotifyOperationState) == 0x000001, "Wrong alignment on ModioUIAsyncOperationWidget_NotifyOperationState");
static_assert(sizeof(ModioUIAsyncOperationWidget_NotifyOperationState) == 0x000001, "Wrong size on ModioUIAsyncOperationWidget_NotifyOperationState");
static_assert(offsetof(ModioUIAsyncOperationWidget_NotifyOperationState, NewState) == 0x000000, "Member 'ModioUIAsyncOperationWidget_NotifyOperationState::NewState' has a wrong offset!");

// Function ModioUICore.ModioUIAsyncOperationWidget.SetOperationStateDelegate
// 0x0010 (0x0010 - 0x0000)
struct ModioUIAsyncOperationWidget_SetOperationStateDelegate final
{
public:
	TDelegate<void(EModioUIAsyncOperationWidgetState NewState)> Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAsyncOperationWidget_SetOperationStateDelegate) == 0x000004, "Wrong alignment on ModioUIAsyncOperationWidget_SetOperationStateDelegate");
static_assert(sizeof(ModioUIAsyncOperationWidget_SetOperationStateDelegate) == 0x000010, "Wrong size on ModioUIAsyncOperationWidget_SetOperationStateDelegate");
static_assert(offsetof(ModioUIAsyncOperationWidget_SetOperationStateDelegate, Delegate) == 0x000000, "Member 'ModioUIAsyncOperationWidget_SetOperationStateDelegate::Delegate' has a wrong offset!");

// Function ModioUICore.ModioUIAsyncRetryWidget.SetRetryRequestedDelegate
// 0x0010 (0x0010 - 0x0000)
struct ModioUIAsyncRetryWidget_SetRetryRequestedDelegate final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAsyncRetryWidget_SetRetryRequestedDelegate) == 0x000004, "Wrong alignment on ModioUIAsyncRetryWidget_SetRetryRequestedDelegate");
static_assert(sizeof(ModioUIAsyncRetryWidget_SetRetryRequestedDelegate) == 0x000010, "Wrong size on ModioUIAsyncRetryWidget_SetRetryRequestedDelegate");
static_assert(offsetof(ModioUIAsyncRetryWidget_SetRetryRequestedDelegate, Delegate) == 0x000000, "Member 'ModioUIAsyncRetryWidget_SetRetryRequestedDelegate::Delegate' has a wrong offset!");

// Function ModioUICore.ModioUIAuthenticationChangedReceiver.OnAuthenticationChanged
// 0x0048 (0x0048 - 0x0000)
struct ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged final
{
public:
	struct FModioOptionalUser                     User;                                              // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged) == 0x000008, "Wrong alignment on ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged");
static_assert(sizeof(ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged) == 0x000048, "Wrong size on ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged");
static_assert(offsetof(ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged, User) == 0x000000, "Member 'ModioUIAuthenticationChangedReceiver_OnAuthenticationChanged::User' has a wrong offset!");

// Function ModioUICore.ModioUIMediaDownloadCompletedReceiver.OnModCreatorAvatarDownloadCompleted
// 0x0028 (0x0028 - 0x0000)
struct ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        Ec;                                                // 0x0008(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioOptionalImage                    Image;                                             // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted) == 0x000008, "Wrong alignment on ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted");
static_assert(sizeof(ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted) == 0x000028, "Wrong size on ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted, ModId) == 0x000000, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted, Ec) == 0x000008, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted::Ec' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted, Image) == 0x000010, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModCreatorAvatarDownloadCompleted::Image' has a wrong offset!");

// Function ModioUICore.ModioUIMediaDownloadCompletedReceiver.OnModGalleryImageDownloadCompleted
// 0x0030 (0x0030 - 0x0000)
struct ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        Ec;                                                // 0x0008(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ImageIndex;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioOptionalImage                    Image;                                             // 0x0018(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted) == 0x000008, "Wrong alignment on ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted");
static_assert(sizeof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted) == 0x000030, "Wrong size on ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted, ModId) == 0x000000, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted, Ec) == 0x000008, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted::Ec' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted, ImageIndex) == 0x000010, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted::ImageIndex' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted, Image) == 0x000018, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModGalleryImageDownloadCompleted::Image' has a wrong offset!");

// Function ModioUICore.ModioUIMediaDownloadCompletedReceiver.OnModLogoDownloadCompleted
// 0x0030 (0x0030 - 0x0000)
struct ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        Ec;                                                // 0x0008(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioOptionalImage                    Image;                                             // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
	EModioLogoSize                                LogoSize;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted) == 0x000008, "Wrong alignment on ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted");
static_assert(sizeof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted) == 0x000030, "Wrong size on ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted, ModId) == 0x000000, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted, Ec) == 0x000008, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted::Ec' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted, Image) == 0x000010, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted::Image' has a wrong offset!");
static_assert(offsetof(ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted, LogoSize) == 0x000028, "Member 'ModioUIMediaDownloadCompletedReceiver_OnModLogoDownloadCompleted::LogoSize' has a wrong offset!");

// Function ModioUICore.ModioUIModEnableWidget.ModEnabledStateChangedHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUIModEnableWidget_ModEnabledStateChangedHandler final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewSubscriptionState;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioUIModEnableWidget_ModEnabledStateChangedHandler) == 0x000008, "Wrong alignment on ModioUIModEnableWidget_ModEnabledStateChangedHandler");
static_assert(sizeof(ModioUIModEnableWidget_ModEnabledStateChangedHandler) == 0x000010, "Wrong size on ModioUIModEnableWidget_ModEnabledStateChangedHandler");
static_assert(offsetof(ModioUIModEnableWidget_ModEnabledStateChangedHandler, ModId) == 0x000000, "Member 'ModioUIModEnableWidget_ModEnabledStateChangedHandler::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIModEnableWidget_ModEnabledStateChangedHandler, bNewSubscriptionState) == 0x000008, "Member 'ModioUIModEnableWidget_ModEnabledStateChangedHandler::bNewSubscriptionState' has a wrong offset!");

// Function ModioUICore.ModioUIModEnableWidget.OnModEnabledStateChanged
// 0x0010 (0x0010 - 0x0000)
struct ModioUIModEnableWidget_OnModEnabledStateChanged final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewSubscriptionState;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioUIModEnableWidget_OnModEnabledStateChanged) == 0x000008, "Wrong alignment on ModioUIModEnableWidget_OnModEnabledStateChanged");
static_assert(sizeof(ModioUIModEnableWidget_OnModEnabledStateChanged) == 0x000010, "Wrong size on ModioUIModEnableWidget_OnModEnabledStateChanged");
static_assert(offsetof(ModioUIModEnableWidget_OnModEnabledStateChanged, ModId) == 0x000000, "Member 'ModioUIModEnableWidget_OnModEnabledStateChanged::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIModEnableWidget_OnModEnabledStateChanged, bNewSubscriptionState) == 0x000008, "Member 'ModioUIModEnableWidget_OnModEnabledStateChanged::bNewSubscriptionState' has a wrong offset!");

// Function ModioUICore.ModioUIModInfoReceiver.OnListAllModsRequestCompleted
// 0x0048 (0x0048 - 0x0000)
struct ModioUIModInfoReceiver_OnListAllModsRequestCompleted final
{
public:
	class FString                                 RequestIdentifier;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        Ec;                                                // 0x0010(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioOptionalModInfoList              List;                                              // 0x0018(0x0030)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIModInfoReceiver_OnListAllModsRequestCompleted) == 0x000008, "Wrong alignment on ModioUIModInfoReceiver_OnListAllModsRequestCompleted");
static_assert(sizeof(ModioUIModInfoReceiver_OnListAllModsRequestCompleted) == 0x000048, "Wrong size on ModioUIModInfoReceiver_OnListAllModsRequestCompleted");
static_assert(offsetof(ModioUIModInfoReceiver_OnListAllModsRequestCompleted, RequestIdentifier) == 0x000000, "Member 'ModioUIModInfoReceiver_OnListAllModsRequestCompleted::RequestIdentifier' has a wrong offset!");
static_assert(offsetof(ModioUIModInfoReceiver_OnListAllModsRequestCompleted, Ec) == 0x000010, "Member 'ModioUIModInfoReceiver_OnListAllModsRequestCompleted::Ec' has a wrong offset!");
static_assert(offsetof(ModioUIModInfoReceiver_OnListAllModsRequestCompleted, List) == 0x000018, "Member 'ModioUIModInfoReceiver_OnListAllModsRequestCompleted::List' has a wrong offset!");

// Function ModioUICore.ModioUIModInfoReceiver.OnModInfoRequestCompleted
// 0x01F8 (0x01F8 - 0x0000)
struct ModioUIModInfoReceiver_OnModInfoRequestCompleted final
{
public:
	struct FModioModID                            ModId;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioErrorCode                        Ec;                                                // 0x0008(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioOptionalModInfo                  Info;                                              // 0x0010(0x01E8)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIModInfoReceiver_OnModInfoRequestCompleted) == 0x000008, "Wrong alignment on ModioUIModInfoReceiver_OnModInfoRequestCompleted");
static_assert(sizeof(ModioUIModInfoReceiver_OnModInfoRequestCompleted) == 0x0001F8, "Wrong size on ModioUIModInfoReceiver_OnModInfoRequestCompleted");
static_assert(offsetof(ModioUIModInfoReceiver_OnModInfoRequestCompleted, ModId) == 0x000000, "Member 'ModioUIModInfoReceiver_OnModInfoRequestCompleted::ModId' has a wrong offset!");
static_assert(offsetof(ModioUIModInfoReceiver_OnModInfoRequestCompleted, Ec) == 0x000008, "Member 'ModioUIModInfoReceiver_OnModInfoRequestCompleted::Ec' has a wrong offset!");
static_assert(offsetof(ModioUIModInfoReceiver_OnModInfoRequestCompleted, Info) == 0x000010, "Member 'ModioUIModInfoReceiver_OnModInfoRequestCompleted::Info' has a wrong offset!");

// Function ModioUICore.ModioUIModManagementEventReceiver.OnModManagementEvent
// 0x0018 (0x0018 - 0x0000)
struct ModioUIModManagementEventReceiver_OnModManagementEvent final
{
public:
	struct FModioModManagementEvent               Event;                                             // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUIModManagementEventReceiver_OnModManagementEvent) == 0x000008, "Wrong alignment on ModioUIModManagementEventReceiver_OnModManagementEvent");
static_assert(sizeof(ModioUIModManagementEventReceiver_OnModManagementEvent) == 0x000018, "Wrong size on ModioUIModManagementEventReceiver_OnModManagementEvent");
static_assert(offsetof(ModioUIModManagementEventReceiver_OnModManagementEvent, Event) == 0x000000, "Member 'ModioUIModManagementEventReceiver_OnModManagementEvent::Event' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.AddFormatText
// 0x0110 (0x0110 - 0x0000)
struct ModioNotificationParamsLibrary_AddFormatText final
{
public:
	struct FModioNotificationParams               NotificationParams;                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0078(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0080(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0098(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_AddFormatText) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_AddFormatText");
static_assert(sizeof(ModioNotificationParamsLibrary_AddFormatText) == 0x000110, "Wrong size on ModioNotificationParamsLibrary_AddFormatText");
static_assert(offsetof(ModioNotificationParamsLibrary_AddFormatText, NotificationParams) == 0x000000, "Member 'ModioNotificationParamsLibrary_AddFormatText::NotificationParams' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_AddFormatText, Name_0) == 0x000078, "Member 'ModioNotificationParamsLibrary_AddFormatText::Name_0' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_AddFormatText, Text) == 0x000080, "Member 'ModioNotificationParamsLibrary_AddFormatText::Text' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_AddFormatText, ReturnValue) == 0x000098, "Member 'ModioNotificationParamsLibrary_AddFormatText::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateInstallationNotification
// 0x0090 (0x0090 - 0x0000)
struct ModioNotificationParamsLibrary_CreateInstallationNotification final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModioModInfoUIDetails> ModInfo;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0018(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateInstallationNotification) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateInstallationNotification");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateInstallationNotification) == 0x000090, "Wrong size on ModioNotificationParamsLibrary_CreateInstallationNotification");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateInstallationNotification, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateInstallationNotification::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateInstallationNotification, ModInfo) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateInstallationNotification::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateInstallationNotification, ReturnValue) == 0x000018, "Member 'ModioNotificationParamsLibrary_CreateInstallationNotification::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateNotificationParams
// 0x00C8 (0x00C8 - 0x0000)
struct ModioNotificationParamsLibrary_CreateNotificationParams final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TitleText;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   SuccessText;                                       // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ErrorText;                                         // 0x0038(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0050(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateNotificationParams) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateNotificationParams");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateNotificationParams) == 0x0000C8, "Wrong size on ModioNotificationParamsLibrary_CreateNotificationParams");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateNotificationParams, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateNotificationParams::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateNotificationParams, TitleText) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateNotificationParams::TitleText' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateNotificationParams, SuccessText) == 0x000020, "Member 'ModioNotificationParamsLibrary_CreateNotificationParams::SuccessText' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateNotificationParams, ErrorText) == 0x000038, "Member 'ModioNotificationParamsLibrary_CreateNotificationParams::ErrorText' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateNotificationParams, ReturnValue) == 0x000050, "Member 'ModioNotificationParamsLibrary_CreateNotificationParams::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateRatingNotification
// 0x0090 (0x0090 - 0x0000)
struct ModioNotificationParamsLibrary_CreateRatingNotification final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModioModInfoUIDetails> ModInfo;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0018(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateRatingNotification) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateRatingNotification");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateRatingNotification) == 0x000090, "Wrong size on ModioNotificationParamsLibrary_CreateRatingNotification");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateRatingNotification, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateRatingNotification::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateRatingNotification, ModInfo) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateRatingNotification::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateRatingNotification, ReturnValue) == 0x000018, "Member 'ModioNotificationParamsLibrary_CreateRatingNotification::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateSubscriptionNotification
// 0x0090 (0x0090 - 0x0000)
struct ModioNotificationParamsLibrary_CreateSubscriptionNotification final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModioModInfoUIDetails> ModInfo;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0018(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateSubscriptionNotification) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateSubscriptionNotification");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateSubscriptionNotification) == 0x000090, "Wrong size on ModioNotificationParamsLibrary_CreateSubscriptionNotification");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateSubscriptionNotification, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateSubscriptionNotification::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateSubscriptionNotification, ModInfo) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateSubscriptionNotification::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateSubscriptionNotification, ReturnValue) == 0x000018, "Member 'ModioNotificationParamsLibrary_CreateSubscriptionNotification::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateUninstallNotification
// 0x0090 (0x0090 - 0x0000)
struct ModioNotificationParamsLibrary_CreateUninstallNotification final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModioModInfoUIDetails> ModInfo;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0018(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateUninstallNotification) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateUninstallNotification");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateUninstallNotification) == 0x000090, "Wrong size on ModioNotificationParamsLibrary_CreateUninstallNotification");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUninstallNotification, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateUninstallNotification::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUninstallNotification, ModInfo) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateUninstallNotification::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUninstallNotification, ReturnValue) == 0x000018, "Member 'ModioNotificationParamsLibrary_CreateUninstallNotification::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.CreateUnsubscriptionNotification
// 0x0090 (0x0090 - 0x0000)
struct ModioNotificationParamsLibrary_CreateUnsubscriptionNotification final
{
public:
	struct FModioErrorCode                        StatusCode;                                        // 0x0000(0x0008)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IModioModInfoUIDetails> ModInfo;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0018(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_CreateUnsubscriptionNotification) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_CreateUnsubscriptionNotification");
static_assert(sizeof(ModioNotificationParamsLibrary_CreateUnsubscriptionNotification) == 0x000090, "Wrong size on ModioNotificationParamsLibrary_CreateUnsubscriptionNotification");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUnsubscriptionNotification, StatusCode) == 0x000000, "Member 'ModioNotificationParamsLibrary_CreateUnsubscriptionNotification::StatusCode' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUnsubscriptionNotification, ModInfo) == 0x000008, "Member 'ModioNotificationParamsLibrary_CreateUnsubscriptionNotification::ModInfo' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_CreateUnsubscriptionNotification, ReturnValue) == 0x000018, "Member 'ModioNotificationParamsLibrary_CreateUnsubscriptionNotification::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.SetFloatArg
// 0x0108 (0x0108 - 0x0000)
struct ModioNotificationParamsLibrary_SetFloatArg final
{
public:
	struct FModioNotificationParams               NotificationParams;                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioNotificationParams               ReturnValue;                                       // 0x0090(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_SetFloatArg) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_SetFloatArg");
static_assert(sizeof(ModioNotificationParamsLibrary_SetFloatArg) == 0x000108, "Wrong size on ModioNotificationParamsLibrary_SetFloatArg");
static_assert(offsetof(ModioNotificationParamsLibrary_SetFloatArg, NotificationParams) == 0x000000, "Member 'ModioNotificationParamsLibrary_SetFloatArg::NotificationParams' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetFloatArg, Name_0) == 0x000078, "Member 'ModioNotificationParamsLibrary_SetFloatArg::Name_0' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetFloatArg, Value) == 0x000088, "Member 'ModioNotificationParamsLibrary_SetFloatArg::Value' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetFloatArg, ReturnValue) == 0x000090, "Member 'ModioNotificationParamsLibrary_SetFloatArg::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.SetIntegerArg
// 0x0108 (0x0108 - 0x0000)
struct ModioNotificationParamsLibrary_SetIntegerArg final
{
public:
	struct FModioNotificationParams               NotificationParams;                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModioNotificationParams               ReturnValue;                                       // 0x0090(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_SetIntegerArg) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_SetIntegerArg");
static_assert(sizeof(ModioNotificationParamsLibrary_SetIntegerArg) == 0x000108, "Wrong size on ModioNotificationParamsLibrary_SetIntegerArg");
static_assert(offsetof(ModioNotificationParamsLibrary_SetIntegerArg, NotificationParams) == 0x000000, "Member 'ModioNotificationParamsLibrary_SetIntegerArg::NotificationParams' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetIntegerArg, Name_0) == 0x000078, "Member 'ModioNotificationParamsLibrary_SetIntegerArg::Name_0' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetIntegerArg, Value) == 0x000088, "Member 'ModioNotificationParamsLibrary_SetIntegerArg::Value' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetIntegerArg, ReturnValue) == 0x000090, "Member 'ModioNotificationParamsLibrary_SetIntegerArg::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.SetStringArg
// 0x0110 (0x0110 - 0x0000)
struct ModioNotificationParamsLibrary_SetStringArg final
{
public:
	struct FModioNotificationParams               NotificationParams;                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0088(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x0098(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_SetStringArg) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_SetStringArg");
static_assert(sizeof(ModioNotificationParamsLibrary_SetStringArg) == 0x000110, "Wrong size on ModioNotificationParamsLibrary_SetStringArg");
static_assert(offsetof(ModioNotificationParamsLibrary_SetStringArg, NotificationParams) == 0x000000, "Member 'ModioNotificationParamsLibrary_SetStringArg::NotificationParams' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetStringArg, Name_0) == 0x000078, "Member 'ModioNotificationParamsLibrary_SetStringArg::Name_0' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetStringArg, Value) == 0x000088, "Member 'ModioNotificationParamsLibrary_SetStringArg::Value' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetStringArg, ReturnValue) == 0x000098, "Member 'ModioNotificationParamsLibrary_SetStringArg::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioNotificationParamsLibrary.SetTextArg
// 0x0118 (0x0118 - 0x0000)
struct ModioNotificationParamsLibrary_SetTextArg final
{
public:
	struct FModioNotificationParams               NotificationParams;                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0088(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FModioNotificationParams               ReturnValue;                                       // 0x00A0(0x0078)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioNotificationParamsLibrary_SetTextArg) == 0x000008, "Wrong alignment on ModioNotificationParamsLibrary_SetTextArg");
static_assert(sizeof(ModioNotificationParamsLibrary_SetTextArg) == 0x000118, "Wrong size on ModioNotificationParamsLibrary_SetTextArg");
static_assert(offsetof(ModioNotificationParamsLibrary_SetTextArg, NotificationParams) == 0x000000, "Member 'ModioNotificationParamsLibrary_SetTextArg::NotificationParams' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetTextArg, Name_0) == 0x000078, "Member 'ModioNotificationParamsLibrary_SetTextArg::Name_0' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetTextArg, Text) == 0x000088, "Member 'ModioNotificationParamsLibrary_SetTextArg::Text' has a wrong offset!");
static_assert(offsetof(ModioNotificationParamsLibrary_SetTextArg, ReturnValue) == 0x0000A0, "Member 'ModioNotificationParamsLibrary_SetTextArg::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioUINotification.Configure
// 0x0078 (0x0078 - 0x0000)
struct ModioUINotification_Configure final
{
public:
	struct FModioNotificationParams               Params_0;                                          // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUINotification_Configure) == 0x000008, "Wrong alignment on ModioUINotification_Configure");
static_assert(sizeof(ModioUINotification_Configure) == 0x000078, "Wrong size on ModioUINotification_Configure");
static_assert(offsetof(ModioUINotification_Configure, Params_0) == 0x000000, "Member 'ModioUINotification_Configure::Params_0' has a wrong offset!");

// Function ModioUICore.ModioUINotification.ConfigureManual
// 0x0038 (0x0038 - 0x0000)
struct ModioUINotification_ConfigureManual final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsError;                                          // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModioUINotification_ConfigureManual) == 0x000008, "Wrong alignment on ModioUINotification_ConfigureManual");
static_assert(sizeof(ModioUINotification_ConfigureManual) == 0x000038, "Wrong size on ModioUINotification_ConfigureManual");
static_assert(offsetof(ModioUINotification_ConfigureManual, Title) == 0x000000, "Member 'ModioUINotification_ConfigureManual::Title' has a wrong offset!");
static_assert(offsetof(ModioUINotification_ConfigureManual, Message) == 0x000018, "Member 'ModioUINotification_ConfigureManual::Message' has a wrong offset!");
static_assert(offsetof(ModioUINotification_ConfigureManual, bIsError) == 0x000030, "Member 'ModioUINotification_ConfigureManual::bIsError' has a wrong offset!");

// Function ModioUICore.ModioUINotification.GetAsWidget
// 0x0008 (0x0008 - 0x0000)
struct ModioUINotification_GetAsWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUINotification_GetAsWidget) == 0x000008, "Wrong alignment on ModioUINotification_GetAsWidget");
static_assert(sizeof(ModioUINotification_GetAsWidget) == 0x000008, "Wrong size on ModioUINotification_GetAsWidget");
static_assert(offsetof(ModioUINotification_GetAsWidget, ReturnValue) == 0x000000, "Member 'ModioUINotification_GetAsWidget::ReturnValue' has a wrong offset!");

// Function ModioUICore.ModioUINotification.SetNotificationExpireHandler
// 0x0010 (0x0010 - 0x0000)
struct ModioUINotification_SetNotificationExpireHandler final
{
public:
	TDelegate<void(class UWidget* NotificationWidget)> InDelegate;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModioUINotification_SetNotificationExpireHandler) == 0x000004, "Wrong alignment on ModioUINotification_SetNotificationExpireHandler");
static_assert(sizeof(ModioUINotification_SetNotificationExpireHandler) == 0x000010, "Wrong size on ModioUINotification_SetNotificationExpireHandler");
static_assert(offsetof(ModioUINotification_SetNotificationExpireHandler, InDelegate) == 0x000000, "Member 'ModioUINotification_SetNotificationExpireHandler::InDelegate' has a wrong offset!");

// Function ModioUICore.ModioUINotificationController.DisplayNotification
