#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LightPresset_Radius

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_LightPresset_Radius.S_LightPresset_Radius
// 0x0048 (0x0048 - 0x0000)
struct FS_LightPresset_Radius final
{
public:
	class FName                                   PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_24_B7457FA4450E0594B8730DB897C90029;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissivePower_31_CAC08C9540A7712284335A8736B80B6E; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveIntensity_60_AA01FE2D444453FC85956D91D5670198; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GlowIntensity_65_F8EE94514C4C4FE78820FD86D3984FA1; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LightPresset_Radius) == 0x000008, "Wrong alignment on FS_LightPresset_Radius");
static_assert(sizeof(FS_LightPresset_Radius) == 0x000048, "Wrong size on FS_LightPresset_Radius");
static_assert(offsetof(FS_LightPresset_Radius, PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA) == 0x000000, "Member 'FS_LightPresset_Radius::PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, Intensity_24_B7457FA4450E0594B8730DB897C90029) == 0x000008, "Member 'FS_LightPresset_Radius::Intensity_24_B7457FA4450E0594B8730DB897C90029' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09) == 0x000010, "Member 'FS_LightPresset_Radius::AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166) == 0x000018, "Member 'FS_LightPresset_Radius::EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, EmissivePower_31_CAC08C9540A7712284335A8736B80B6E) == 0x000020, "Member 'FS_LightPresset_Radius::EmissivePower_31_CAC08C9540A7712284335A8736B80B6E' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C) == 0x000028, "Member 'FS_LightPresset_Radius::LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D) == 0x000030, "Member 'FS_LightPresset_Radius::LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, EmissiveIntensity_60_AA01FE2D444453FC85956D91D5670198) == 0x000038, "Member 'FS_LightPresset_Radius::EmissiveIntensity_60_AA01FE2D444453FC85956D91D5670198' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Radius, GlowIntensity_65_F8EE94514C4C4FE78820FD86D3984FA1) == 0x000040, "Member 'FS_LightPresset_Radius::GlowIntensity_65_F8EE94514C4C4FE78820FD86D3984FA1' has a wrong offset!");

}

