#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LightPresset_Color

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LightPresset_Color.S_LightPresset_Color
// 0x0050 (0x0050 - 0x0000)
struct FS_LightPresset_Color final
{
public:
	class FName                                   PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temperature_27_AD29837C45EFC7D318D691917DB22001;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_51_D85CA13646FF6D9681BFD48E9D070768;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GlowColor_64_3C5DC90349D376BE8217D887574F7378;     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LightPresset_Color) == 0x000008, "Wrong alignment on FS_LightPresset_Color");
static_assert(sizeof(FS_LightPresset_Color) == 0x000050, "Wrong size on FS_LightPresset_Color");
static_assert(offsetof(FS_LightPresset_Color, PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA) == 0x000000, "Member 'FS_LightPresset_Color::PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Color, Temperature_27_AD29837C45EFC7D318D691917DB22001) == 0x000008, "Member 'FS_LightPresset_Color::Temperature_27_AD29837C45EFC7D318D691917DB22001' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Color, LightColor_51_D85CA13646FF6D9681BFD48E9D070768) == 0x000010, "Member 'FS_LightPresset_Color::LightColor_51_D85CA13646FF6D9681BFD48E9D070768' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Color, EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B) == 0x000020, "Member 'FS_LightPresset_Color::EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Color, LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2) == 0x000030, "Member 'FS_LightPresset_Color::LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2' has a wrong offset!");
static_assert(offsetof(FS_LightPresset_Color, GlowColor_64_3C5DC90349D376BE8217D887574F7378) == 0x000040, "Member 'FS_LightPresset_Color::GlowColor_64_3C5DC90349D376BE8217D887574F7378' has a wrong offset!");

}

