#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LightPresset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_LightPresset.S_LightPresset
// 0x0090 (0x0090 - 0x0000)
struct FS_LightPresset final
{
public:
	class FName                                   PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity_24_B7457FA4450E0594B8730DB897C90029;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor_51_D85CA13646FF6D9681BFD48E9D070768;    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temperature_27_AD29837C45EFC7D318D691917DB22001;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissivePower_31_CAC08C9540A7712284335A8736B80B6E; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveIntensity_62_F7CB52AD49DADA90F0CACBA7230567A8; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GlowColor_65_09D495DF45FF83D9D2CF9EA41DF7A1C3;     // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GlowIntensity_64_1515650F49BCC0C0A42F0BA645DAFAD7; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LightPresset) == 0x000008, "Wrong alignment on FS_LightPresset");
static_assert(sizeof(FS_LightPresset) == 0x000090, "Wrong size on FS_LightPresset");
static_assert(offsetof(FS_LightPresset, PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA) == 0x000000, "Member 'FS_LightPresset::PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, Intensity_24_B7457FA4450E0594B8730DB897C90029) == 0x000008, "Member 'FS_LightPresset::Intensity_24_B7457FA4450E0594B8730DB897C90029' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, LightColor_51_D85CA13646FF6D9681BFD48E9D070768) == 0x000010, "Member 'FS_LightPresset::LightColor_51_D85CA13646FF6D9681BFD48E9D070768' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09) == 0x000020, "Member 'FS_LightPresset::AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, Temperature_27_AD29837C45EFC7D318D691917DB22001) == 0x000028, "Member 'FS_LightPresset::Temperature_27_AD29837C45EFC7D318D691917DB22001' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B) == 0x000030, "Member 'FS_LightPresset::EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166) == 0x000040, "Member 'FS_LightPresset::EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, EmissivePower_31_CAC08C9540A7712284335A8736B80B6E) == 0x000048, "Member 'FS_LightPresset::EmissivePower_31_CAC08C9540A7712284335A8736B80B6E' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2) == 0x000050, "Member 'FS_LightPresset::LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C) == 0x000060, "Member 'FS_LightPresset::LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D) == 0x000068, "Member 'FS_LightPresset::LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, EmissiveIntensity_62_F7CB52AD49DADA90F0CACBA7230567A8) == 0x000070, "Member 'FS_LightPresset::EmissiveIntensity_62_F7CB52AD49DADA90F0CACBA7230567A8' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, GlowColor_65_09D495DF45FF83D9D2CF9EA41DF7A1C3) == 0x000078, "Member 'FS_LightPresset::GlowColor_65_09D495DF45FF83D9D2CF9EA41DF7A1C3' has a wrong offset!");
static_assert(offsetof(FS_LightPresset, GlowIntensity_64_1515650F49BCC0C0A42F0BA645DAFAD7) == 0x000088, "Member 'FS_LightPresset::GlowIntensity_64_1515650F49BCC0C0A42F0BA645DAFAD7' has a wrong offset!");

}

