#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SectorSelector

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SectorSelector.SectorSelectionHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FSectorSelectionHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSectorSelectionHandle) == 0x000004, "Wrong alignment on FSectorSelectionHandle");
static_assert(sizeof(FSectorSelectionHandle) == 0x000004, "Wrong size on FSectorSelectionHandle");

// ScriptStruct SectorSelector.SelectedSector
// 0x0010 (0x0010 - 0x0000)
struct FSelectedSector final
{
public:
	int64                                         BitmaskOfOccupiedSectorIDs;                        // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSelectedSector) == 0x000008, "Wrong alignment on FSelectedSector");
static_assert(sizeof(FSelectedSector) == 0x000010, "Wrong size on FSelectedSector");
static_assert(offsetof(FSelectedSector, BitmaskOfOccupiedSectorIDs) == 0x000000, "Member 'FSelectedSector::BitmaskOfOccupiedSectorIDs' has a wrong offset!");

}

