#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stalker2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Stalker2_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Niagara_structs.hpp"
#include "InputCore_structs.hpp"
#include "CinematicKeyFrameTracks_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Stalker2.CustomConsoleManagerMH.XRemoveEffectFromPlayer
// 0x0010 (0x0010 - 0x0000)
struct CustomConsoleManagerMH_XRemoveEffectFromPlayer final
{
public:
	class FString                                 EffectPrototypeSID;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomConsoleManagerMH_XRemoveEffectFromPlayer) == 0x000008, "Wrong alignment on CustomConsoleManagerMH_XRemoveEffectFromPlayer");
static_assert(sizeof(CustomConsoleManagerMH_XRemoveEffectFromPlayer) == 0x000010, "Wrong size on CustomConsoleManagerMH_XRemoveEffectFromPlayer");
static_assert(offsetof(CustomConsoleManagerMH_XRemoveEffectFromPlayer, EffectPrototypeSID) == 0x000000, "Member 'CustomConsoleManagerMH_XRemoveEffectFromPlayer::EffectPrototypeSID' has a wrong offset!");

// Function Stalker2.CustomConsoleManagerMH.XSetFov
// 0x0004 (0x0004 - 0x0000)
struct CustomConsoleManagerMH_XSetFov final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomConsoleManagerMH_XSetFov) == 0x000004, "Wrong alignment on CustomConsoleManagerMH_XSetFov");
static_assert(sizeof(CustomConsoleManagerMH_XSetFov) == 0x000004, "Wrong size on CustomConsoleManagerMH_XSetFov");
static_assert(offsetof(CustomConsoleManagerMH_XSetFov, FOV) == 0x000000, "Member 'CustomConsoleManagerMH_XSetFov::FOV' has a wrong offset!");

// Function Stalker2.CustomConsoleManagerMH.XToggleCustomFov
// 0x0001 (0x0001 - 0x0000)
struct CustomConsoleManagerMH_XToggleCustomFov final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomConsoleManagerMH_XToggleCustomFov) == 0x000001, "Wrong alignment on CustomConsoleManagerMH_XToggleCustomFov");
static_assert(sizeof(CustomConsoleManagerMH_XToggleCustomFov) == 0x000001, "Wrong size on CustomConsoleManagerMH_XToggleCustomFov");
static_assert(offsetof(CustomConsoleManagerMH_XToggleCustomFov, bEnable) == 0x000000, "Member 'CustomConsoleManagerMH_XToggleCustomFov::bEnable' has a wrong offset!");

// Function Stalker2.CustomConsoleManagerMH.XToggleHubDoors
// 0x0008 (0x0008 - 0x0000)
struct CustomConsoleManagerMH_XToggleHubDoors final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomConsoleManagerMH_XToggleHubDoors) == 0x000004, "Wrong alignment on CustomConsoleManagerMH_XToggleHubDoors");
static_assert(sizeof(CustomConsoleManagerMH_XToggleHubDoors) == 0x000008, "Wrong size on CustomConsoleManagerMH_XToggleHubDoors");
static_assert(offsetof(CustomConsoleManagerMH_XToggleHubDoors, bLocked) == 0x000000, "Member 'CustomConsoleManagerMH_XToggleHubDoors::bLocked' has a wrong offset!");
static_assert(offsetof(CustomConsoleManagerMH_XToggleHubDoors, Radius) == 0x000004, "Member 'CustomConsoleManagerMH_XToggleHubDoors::Radius' has a wrong offset!");

// Function Stalker2.CustomConsoleManagerMH.XApplyMainHandWeaponUpgradeBySID
// 0x0010 (0x0010 - 0x0000)
struct CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID final
{
public:
	class FString                                 UpgradePrototypeSID;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID) == 0x000008, "Wrong alignment on CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID");
static_assert(sizeof(CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID) == 0x000010, "Wrong size on CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID");
static_assert(offsetof(CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID, UpgradePrototypeSID) == 0x000000, "Member 'CustomConsoleManagerMH_XApplyMainHandWeaponUpgradeBySID::UpgradePrototypeSID' has a wrong offset!");

// Function Stalker2.AbstractProgressBar.SetProgressValue
// 0x0004 (0x0004 - 0x0000)
struct AbstractProgressBar_SetProgressValue final
{
public:
	float                                         InProgress;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbstractProgressBar_SetProgressValue) == 0x000004, "Wrong alignment on AbstractProgressBar_SetProgressValue");
static_assert(sizeof(AbstractProgressBar_SetProgressValue) == 0x000004, "Wrong size on AbstractProgressBar_SetProgressValue");
static_assert(offsetof(AbstractProgressBar_SetProgressValue, InProgress) == 0x000000, "Member 'AbstractProgressBar_SetProgressValue::InProgress' has a wrong offset!");

// Function Stalker2.AchievementTrigger.OnBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct AchievementTrigger_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AchievementTrigger_OnBeginOverlap) == 0x000008, "Wrong alignment on AchievementTrigger_OnBeginOverlap");
static_assert(sizeof(AchievementTrigger_OnBeginOverlap) == 0x000108, "Wrong size on AchievementTrigger_OnBeginOverlap");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, OverlappedComp) == 0x000000, "Member 'AchievementTrigger_OnBeginOverlap::OverlappedComp' has a wrong offset!");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, Other) == 0x000008, "Member 'AchievementTrigger_OnBeginOverlap::Other' has a wrong offset!");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, OtherComp) == 0x000010, "Member 'AchievementTrigger_OnBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'AchievementTrigger_OnBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, bFromSweep) == 0x00001C, "Member 'AchievementTrigger_OnBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(AchievementTrigger_OnBeginOverlap, SweepResult) == 0x000020, "Member 'AchievementTrigger_OnBeginOverlap::SweepResult' has a wrong offset!");

// Function Stalker2.ActionBlockerConditionBase.CanTrigger
// 0x0001 (0x0001 - 0x0000)
struct ActionBlockerConditionBase_CanTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActionBlockerConditionBase_CanTrigger) == 0x000001, "Wrong alignment on ActionBlockerConditionBase_CanTrigger");
static_assert(sizeof(ActionBlockerConditionBase_CanTrigger) == 0x000001, "Wrong size on ActionBlockerConditionBase_CanTrigger");
static_assert(offsetof(ActionBlockerConditionBase_CanTrigger, ReturnValue) == 0x000000, "Member 'ActionBlockerConditionBase_CanTrigger::ReturnValue' has a wrong offset!");

// Function Stalker2.Obj.OnHit
// 0x0110 (0x0110 - 0x0000)
struct Obj_OnHit final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(Obj_OnHit) == 0x000008, "Wrong alignment on Obj_OnHit");
static_assert(sizeof(Obj_OnHit) == 0x000110, "Wrong size on Obj_OnHit");
static_assert(offsetof(Obj_OnHit, SelfActor) == 0x000000, "Member 'Obj_OnHit::SelfActor' has a wrong offset!");
static_assert(offsetof(Obj_OnHit, OtherActor) == 0x000008, "Member 'Obj_OnHit::OtherActor' has a wrong offset!");
static_assert(offsetof(Obj_OnHit, NormalImpulse) == 0x000010, "Member 'Obj_OnHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Obj_OnHit, Hit) == 0x000028, "Member 'Obj_OnHit::Hit' has a wrong offset!");

// DelegateFunction Stalker2.Obj.OnObjTurnedToTarget__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Obj_OnObjTurnedToTarget__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Obj_OnObjTurnedToTarget__DelegateSignature) == 0x000001, "Wrong alignment on Obj_OnObjTurnedToTarget__DelegateSignature");
static_assert(sizeof(Obj_OnObjTurnedToTarget__DelegateSignature) == 0x000001, "Wrong size on Obj_OnObjTurnedToTarget__DelegateSignature");
static_assert(offsetof(Obj_OnObjTurnedToTarget__DelegateSignature, bSuccess) == 0x000000, "Member 'Obj_OnObjTurnedToTarget__DelegateSignature::bSuccess' has a wrong offset!");

// Function Stalker2.Obj.StartCutsceneSequence
// 0x0020 (0x0020 - 0x0000)
struct Obj_StartCutsceneSequence final
{
public:
	const class AActor*                           SynchronizationPoint;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OverrideRotation;                                  // 0x0008(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Obj_StartCutsceneSequence) == 0x000008, "Wrong alignment on Obj_StartCutsceneSequence");
static_assert(sizeof(Obj_StartCutsceneSequence) == 0x000020, "Wrong size on Obj_StartCutsceneSequence");
static_assert(offsetof(Obj_StartCutsceneSequence, SynchronizationPoint) == 0x000000, "Member 'Obj_StartCutsceneSequence::SynchronizationPoint' has a wrong offset!");
static_assert(offsetof(Obj_StartCutsceneSequence, OverrideRotation) == 0x000008, "Member 'Obj_StartCutsceneSequence::OverrideRotation' has a wrong offset!");

// Function Stalker2.Agent.DestroyDamageInteractParticle
// 0x0008 (0x0008 - 0x0000)
struct Agent_DestroyDamageInteractParticle final
{
public:
	class UNiagaraComponent*                      ParticleSystem;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_DestroyDamageInteractParticle) == 0x000008, "Wrong alignment on Agent_DestroyDamageInteractParticle");
static_assert(sizeof(Agent_DestroyDamageInteractParticle) == 0x000008, "Wrong size on Agent_DestroyDamageInteractParticle");
static_assert(offsetof(Agent_DestroyDamageInteractParticle, ParticleSystem) == 0x000000, "Member 'Agent_DestroyDamageInteractParticle::ParticleSystem' has a wrong offset!");

// Function Stalker2.Agent.PsyNPCInteractionStarted
// 0x0008 (0x0008 - 0x0000)
struct Agent_PsyNPCInteractionStarted final
{
public:
	class AObj*                                   InteractActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_PsyNPCInteractionStarted) == 0x000008, "Wrong alignment on Agent_PsyNPCInteractionStarted");
static_assert(sizeof(Agent_PsyNPCInteractionStarted) == 0x000008, "Wrong size on Agent_PsyNPCInteractionStarted");
static_assert(offsetof(Agent_PsyNPCInteractionStarted, InteractActor) == 0x000000, "Member 'Agent_PsyNPCInteractionStarted::InteractActor' has a wrong offset!");

// Function Stalker2.Agent.GetSpawnSource
// 0x0001 (0x0001 - 0x0000)
struct Agent_GetSpawnSource final
{
public:
	ESpawnSource                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_GetSpawnSource) == 0x000001, "Wrong alignment on Agent_GetSpawnSource");
static_assert(sizeof(Agent_GetSpawnSource) == 0x000001, "Wrong size on Agent_GetSpawnSource");
static_assert(offsetof(Agent_GetSpawnSource, ReturnValue) == 0x000000, "Member 'Agent_GetSpawnSource::ReturnValue' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneBlinkProfile
// 0x0001 (0x0001 - 0x0000)
struct Agent_SetCutsceneBlinkProfile final
{
public:
	ECutsceneBlinkProfile                         NewCutsceneBlinkProfile;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneBlinkProfile) == 0x000001, "Wrong alignment on Agent_SetCutsceneBlinkProfile");
static_assert(sizeof(Agent_SetCutsceneBlinkProfile) == 0x000001, "Wrong size on Agent_SetCutsceneBlinkProfile");
static_assert(offsetof(Agent_SetCutsceneBlinkProfile, NewCutsceneBlinkProfile) == 0x000000, "Member 'Agent_SetCutsceneBlinkProfile::NewCutsceneBlinkProfile' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneEyesIdleProfile
// 0x0001 (0x0001 - 0x0000)
struct Agent_SetCutsceneEyesIdleProfile final
{
public:
	ECutsceneEyesIdleProfile                      NewCutsceneEyesIdleProfile;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneEyesIdleProfile) == 0x000001, "Wrong alignment on Agent_SetCutsceneEyesIdleProfile");
static_assert(sizeof(Agent_SetCutsceneEyesIdleProfile) == 0x000001, "Wrong size on Agent_SetCutsceneEyesIdleProfile");
static_assert(offsetof(Agent_SetCutsceneEyesIdleProfile, NewCutsceneEyesIdleProfile) == 0x000000, "Member 'Agent_SetCutsceneEyesIdleProfile::NewCutsceneEyesIdleProfile' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneEyesLookAtWeight
// 0x0004 (0x0004 - 0x0000)
struct Agent_SetCutsceneEyesLookAtWeight final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneEyesLookAtWeight) == 0x000004, "Wrong alignment on Agent_SetCutsceneEyesLookAtWeight");
static_assert(sizeof(Agent_SetCutsceneEyesLookAtWeight) == 0x000004, "Wrong size on Agent_SetCutsceneEyesLookAtWeight");
static_assert(offsetof(Agent_SetCutsceneEyesLookAtWeight, Weight) == 0x000000, "Member 'Agent_SetCutsceneEyesLookAtWeight::Weight' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneHeadLookAtWeight
// 0x0004 (0x0004 - 0x0000)
struct Agent_SetCutsceneHeadLookAtWeight final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneHeadLookAtWeight) == 0x000004, "Wrong alignment on Agent_SetCutsceneHeadLookAtWeight");
static_assert(sizeof(Agent_SetCutsceneHeadLookAtWeight) == 0x000004, "Wrong size on Agent_SetCutsceneHeadLookAtWeight");
static_assert(offsetof(Agent_SetCutsceneHeadLookAtWeight, Weight) == 0x000000, "Member 'Agent_SetCutsceneHeadLookAtWeight::Weight' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneLookAtActor
// 0x0008 (0x0008 - 0x0000)
struct Agent_SetCutsceneLookAtActor final
{
public:
	const class AActor*                           Value;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneLookAtActor) == 0x000008, "Wrong alignment on Agent_SetCutsceneLookAtActor");
static_assert(sizeof(Agent_SetCutsceneLookAtActor) == 0x000008, "Wrong size on Agent_SetCutsceneLookAtActor");
static_assert(offsetof(Agent_SetCutsceneLookAtActor, Value) == 0x000000, "Member 'Agent_SetCutsceneLookAtActor::Value' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneProceduralEyesAmplitude
// 0x0004 (0x0004 - 0x0000)
struct Agent_SetCutsceneProceduralEyesAmplitude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneProceduralEyesAmplitude) == 0x000004, "Wrong alignment on Agent_SetCutsceneProceduralEyesAmplitude");
static_assert(sizeof(Agent_SetCutsceneProceduralEyesAmplitude) == 0x000004, "Wrong size on Agent_SetCutsceneProceduralEyesAmplitude");
static_assert(offsetof(Agent_SetCutsceneProceduralEyesAmplitude, Value) == 0x000000, "Member 'Agent_SetCutsceneProceduralEyesAmplitude::Value' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneProceduralEyesIntensity
// 0x0004 (0x0004 - 0x0000)
struct Agent_SetCutsceneProceduralEyesIntensity final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneProceduralEyesIntensity) == 0x000004, "Wrong alignment on Agent_SetCutsceneProceduralEyesIntensity");
static_assert(sizeof(Agent_SetCutsceneProceduralEyesIntensity) == 0x000004, "Wrong size on Agent_SetCutsceneProceduralEyesIntensity");
static_assert(offsetof(Agent_SetCutsceneProceduralEyesIntensity, Value) == 0x000000, "Member 'Agent_SetCutsceneProceduralEyesIntensity::Value' has a wrong offset!");

// Function Stalker2.Agent.SetCutsceneProceduralEyesWeight
// 0x0004 (0x0004 - 0x0000)
struct Agent_SetCutsceneProceduralEyesWeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Agent_SetCutsceneProceduralEyesWeight) == 0x000004, "Wrong alignment on Agent_SetCutsceneProceduralEyesWeight");
static_assert(sizeof(Agent_SetCutsceneProceduralEyesWeight) == 0x000004, "Wrong size on Agent_SetCutsceneProceduralEyesWeight");
static_assert(offsetof(Agent_SetCutsceneProceduralEyesWeight, Value) == 0x000000, "Member 'Agent_SetCutsceneProceduralEyesWeight::Value' has a wrong offset!");

// Function Stalker2.StrelokBossComponent.OnDashAbilityUsed
// 0x0001 (0x0001 - 0x0000)
struct StrelokBossComponent_OnDashAbilityUsed final
{
public:
	bool                                          bAbilityUsed;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StrelokBossComponent_OnDashAbilityUsed) == 0x000001, "Wrong alignment on StrelokBossComponent_OnDashAbilityUsed");
static_assert(sizeof(StrelokBossComponent_OnDashAbilityUsed) == 0x000001, "Wrong size on StrelokBossComponent_OnDashAbilityUsed");
static_assert(offsetof(StrelokBossComponent_OnDashAbilityUsed, bAbilityUsed) == 0x000000, "Member 'StrelokBossComponent_OnDashAbilityUsed::bAbilityUsed' has a wrong offset!");

// Function Stalker2.HintBase.HoverChangeHintTextColor
// 0x0018 (0x0018 - 0x0000)
struct HintBase_HoverChangeHintTextColor final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InStylePrefix;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HintBase_HoverChangeHintTextColor) == 0x000008, "Wrong alignment on HintBase_HoverChangeHintTextColor");
static_assert(sizeof(HintBase_HoverChangeHintTextColor) == 0x000018, "Wrong size on HintBase_HoverChangeHintTextColor");
static_assert(offsetof(HintBase_HoverChangeHintTextColor, bShow) == 0x000000, "Member 'HintBase_HoverChangeHintTextColor::bShow' has a wrong offset!");
static_assert(offsetof(HintBase_HoverChangeHintTextColor, InStylePrefix) == 0x000008, "Member 'HintBase_HoverChangeHintTextColor::InStylePrefix' has a wrong offset!");

// Function Stalker2.HintBase.PostShowHover
// 0x0001 (0x0001 - 0x0000)
struct HintBase_PostShowHover final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HintBase_PostShowHover) == 0x000001, "Wrong alignment on HintBase_PostShowHover");
static_assert(sizeof(HintBase_PostShowHover) == 0x000001, "Wrong size on HintBase_PostShowHover");
static_assert(offsetof(HintBase_PostShowHover, bInShow) == 0x000000, "Member 'HintBase_PostShowHover::bInShow' has a wrong offset!");

// Function Stalker2.HintBase.SetStylePrefix
// 0x0010 (0x0010 - 0x0000)
struct HintBase_SetStylePrefix final
{
public:
	class FString                                 InStylePrefix;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HintBase_SetStylePrefix) == 0x000008, "Wrong alignment on HintBase_SetStylePrefix");
static_assert(sizeof(HintBase_SetStylePrefix) == 0x000010, "Wrong size on HintBase_SetStylePrefix");
static_assert(offsetof(HintBase_SetStylePrefix, InStylePrefix) == 0x000000, "Member 'HintBase_SetStylePrefix::InStylePrefix' has a wrong offset!");

// Function Stalker2.HintBase.SetText
// 0x0018 (0x0018 - 0x0000)
struct HintBase_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HintBase_SetText) == 0x000008, "Wrong alignment on HintBase_SetText");
static_assert(sizeof(HintBase_SetText) == 0x000018, "Wrong size on HintBase_SetText");
static_assert(offsetof(HintBase_SetText, InText) == 0x000000, "Member 'HintBase_SetText::InText' has a wrong offset!");

// Function Stalker2.HintBase.GetHoverSettings
// 0x0010 (0x0010 - 0x0000)
struct HintBase_GetHoverSettings final
{
public:
	TArray<struct FHoverAction>                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(HintBase_GetHoverSettings) == 0x000008, "Wrong alignment on HintBase_GetHoverSettings");
static_assert(sizeof(HintBase_GetHoverSettings) == 0x000010, "Wrong size on HintBase_GetHoverSettings");
static_assert(offsetof(HintBase_GetHoverSettings, ReturnValue) == 0x000000, "Member 'HintBase_GetHoverSettings::ReturnValue' has a wrong offset!");

// Function Stalker2.SettingElement.GetIsEnabledElement
// 0x0001 (0x0001 - 0x0000)
struct SettingElement_GetIsEnabledElement final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SettingElement_GetIsEnabledElement) == 0x000001, "Wrong alignment on SettingElement_GetIsEnabledElement");
static_assert(sizeof(SettingElement_GetIsEnabledElement) == 0x000001, "Wrong size on SettingElement_GetIsEnabledElement");
static_assert(offsetof(SettingElement_GetIsEnabledElement, ReturnValue) == 0x000000, "Member 'SettingElement_GetIsEnabledElement::ReturnValue' has a wrong offset!");

// Function Stalker2.SettingsElementPercent.SetValue
// 0x0008 (0x0008 - 0x0000)
struct SettingsElementPercent_SetValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SettingsElementPercent_SetValue) == 0x000004, "Wrong alignment on SettingsElementPercent_SetValue");
static_assert(sizeof(SettingsElementPercent_SetValue) == 0x000008, "Wrong size on SettingsElementPercent_SetValue");
static_assert(offsetof(SettingsElementPercent_SetValue, InValue) == 0x000000, "Member 'SettingsElementPercent_SetValue::InValue' has a wrong offset!");
static_assert(offsetof(SettingsElementPercent_SetValue, bForce) == 0x000004, "Member 'SettingsElementPercent_SetValue::bForce' has a wrong offset!");

// Function Stalker2.AISwarmComponent.OnConstruction
// 0x0070 (0x0070 - 0x0000)
struct AISwarmComponent_OnConstruction final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwarmHealth;                                       // 0x0060(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AISwarmComponent_OnConstruction) == 0x000010, "Wrong alignment on AISwarmComponent_OnConstruction");
static_assert(sizeof(AISwarmComponent_OnConstruction) == 0x000070, "Wrong size on AISwarmComponent_OnConstruction");
static_assert(offsetof(AISwarmComponent_OnConstruction, Transform) == 0x000000, "Member 'AISwarmComponent_OnConstruction::Transform' has a wrong offset!");
static_assert(offsetof(AISwarmComponent_OnConstruction, SwarmHealth) == 0x000060, "Member 'AISwarmComponent_OnConstruction::SwarmHealth' has a wrong offset!");

// Function Stalker2.AISwarmComponent.SetDamageTarget
// 0x0010 (0x0010 - 0x0000)
struct AISwarmComponent_SetDamageTarget final
{
public:
	const class AActor*                           Target;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetToGroundLevel;                               // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngageRadius;                                      // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISwarmComponent_SetDamageTarget) == 0x000008, "Wrong alignment on AISwarmComponent_SetDamageTarget");
static_assert(sizeof(AISwarmComponent_SetDamageTarget) == 0x000010, "Wrong size on AISwarmComponent_SetDamageTarget");
static_assert(offsetof(AISwarmComponent_SetDamageTarget, Target) == 0x000000, "Member 'AISwarmComponent_SetDamageTarget::Target' has a wrong offset!");
static_assert(offsetof(AISwarmComponent_SetDamageTarget, OffsetToGroundLevel) == 0x000008, "Member 'AISwarmComponent_SetDamageTarget::OffsetToGroundLevel' has a wrong offset!");
static_assert(offsetof(AISwarmComponent_SetDamageTarget, EngageRadius) == 0x00000C, "Member 'AISwarmComponent_SetDamageTarget::EngageRadius' has a wrong offset!");

// Function Stalker2.AISwarmComponent.Simulate
// 0x0004 (0x0004 - 0x0000)
struct AISwarmComponent_Simulate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISwarmComponent_Simulate) == 0x000004, "Wrong alignment on AISwarmComponent_Simulate");
static_assert(sizeof(AISwarmComponent_Simulate) == 0x000004, "Wrong size on AISwarmComponent_Simulate");
static_assert(offsetof(AISwarmComponent_Simulate, DeltaTime) == 0x000000, "Member 'AISwarmComponent_Simulate::DeltaTime' has a wrong offset!");

// Function Stalker2.AISwarmComponent.GetVATAnimationNames
// 0x0010 (0x0010 - 0x0000)
struct AISwarmComponent_GetVATAnimationNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AISwarmComponent_GetVATAnimationNames) == 0x000008, "Wrong alignment on AISwarmComponent_GetVATAnimationNames");
static_assert(sizeof(AISwarmComponent_GetVATAnimationNames) == 0x000010, "Wrong size on AISwarmComponent_GetVATAnimationNames");
static_assert(offsetof(AISwarmComponent_GetVATAnimationNames, ReturnValue) == 0x000000, "Member 'AISwarmComponent_GetVATAnimationNames::ReturnValue' has a wrong offset!");

// Function Stalker2.Anomaly.OnBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct Anomaly_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(Anomaly_OnBeginOverlap) == 0x000008, "Wrong alignment on Anomaly_OnBeginOverlap");
static_assert(sizeof(Anomaly_OnBeginOverlap) == 0x000108, "Wrong size on Anomaly_OnBeginOverlap");
static_assert(offsetof(Anomaly_OnBeginOverlap, OverlappedComponent) == 0x000000, "Member 'Anomaly_OnBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Anomaly_OnBeginOverlap, OtherActor) == 0x000008, "Member 'Anomaly_OnBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(Anomaly_OnBeginOverlap, OtherComp) == 0x000010, "Member 'Anomaly_OnBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(Anomaly_OnBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'Anomaly_OnBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Anomaly_OnBeginOverlap, bFromSweep) == 0x00001C, "Member 'Anomaly_OnBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(Anomaly_OnBeginOverlap, SweepResult) == 0x000020, "Member 'Anomaly_OnBeginOverlap::SweepResult' has a wrong offset!");

// Function Stalker2.Anomaly.OnDieSoundFinished
// 0x0010 (0x0010 - 0x0000)
struct Anomaly_OnDieSoundFinished final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Anomaly_OnDieSoundFinished) == 0x000008, "Wrong alignment on Anomaly_OnDieSoundFinished");
static_assert(sizeof(Anomaly_OnDieSoundFinished) == 0x000010, "Wrong size on Anomaly_OnDieSoundFinished");
static_assert(offsetof(Anomaly_OnDieSoundFinished, CallbackType) == 0x000000, "Member 'Anomaly_OnDieSoundFinished::CallbackType' has a wrong offset!");
static_assert(offsetof(Anomaly_OnDieSoundFinished, CallbackInfo) == 0x000008, "Member 'Anomaly_OnDieSoundFinished::CallbackInfo' has a wrong offset!");

// Function Stalker2.Anomaly.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct Anomaly_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Anomaly_OnEndOverlap) == 0x000008, "Wrong alignment on Anomaly_OnEndOverlap");
static_assert(sizeof(Anomaly_OnEndOverlap) == 0x000020, "Wrong size on Anomaly_OnEndOverlap");
static_assert(offsetof(Anomaly_OnEndOverlap, OverlappedComponent) == 0x000000, "Member 'Anomaly_OnEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Anomaly_OnEndOverlap, OtherActor) == 0x000008, "Member 'Anomaly_OnEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(Anomaly_OnEndOverlap, OtherComp) == 0x000010, "Member 'Anomaly_OnEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(Anomaly_OnEndOverlap, OtherBodyIndex) == 0x000018, "Member 'Anomaly_OnEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function Stalker2.Anomaly.OnNiagaraFinished
// 0x0008 (0x0008 - 0x0000)
struct Anomaly_OnNiagaraFinished final
{
public:
	class UNiagaraComponent*                      FinishedNiagara;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Anomaly_OnNiagaraFinished) == 0x000008, "Wrong alignment on Anomaly_OnNiagaraFinished");
static_assert(sizeof(Anomaly_OnNiagaraFinished) == 0x000008, "Wrong size on Anomaly_OnNiagaraFinished");
static_assert(offsetof(Anomaly_OnNiagaraFinished, FinishedNiagara) == 0x000000, "Member 'Anomaly_OnNiagaraFinished::FinishedNiagara' has a wrong offset!");

// Function Stalker2.SoapBubbleAnomaly.OnActorCollided
// 0x0108 (0x0108 - 0x0000)
struct SoapBubbleAnomaly_OnActorCollided final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(SoapBubbleAnomaly_OnActorCollided) == 0x000008, "Wrong alignment on SoapBubbleAnomaly_OnActorCollided");
static_assert(sizeof(SoapBubbleAnomaly_OnActorCollided) == 0x000108, "Wrong size on SoapBubbleAnomaly_OnActorCollided");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, OverlappedComponent) == 0x000000, "Member 'SoapBubbleAnomaly_OnActorCollided::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, OtherActor) == 0x000008, "Member 'SoapBubbleAnomaly_OnActorCollided::OtherActor' has a wrong offset!");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, OtherComp) == 0x000010, "Member 'SoapBubbleAnomaly_OnActorCollided::OtherComp' has a wrong offset!");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, OtherBodyIndex) == 0x000018, "Member 'SoapBubbleAnomaly_OnActorCollided::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, bFromSweep) == 0x00001C, "Member 'SoapBubbleAnomaly_OnActorCollided::bFromSweep' has a wrong offset!");
static_assert(offsetof(SoapBubbleAnomaly_OnActorCollided, SweepResult) == 0x000020, "Member 'SoapBubbleAnomaly_OnActorCollided::SweepResult' has a wrong offset!");

// Function Stalker2.MenuSubViewBase.SelectOptionWidget
// 0x0008 (0x0008 - 0x0000)
struct MenuSubViewBase_SelectOptionWidget final
{
public:
	class UMenuButtonBase*                        ButtonWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MenuSubViewBase_SelectOptionWidget) == 0x000008, "Wrong alignment on MenuSubViewBase_SelectOptionWidget");
static_assert(sizeof(MenuSubViewBase_SelectOptionWidget) == 0x000008, "Wrong size on MenuSubViewBase_SelectOptionWidget");
static_assert(offsetof(MenuSubViewBase_SelectOptionWidget, ButtonWidget) == 0x000000, "Member 'MenuSubViewBase_SelectOptionWidget::ButtonWidget' has a wrong offset!");

// Function Stalker2.EquipmentSlots.OnItemMouseEnter
// 0x0008 (0x0008 - 0x0000)
struct EquipmentSlots_OnItemMouseEnter final
{
public:
	class UInteractableItemSlotBaseWidget*        ItemWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EquipmentSlots_OnItemMouseEnter) == 0x000008, "Wrong alignment on EquipmentSlots_OnItemMouseEnter");
static_assert(sizeof(EquipmentSlots_OnItemMouseEnter) == 0x000008, "Wrong size on EquipmentSlots_OnItemMouseEnter");
static_assert(offsetof(EquipmentSlots_OnItemMouseEnter, ItemWidget) == 0x000000, "Member 'EquipmentSlots_OnItemMouseEnter::ItemWidget' has a wrong offset!");

// Function Stalker2.EquipmentSlots.OnItemMouseLeave
// 0x0008 (0x0008 - 0x0000)
struct EquipmentSlots_OnItemMouseLeave final
{
public:
	class UInteractableItemSlotBaseWidget*        ItemWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EquipmentSlots_OnItemMouseLeave) == 0x000008, "Wrong alignment on EquipmentSlots_OnItemMouseLeave");
static_assert(sizeof(EquipmentSlots_OnItemMouseLeave) == 0x000008, "Wrong size on EquipmentSlots_OnItemMouseLeave");
static_assert(offsetof(EquipmentSlots_OnItemMouseLeave, ItemWidget) == 0x000000, "Member 'EquipmentSlots_OnItemMouseLeave::ItemWidget' has a wrong offset!");

// Function Stalker2.InteractionComponent.SetInteractionActive
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_SetInteractionActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_SetInteractionActive) == 0x000001, "Wrong alignment on InteractionComponent_SetInteractionActive");
static_assert(sizeof(InteractionComponent_SetInteractionActive) == 0x000001, "Wrong size on InteractionComponent_SetInteractionActive");
static_assert(offsetof(InteractionComponent_SetInteractionActive, bActive) == 0x000000, "Member 'InteractionComponent_SetInteractionActive::bActive' has a wrong offset!");

// Function Stalker2.InteractionComponent.SetInteractionDistance
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_SetInteractionDistance final
{
public:
	float                                         MinDistance;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_SetInteractionDistance) == 0x000004, "Wrong alignment on InteractionComponent_SetInteractionDistance");
static_assert(sizeof(InteractionComponent_SetInteractionDistance) == 0x000008, "Wrong size on InteractionComponent_SetInteractionDistance");
static_assert(offsetof(InteractionComponent_SetInteractionDistance, MinDistance) == 0x000000, "Member 'InteractionComponent_SetInteractionDistance::MinDistance' has a wrong offset!");
static_assert(offsetof(InteractionComponent_SetInteractionDistance, MaxDistance) == 0x000004, "Member 'InteractionComponent_SetInteractionDistance::MaxDistance' has a wrong offset!");

// Function Stalker2.InteractionComponent.SetSelfActivating
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_SetSelfActivating final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_SetSelfActivating) == 0x000001, "Wrong alignment on InteractionComponent_SetSelfActivating");
static_assert(sizeof(InteractionComponent_SetSelfActivating) == 0x000001, "Wrong size on InteractionComponent_SetSelfActivating");
static_assert(offsetof(InteractionComponent_SetSelfActivating, bNewValue) == 0x000000, "Member 'InteractionComponent_SetSelfActivating::bNewValue' has a wrong offset!");

// Function Stalker2.InteractionComponent.SetShowInactive
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_SetShowInactive final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_SetShowInactive) == 0x000001, "Wrong alignment on InteractionComponent_SetShowInactive");
static_assert(sizeof(InteractionComponent_SetShowInactive) == 0x000001, "Wrong size on InteractionComponent_SetShowInactive");
static_assert(offsetof(InteractionComponent_SetShowInactive, bShow) == 0x000000, "Member 'InteractionComponent_SetShowInactive::bShow' has a wrong offset!");

// Function Stalker2.InteractionComponent.HasItemRequirement
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_HasItemRequirement final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_HasItemRequirement) == 0x000001, "Wrong alignment on InteractionComponent_HasItemRequirement");
static_assert(sizeof(InteractionComponent_HasItemRequirement) == 0x000001, "Wrong size on InteractionComponent_HasItemRequirement");
static_assert(offsetof(InteractionComponent_HasItemRequirement, ReturnValue) == 0x000000, "Member 'InteractionComponent_HasItemRequirement::ReturnValue' has a wrong offset!");

// Function Stalker2.InteractionComponent.HasRelatedQuest
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_HasRelatedQuest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InteractionComponent_HasRelatedQuest) == 0x000001, "Wrong alignment on InteractionComponent_HasRelatedQuest");
static_assert(sizeof(InteractionComponent_HasRelatedQuest) == 0x000001, "Wrong size on InteractionComponent_HasRelatedQuest");
static_assert(offsetof(InteractionComponent_HasRelatedQuest, ReturnValue) == 0x000000, "Member 'InteractionComponent_HasRelatedQuest::ReturnValue' has a wrong offset!");

// Function Stalker2.SingleClickComponent.SetNeededFailedEvent
// 0x0001 (0x0001 - 0x0000)
struct SingleClickComponent_SetNeededFailedEvent final
{
public:
	bool                                          bNeedEvent;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SingleClickComponent_SetNeededFailedEvent) == 0x000001, "Wrong alignment on SingleClickComponent_SetNeededFailedEvent");
static_assert(sizeof(SingleClickComponent_SetNeededFailedEvent) == 0x000001, "Wrong size on SingleClickComponent_SetNeededFailedEvent");
static_assert(offsetof(SingleClickComponent_SetNeededFailedEvent, bNeedEvent) == 0x000000, "Member 'SingleClickComponent_SetNeededFailedEvent::bNeedEvent' has a wrong offset!");

// Function Stalker2.SingleClickComponent.CanSendFailedEvent
// 0x0001 (0x0001 - 0x0000)
struct SingleClickComponent_CanSendFailedEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SingleClickComponent_CanSendFailedEvent) == 0x000001, "Wrong alignment on SingleClickComponent_CanSendFailedEvent");
static_assert(sizeof(SingleClickComponent_CanSendFailedEvent) == 0x000001, "Wrong size on SingleClickComponent_CanSendFailedEvent");
static_assert(offsetof(SingleClickComponent_CanSendFailedEvent, ReturnValue) == 0x000000, "Member 'SingleClickComponent_CanSendFailedEvent::ReturnValue' has a wrong offset!");

// Function Stalker2.VoiceoverSpeechComponent.OnAKEventFinished
// 0x0010 (0x0010 - 0x0000)
struct VoiceoverSpeechComponent_OnAKEventFinished final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VoiceoverSpeechComponent_OnAKEventFinished) == 0x000008, "Wrong alignment on VoiceoverSpeechComponent_OnAKEventFinished");
static_assert(sizeof(VoiceoverSpeechComponent_OnAKEventFinished) == 0x000010, "Wrong size on VoiceoverSpeechComponent_OnAKEventFinished");
static_assert(offsetof(VoiceoverSpeechComponent_OnAKEventFinished, CallbackType) == 0x000000, "Member 'VoiceoverSpeechComponent_OnAKEventFinished::CallbackType' has a wrong offset!");
static_assert(offsetof(VoiceoverSpeechComponent_OnAKEventFinished, CallbackInfo) == 0x000008, "Member 'VoiceoverSpeechComponent_OnAKEventFinished::CallbackInfo' has a wrong offset!");

// Function Stalker2.AbilityEventData.GetAbilityType
// 0x0001 (0x0001 - 0x0000)
struct AbilityEventData_GetAbilityType final
{
public:
	EAbility                                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEventData_GetAbilityType) == 0x000001, "Wrong alignment on AbilityEventData_GetAbilityType");
static_assert(sizeof(AbilityEventData_GetAbilityType) == 0x000001, "Wrong size on AbilityEventData_GetAbilityType");
static_assert(offsetof(AbilityEventData_GetAbilityType, ReturnValue) == 0x000000, "Member 'AbilityEventData_GetAbilityType::ReturnValue' has a wrong offset!");

// Function Stalker2.AbilityEventData.GetActivationTag
// 0x0008 (0x0008 - 0x0000)
struct AbilityEventData_GetActivationTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEventData_GetActivationTag) == 0x000004, "Wrong alignment on AbilityEventData_GetActivationTag");
static_assert(sizeof(AbilityEventData_GetActivationTag) == 0x000008, "Wrong size on AbilityEventData_GetActivationTag");
static_assert(offsetof(AbilityEventData_GetActivationTag, ReturnValue) == 0x000000, "Member 'AbilityEventData_GetActivationTag::ReturnValue' has a wrong offset!");

// Function Stalker2.AnimationUtilitiesBPFunctionLibrary.GetCharacterAnimInstance
// 0x0010 (0x0010 - 0x0000)
struct AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance final
{
public:
	class AObj*                                   Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance) == 0x000008, "Wrong alignment on AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance");
static_assert(sizeof(AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance) == 0x000010, "Wrong size on AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance, Obj) == 0x000000, "Member 'AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance::Obj' has a wrong offset!");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance, ReturnValue) == 0x000008, "Member 'AnimationUtilitiesBPFunctionLibrary_GetCharacterAnimInstance::ReturnValue' has a wrong offset!");

// Function Stalker2.AnimationUtilitiesBPFunctionLibrary.IsSimulationEnable
// 0x0018 (0x0018 - 0x0000)
struct AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomAsset*                            GroomAsset;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable) == 0x000008, "Wrong alignment on AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable");
static_assert(sizeof(AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable) == 0x000018, "Wrong size on AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable, Object) == 0x000000, "Member 'AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable::Object' has a wrong offset!");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable, GroomAsset) == 0x000008, "Member 'AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable::GroomAsset' has a wrong offset!");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable, ReturnValue) == 0x000010, "Member 'AnimationUtilitiesBPFunctionLibrary_IsSimulationEnable::ReturnValue' has a wrong offset!");

// Function Stalker2.AnimationUtilitiesBPFunctionLibrary.LerpPlayerToInteractable
// 0x0038 (0x0038 - 0x0000)
struct AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable final
{
public:
	class APC*                                    PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteractionComponent*                  InteractionComponent;                              // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimInteractableData                  InteractionData;                                   // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable) == 0x000008, "Wrong alignment on AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable");
static_assert(sizeof(AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable) == 0x000038, "Wrong size on AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable, PC) == 0x000000, "Member 'AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable::PC' has a wrong offset!");
static_assert(offsetof(AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable, InteractionComponent) == 0x000008, "Member 'AnimationUtilitiesBPFunctionLibrary_LerpPlayerToInteractable::InteractionComponent' has a wrong offset!");
