#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stalker2

#include "Basic.hpp"

#include "EnhancedInput_classes.hpp"
#include "MovieScene_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Stalker2_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "PoseSearch_classes.hpp"
#include "Niagara_classes.hpp"
#include "CinematicKeyFrameTracks_structs.hpp"
#include "AIModule_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "PhysicsCore_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ModioUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "SectorSelector_classes.hpp"


namespace SDK
{

// Class Stalker2.BaseManager
// 0x0050 (0x0078 - 0x0028)
class UBaseManager : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseManager">();
	}
	static class UBaseManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseManager>();
	}
};
static_assert(alignof(UBaseManager) == 0x000008, "Wrong alignment on UBaseManager");
static_assert(sizeof(UBaseManager) == 0x000078, "Wrong size on UBaseManager");

// Class Stalker2.BaseTickableManager
// 0x0030 (0x00A8 - 0x0078)
class UBaseTickableManager : public UBaseManager
{
public:
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseTickableManager">();
	}
	static class UBaseTickableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseTickableManager>();
	}
};
static_assert(alignof(UBaseTickableManager) == 0x000008, "Wrong alignment on UBaseTickableManager");
static_assert(sizeof(UBaseTickableManager) == 0x0000A8, "Wrong size on UBaseTickableManager");

// Class Stalker2.BaseConsoleManager
// 0x0000 (0x00A8 - 0x00A8)
class UBaseConsoleManager : public UBaseTickableManager
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseConsoleManager">();
	}
	static class UBaseConsoleManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseConsoleManager>();
	}
};
static_assert(alignof(UBaseConsoleManager) == 0x000008, "Wrong alignment on UBaseConsoleManager");
static_assert(sizeof(UBaseConsoleManager) == 0x0000A8, "Wrong size on UBaseConsoleManager");

// Class Stalker2.CustomConsoleManagerSD
// 0x0000 (0x00A8 - 0x00A8)
class UCustomConsoleManagerSD final : public UBaseConsoleManager
{
public:
	void XBeginPlay() const;
	void XGetActorNameByUID(int32 UID) const;
	void XHideAllWidget() const;
	void XHideCompass() const;
	void XShowAllWidget() const;
	void XShowCompass() const;
	void XTeleportToPlacesOfInterest(const class FString& SID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomConsoleManagerSD">();
	}
	static class UCustomConsoleManagerSD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomConsoleManagerSD>();
	}
};
static_assert(alignof(UCustomConsoleManagerSD) == 0x000008, "Wrong alignment on UCustomConsoleManagerSD");
static_assert(sizeof(UCustomConsoleManagerSD) == 0x0000A8, "Wrong size on UCustomConsoleManagerSD");

// Class Stalker2.AnimNotifyBase
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyBase : public UAnimNotify
{
public:
	ENotifyTriggerType                            NotifyTriggerType;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyBase">();
	}
	static class UAnimNotifyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyBase>();
	}
};
static_assert(alignof(UAnimNotifyBase) == 0x000008, "Wrong alignment on UAnimNotifyBase");
static_assert(sizeof(UAnimNotifyBase) == 0x000040, "Wrong size on UAnimNotifyBase");
static_assert(offsetof(UAnimNotifyBase, NotifyTriggerType) == 0x000038, "Member 'UAnimNotifyBase::NotifyTriggerType' has a wrong offset!");

// Class Stalker2.AnimNotify_PlayAnimationOnAttachedItemContextualAction
// 0x0010 (0x0050 - 0x0040)
class UAnimNotify_PlayAnimationOnAttachedItemContextualAction final : public UAnimNotifyBase
{
public:
	TArray<struct FPlayAnimationOnAttachedItemData> PlayAnimationOnAttachedItemData;                   // 0x0040(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlayAnimationOnAttachedItemContextualAction">();
	}
	static class UAnimNotify_PlayAnimationOnAttachedItemContextualAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayAnimationOnAttachedItemContextualAction>();
	}
};
static_assert(alignof(UAnimNotify_PlayAnimationOnAttachedItemContextualAction) == 0x000008, "Wrong alignment on UAnimNotify_PlayAnimationOnAttachedItemContextualAction");
static_assert(sizeof(UAnimNotify_PlayAnimationOnAttachedItemContextualAction) == 0x000050, "Wrong size on UAnimNotify_PlayAnimationOnAttachedItemContextualAction");
static_assert(offsetof(UAnimNotify_PlayAnimationOnAttachedItemContextualAction, PlayAnimationOnAttachedItemData) == 0x000040, "Member 'UAnimNotify_PlayAnimationOnAttachedItemContextualAction::PlayAnimationOnAttachedItemData' has a wrong offset!");

// Class Stalker2.WidgetBase
// 0x0000 (0x0278 - 0x0278)
class UWidgetBase : public UUserWidget
{
public:
	void UpdateWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WidgetBase">();
	}
	static class UWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetBase>();
	}
};
static_assert(alignof(UWidgetBase) == 0x000008, "Wrong alignment on UWidgetBase");
static_assert(sizeof(UWidgetBase) == 0x000278, "Wrong size on UWidgetBase");

// Class Stalker2.WorldMapMarker
// 0x00C8 (0x0340 - 0x0278)
class UWorldMapMarker : public UWidgetBase
{
public:
	TMulticastInlineDelegate<void(bool bIsHovered, class UWorldMapMarker* OutHoverMarkerWidget)> OnHoverMarker;                                     // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWorldMapMarker* HoverMarkerWidget)> OnClickMarker;                                     // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsScale;                                          // 0x0298(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 MarkerZone;                                        // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 MarkerIcon;                                        // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               MarkerSizeBox;                                     // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                               ZoneRadiuse;                                       // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ClickZone;                                         // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              MarkerAlignment;                                   // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MarkerSize;                                        // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableHoverScale;                                 // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoverScaleValue;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableMarkerClick;                                // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E5[0x53];                                     // 0x02E5(0x0053)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       PerentCanvasSlot;                                  // 0x0338(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void MarkerClick();
	void OnMouseHover();
	void OnMouseUnhover();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldMapMarker">();
	}
	static class UWorldMapMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldMapMarker>();
	}
};
static_assert(alignof(UWorldMapMarker) == 0x000008, "Wrong alignment on UWorldMapMarker");
static_assert(sizeof(UWorldMapMarker) == 0x000340, "Wrong size on UWorldMapMarker");
static_assert(offsetof(UWorldMapMarker, OnHoverMarker) == 0x000278, "Member 'UWorldMapMarker::OnHoverMarker' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, OnClickMarker) == 0x000288, "Member 'UWorldMapMarker::OnClickMarker' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, bIsScale) == 0x000298, "Member 'UWorldMapMarker::bIsScale' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, MarkerZone) == 0x0002A0, "Member 'UWorldMapMarker::MarkerZone' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, MarkerIcon) == 0x0002A8, "Member 'UWorldMapMarker::MarkerIcon' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, MarkerSizeBox) == 0x0002B0, "Member 'UWorldMapMarker::MarkerSizeBox' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, ZoneRadiuse) == 0x0002B8, "Member 'UWorldMapMarker::ZoneRadiuse' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, ClickZone) == 0x0002C0, "Member 'UWorldMapMarker::ClickZone' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, MarkerAlignment) == 0x0002C8, "Member 'UWorldMapMarker::MarkerAlignment' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, MarkerSize) == 0x0002D8, "Member 'UWorldMapMarker::MarkerSize' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, bEnableHoverScale) == 0x0002DC, "Member 'UWorldMapMarker::bEnableHoverScale' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, HoverScaleValue) == 0x0002E0, "Member 'UWorldMapMarker::HoverScaleValue' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, bEnableMarkerClick) == 0x0002E4, "Member 'UWorldMapMarker::bEnableMarkerClick' has a wrong offset!");
static_assert(offsetof(UWorldMapMarker, PerentCanvasSlot) == 0x000338, "Member 'UWorldMapMarker::PerentCanvasSlot' has a wrong offset!");

// Class Stalker2.ModSubsystemBase
// 0x0000 (0x0030 - 0x0030)
class UModSubsystemBase : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ModSubsystemBase">();
	}
	static class UModSubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModSubsystemBase>();
	}
};
static_assert(alignof(UModSubsystemBase) == 0x000008, "Wrong alignment on UModSubsystemBase");
static_assert(sizeof(UModSubsystemBase) == 0x000030, "Wrong size on UModSubsystemBase");

// Class Stalker2.GSCModIOSubsystem
// 0x00A8 (0x00D8 - 0x0030)
class UGSCModIOSubsystem final : public UModSubsystemBase
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ModBrowserClass;                                   // 0x0058(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ModBrowserLoadingClass;                            // 0x0088(0x0030)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModioSubsystem*                        ModioSubsystem;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModioUISubsystem*                      ModioUISubsystem;                                  // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ModBrowserWidget;                                  // 0x00C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ModBrowserLoadingWidget;                           // 0x00D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void HandleModBrowserClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSCModIOSubsystem">();
	}
	static class UGSCModIOSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSCModIOSubsystem>();
	}
};
static_assert(alignof(UGSCModIOSubsystem) == 0x000008, "Wrong alignment on UGSCModIOSubsystem");
static_assert(sizeof(UGSCModIOSubsystem) == 0x0000D8, "Wrong size on UGSCModIOSubsystem");
static_assert(offsetof(UGSCModIOSubsystem, ModBrowserClass) == 0x000058, "Member 'UGSCModIOSubsystem::ModBrowserClass' has a wrong offset!");
static_assert(offsetof(UGSCModIOSubsystem, ModBrowserLoadingClass) == 0x000088, "Member 'UGSCModIOSubsystem::ModBrowserLoadingClass' has a wrong offset!");
static_assert(offsetof(UGSCModIOSubsystem, ModioSubsystem) == 0x0000B8, "Member 'UGSCModIOSubsystem::ModioSubsystem' has a wrong offset!");
static_assert(offsetof(UGSCModIOSubsystem, ModioUISubsystem) == 0x0000C0, "Member 'UGSCModIOSubsystem::ModioUISubsystem' has a wrong offset!");
static_assert(offsetof(UGSCModIOSubsystem, ModBrowserWidget) == 0x0000C8, "Member 'UGSCModIOSubsystem::ModBrowserWidget' has a wrong offset!");
static_assert(offsetof(UGSCModIOSubsystem, ModBrowserLoadingWidget) == 0x0000D0, "Member 'UGSCModIOSubsystem::ModBrowserLoadingWidget' has a wrong offset!");

// Class Stalker2.AnimInstanceBase
// 0x0090 (0x0400 - 0x0370)
class UAnimInstanceBase : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x30];                                     // 0x0368(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AObj>                    Owner;                                             // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USkeletalMeshComponent>  SkeletalMeshComponent;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          DummyAnimation;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                 DummyBlueprint;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B8[0x48];                                     // 0x03B8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstanceBase">();
	}
	static class UAnimInstanceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstanceBase>();
	}
};
static_assert(alignof(UAnimInstanceBase) == 0x000010, "Wrong alignment on UAnimInstanceBase");
static_assert(sizeof(UAnimInstanceBase) == 0x000400, "Wrong size on UAnimInstanceBase");
static_assert(offsetof(UAnimInstanceBase, Owner) == 0x000398, "Member 'UAnimInstanceBase::Owner' has a wrong offset!");
static_assert(offsetof(UAnimInstanceBase, SkeletalMeshComponent) == 0x0003A0, "Member 'UAnimInstanceBase::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(UAnimInstanceBase, DummyAnimation) == 0x0003A8, "Member 'UAnimInstanceBase::DummyAnimation' has a wrong offset!");
static_assert(offsetof(UAnimInstanceBase, DummyBlueprint) == 0x0003B0, "Member 'UAnimInstanceBase::DummyBlueprint' has a wrong offset!");

// Class Stalker2.AnimInstancePlayerWeaponBase
// 0x0030 (0x0430 - 0x0400)
#pragma pack(push, 0x1)
class alignas(0x10) UAnimInstancePlayerWeaponBase : public UAnimInstanceBase
{
public:
	struct FAnimPlayerBaseWeaponData              BaseData;                                          // 0x0400(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstancePlayerWeaponBase">();
	}
	static class UAnimInstancePlayerWeaponBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstancePlayerWeaponBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAnimInstancePlayerWeaponBase) == 0x000010, "Wrong alignment on UAnimInstancePlayerWeaponBase");
static_assert(sizeof(UAnimInstancePlayerWeaponBase) == 0x000430, "Wrong size on UAnimInstancePlayerWeaponBase");
static_assert(offsetof(UAnimInstancePlayerWeaponBase, BaseData) == 0x000400, "Member 'UAnimInstancePlayerWeaponBase::BaseData' has a wrong offset!");

// Class Stalker2.CustomConsoleManagerOA
// 0x0408 (0x04B0 - 0x00A8)
class UCustomConsoleManagerOA final : public UBaseConsoleManager
{
public:
	uint8                                         Pad_A8[0x408];                                     // 0x00A8(0x0408)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void XDebugAudioScattererEvents(const bool bEnabled, const float DrawTime);
	void XDebugAudioScattererMap(const bool bEnabled);

	void XGetActiveDLC() const;
	void XHasDLC(const class FName DLCName) const;
	void XIsHDREnabled() const;
	void XNewDLCAvailable() const;
	void XPlayVideo(const class FString& Path) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomConsoleManagerOA">();
	}
	static class UCustomConsoleManagerOA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomConsoleManagerOA>();
	}
};
static_assert(alignof(UCustomConsoleManagerOA) == 0x000008, "Wrong alignment on UCustomConsoleManagerOA");
static_assert(sizeof(UCustomConsoleManagerOA) == 0x0004B0, "Wrong size on UCustomConsoleManagerOA");

// Class Stalker2.AbstractProgressBar
// 0x0010 (0x0288 - 0x0278)
class UAbstractProgressBar : public UWidgetBase
{
public:
	bool                                          bEnableStyleManager;                               // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProgressValue;                                     // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ProgressStyleId;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetProgressValue(float InProgress);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbstractProgressBar">();
	}
	static class UAbstractProgressBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbstractProgressBar>();
	}
};
static_assert(alignof(UAbstractProgressBar) == 0x000008, "Wrong alignment on UAbstractProgressBar");
static_assert(sizeof(UAbstractProgressBar) == 0x000288, "Wrong size on UAbstractProgressBar");
static_assert(offsetof(UAbstractProgressBar, bEnableStyleManager) == 0x000278, "Member 'UAbstractProgressBar::bEnableStyleManager' has a wrong offset!");
static_assert(offsetof(UAbstractProgressBar, ProgressValue) == 0x00027C, "Member 'UAbstractProgressBar::ProgressValue' has a wrong offset!");
static_assert(offsetof(UAbstractProgressBar, ProgressStyleId) == 0x000280, "Member 'UAbstractProgressBar::ProgressStyleId' has a wrong offset!");

// Class Stalker2.MenuButtonModel
// 0x0028 (0x0058 - 0x0030)
class UMenuButtonModel : public UDataAsset
{
public:
	TArray<struct FMenuButtonData>                ButtonDataList;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UHintControllerBase>        LegendButtonWidgetClass;                           // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FShortcutData>                  SubViewShortcuts;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MenuButtonModel">();
	}
	static class UMenuButtonModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuButtonModel>();
	}
};
static_assert(alignof(UMenuButtonModel) == 0x000008, "Wrong alignment on UMenuButtonModel");
static_assert(sizeof(UMenuButtonModel) == 0x000058, "Wrong size on UMenuButtonModel");
static_assert(offsetof(UMenuButtonModel, ButtonDataList) == 0x000030, "Member 'UMenuButtonModel::ButtonDataList' has a wrong offset!");
static_assert(offsetof(UMenuButtonModel, LegendButtonWidgetClass) == 0x000040, "Member 'UMenuButtonModel::LegendButtonWidgetClass' has a wrong offset!");
static_assert(offsetof(UMenuButtonModel, SubViewShortcuts) == 0x000048, "Member 'UMenuButtonModel::SubViewShortcuts' has a wrong offset!");

// Class Stalker2.ChildViewBase
// 0x0000 (0x0278 - 0x0278)
class UChildViewBase : public UWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChildViewBase">();
	}
	static class UChildViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChildViewBase>();
	}
};
static_assert(alignof(UChildViewBase) == 0x000008, "Wrong alignment on UChildViewBase");
static_assert(sizeof(UChildViewBase) == 0x000278, "Wrong size on UChildViewBase");

// Class Stalker2.StatPanelDebug
// 0x0048 (0x02C0 - 0x0278)
class UStatPanelDebug final : public UChildViewBase
{
public:
	class UProgressBar*                           ProgressHP;                                        // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ProgressRadiation;                                 // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ProgressStamina;                                   // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ProgressPsy;                                       // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             HPText;                                            // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             RadiationText;                                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             StaminaText;                                       // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             PsyText;                                           // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateAllStats();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StatPanelDebug">();
	}
	static class UStatPanelDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatPanelDebug>();
	}
};
static_assert(alignof(UStatPanelDebug) == 0x000008, "Wrong alignment on UStatPanelDebug");
static_assert(sizeof(UStatPanelDebug) == 0x0002C0, "Wrong size on UStatPanelDebug");
static_assert(offsetof(UStatPanelDebug, ProgressHP) == 0x000278, "Member 'UStatPanelDebug::ProgressHP' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, ProgressRadiation) == 0x000280, "Member 'UStatPanelDebug::ProgressRadiation' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, ProgressStamina) == 0x000288, "Member 'UStatPanelDebug::ProgressStamina' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, ProgressPsy) == 0x000290, "Member 'UStatPanelDebug::ProgressPsy' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, HPText) == 0x000298, "Member 'UStatPanelDebug::HPText' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, RadiationText) == 0x0002A0, "Member 'UStatPanelDebug::RadiationText' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, StaminaText) == 0x0002A8, "Member 'UStatPanelDebug::StaminaText' has a wrong offset!");
static_assert(offsetof(UStatPanelDebug, PsyText) == 0x0002B0, "Member 'UStatPanelDebug::PsyText' has a wrong offset!");

// Class Stalker2.AnimInstanceMutant
// 0x0770 (0x0B70 - 0x0400)
class UAnimInstanceMutant final : public UAnimInstanceBase
{
public:
	struct FAnimHitData                           HitData;                                           // 0x0400(0x0138)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FAnimMutantStateData                   StateData;                                         // 0x0538(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FAnimMutantCollectionsData             CollectionData;                                    // 0x0550(0x0008)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimPoseSearchLocomotionData          PoseSearchLocomotionData;                          // 0x0560(0x01D0)(Edit, BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAnimPhysicalData                      PhysicalData;                                      // 0x0730(0x03D8)(Edit, BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTwoLegIKData                          LegsData;                                          // 0x0B08(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FAnimAbilityData                       AbilityData;                                       // 0x0B30(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FLookAtMutantData                      LookAtData;                                        // 0x0B48(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B68[0x8];                                      // 0x0B68(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstanceMutant">();
	}
	static class UAnimInstanceMutant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstanceMutant>();
	}
};
static_assert(alignof(UAnimInstanceMutant) == 0x000010, "Wrong alignment on UAnimInstanceMutant");
static_assert(sizeof(UAnimInstanceMutant) == 0x000B70, "Wrong size on UAnimInstanceMutant");
static_assert(offsetof(UAnimInstanceMutant, HitData) == 0x000400, "Member 'UAnimInstanceMutant::HitData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, StateData) == 0x000538, "Member 'UAnimInstanceMutant::StateData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, CollectionData) == 0x000550, "Member 'UAnimInstanceMutant::CollectionData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, PoseSearchLocomotionData) == 0x000560, "Member 'UAnimInstanceMutant::PoseSearchLocomotionData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, PhysicalData) == 0x000730, "Member 'UAnimInstanceMutant::PhysicalData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, LegsData) == 0x000B08, "Member 'UAnimInstanceMutant::LegsData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, AbilityData) == 0x000B30, "Member 'UAnimInstanceMutant::AbilityData' has a wrong offset!");
static_assert(offsetof(UAnimInstanceMutant, LookAtData) == 0x000B48, "Member 'UAnimInstanceMutant::LookAtData' has a wrong offset!");

// Class Stalker2.AnimNotify_LaunchDialogAnimation
// 0x0008 (0x0048 - 0x0040)
class UAnimNotify_LaunchDialogAnimation final : public UAnimNotifyBase
{
public:
	EDialogAnimationType                          DialogAnimationType;                               // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_LaunchDialogAnimation">();
	}
	static class UAnimNotify_LaunchDialogAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_LaunchDialogAnimation>();
	}
};
static_assert(alignof(UAnimNotify_LaunchDialogAnimation) == 0x000008, "Wrong alignment on UAnimNotify_LaunchDialogAnimation");
static_assert(sizeof(UAnimNotify_LaunchDialogAnimation) == 0x000048, "Wrong size on UAnimNotify_LaunchDialogAnimation");
static_assert(offsetof(UAnimNotify_LaunchDialogAnimation, DialogAnimationType) == 0x000040, "Member 'UAnimNotify_LaunchDialogAnimation::DialogAnimationType' has a wrong offset!");

// Class Stalker2.SettingsPage
// 0x0018 (0x0290 - 0x0278)
class USettingsPage : public UWidgetBase
{
public:
	class UScrollBox*                             OptionsContainer;                                  // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESettingCategoryType                          Category;                                          // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_281[0xF];                                      // 0x0281(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SettingsPage">();
	}
	static class USettingsPage* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsPage>();
	}
};
static_assert(alignof(USettingsPage) == 0x000008, "Wrong alignment on USettingsPage");
static_assert(sizeof(USettingsPage) == 0x000290, "Wrong size on USettingsPage");
static_assert(offsetof(USettingsPage, OptionsContainer) == 0x000278, "Member 'USettingsPage::OptionsContainer' has a wrong offset!");
static_assert(offsetof(USettingsPage, Category) == 0x000280, "Member 'USettingsPage::Category' has a wrong offset!");

// Class Stalker2.AccessibilitySettingsWidget
// 0x0008 (0x0298 - 0x0290)
class UAccessibilitySettingsWidget final : public USettingsPage
{
public:
	class USettingElementSwitcher*                ColorBlindness;                                    // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccessibilitySettingsWidget">();
	}
	static class UAccessibilitySettingsWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccessibilitySettingsWidget>();
	}
};
static_assert(alignof(UAccessibilitySettingsWidget) == 0x000008, "Wrong alignment on UAccessibilitySettingsWidget");
static_assert(sizeof(UAccessibilitySettingsWidget) == 0x000298, "Wrong size on UAccessibilitySettingsWidget");
static_assert(offsetof(UAccessibilitySettingsWidget, ColorBlindness) == 0x000290, "Member 'UAccessibilitySettingsWidget::ColorBlindness' has a wrong offset!");

// Class Stalker2.CustomConsoleManagerMB
// 0x0010 (0x00B8 - 0x00A8)
class UCustomConsoleManagerMB final : public UBaseConsoleManager
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void XSetDrawDebugExplosion(const bool bDebug, const float DebugTime);
	void XSwitchAnomalySpawnerPreset();
	void XToggleShowLightningBallAnomalyDebugInfo();
	void XToggleShowModels();
	void XToggleShowPlayerLastHeldItem();
	void XToggleShowPlayerLocation();
	void XToggleShowPlayerRequestedMainHandWeaponType();
	void XToggleShowProtection();

	void XToggleDebugExpulsionAnomaly() const;
	void XToggleShowTriggerCapsuleView() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomConsoleManagerMB">();
	}
	static class UCustomConsoleManagerMB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomConsoleManagerMB>();
	}
};
static_assert(alignof(UCustomConsoleManagerMB) == 0x000008, "Wrong alignment on UCustomConsoleManagerMB");
static_assert(sizeof(UCustomConsoleManagerMB) == 0x0000B8, "Wrong size on UCustomConsoleManagerMB");

// Class Stalker2.AnimNotify_HandIK
// 0x0018 (0x0058 - 0x0040)
class UAnimNotify_HandIK final : public UAnimNotifyBase
{
public:
	EAnimationHands                               HandToApply;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSetStartValue;                               // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartValue;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndValue;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             BlendOption;                                       // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_HandIK">();
	}
	static class UAnimNotify_HandIK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_HandIK>();
	}
};
static_assert(alignof(UAnimNotify_HandIK) == 0x000008, "Wrong alignment on UAnimNotify_HandIK");
static_assert(sizeof(UAnimNotify_HandIK) == 0x000058, "Wrong size on UAnimNotify_HandIK");
static_assert(offsetof(UAnimNotify_HandIK, HandToApply) == 0x000040, "Member 'UAnimNotify_HandIK::HandToApply' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HandIK, bForceSetStartValue) == 0x000041, "Member 'UAnimNotify_HandIK::bForceSetStartValue' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HandIK, StartValue) == 0x000044, "Member 'UAnimNotify_HandIK::StartValue' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HandIK, EndValue) == 0x000048, "Member 'UAnimNotify_HandIK::EndValue' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HandIK, BlendTime) == 0x00004C, "Member 'UAnimNotify_HandIK::BlendTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_HandIK, BlendOption) == 0x000050, "Member 'UAnimNotify_HandIK::BlendOption' has a wrong offset!");

// Class Stalker2.AchievementManager
// 0x00C0 (0x0138 - 0x0078)
class UAchievementManager final : public UBaseManager
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FUserAchievements> UsersToProgress;                                   // 0x0080(0x0050)(Transient, NativeAccessSpecifierPrivate)
	struct FUserAchievements                      DefaultUserAchievements;                           // 0x00D0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementManager">();
	}
	static class UAchievementManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementManager>();
	}
};
static_assert(alignof(UAchievementManager) == 0x000008, "Wrong alignment on UAchievementManager");
static_assert(sizeof(UAchievementManager) == 0x000138, "Wrong size on UAchievementManager");
static_assert(offsetof(UAchievementManager, UsersToProgress) == 0x000080, "Member 'UAchievementManager::UsersToProgress' has a wrong offset!");
static_assert(offsetof(UAchievementManager, DefaultUserAchievements) == 0x0000D0, "Member 'UAchievementManager::DefaultUserAchievements' has a wrong offset!");

// Class Stalker2.LookAtTargetComponent
// 0x0000 (0x02A0 - 0x02A0)
class ULookAtTargetComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LookAtTargetComponent">();
	}
	static class ULookAtTargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULookAtTargetComponent>();
	}
};
static_assert(alignof(ULookAtTargetComponent) == 0x000010, "Wrong alignment on ULookAtTargetComponent");
static_assert(sizeof(ULookAtTargetComponent) == 0x0002A0, "Wrong size on ULookAtTargetComponent");

// Class Stalker2.AchievementTracker
// 0x0010 (0x0038 - 0x0028)
class UAchievementTracker : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementTracker">();
	}
	static class UAchievementTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementTracker>();
	}
};
static_assert(alignof(UAchievementTracker) == 0x000008, "Wrong alignment on UAchievementTracker");
static_assert(sizeof(UAchievementTracker) == 0x000038, "Wrong size on UAchievementTracker");

// Class Stalker2.AnimInstancePlayerShadow
// 0x0070 (0x0470 - 0x0400)
class UAnimInstancePlayerShadow : public UAnimInstanceBase
{
public:
	struct FAnimPlayerShadowData                  ShadowData;                                        // 0x0400(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FAnimPlayerStateData                   StateData;                                         // 0x0430(0x003C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimInstancePlayerShadow">();
	}
	static class UAnimInstancePlayerShadow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimInstancePlayerShadow>();
	}
};
static_assert(alignof(UAnimInstancePlayerShadow) == 0x000010, "Wrong alignment on UAnimInstancePlayerShadow");
static_assert(sizeof(UAnimInstancePlayerShadow) == 0x000470, "Wrong size on UAnimInstancePlayerShadow");
static_assert(offsetof(UAnimInstancePlayerShadow, ShadowData) == 0x000400, "Member 'UAnimInstancePlayerShadow::ShadowData' has a wrong offset!");
static_assert(offsetof(UAnimInstancePlayerShadow, StateData) == 0x000430, "Member 'UAnimInstancePlayerShadow::StateData' has a wrong offset!");

// Class Stalker2.AchievementTracker_Debug
// 0x0008 (0x0040 - 0x0038)
class UAchievementTracker_Debug final : public UAchievementTracker
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementTracker_Debug">();
	}
	static class UAchievementTracker_Debug* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementTracker_Debug>();
	}
};
static_assert(alignof(UAchievementTracker_Debug) == 0x000008, "Wrong alignment on UAchievementTracker_Debug");
static_assert(sizeof(UAchievementTracker_Debug) == 0x000040, "Wrong size on UAchievementTracker_Debug");

// Class Stalker2.SettingElement
// 0x1B08 (0x1D80 - 0x0278)
class USettingElement : public UWidgetBase
{
public:
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShouldHideOnShipping;                             // 0x0290(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldHideOnPresentation;                         // 0x0291(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HoveredTextStyle;                                  // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TextStyle;                                         // 0x029C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Background;                                        // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             HoveredBackground;                                 // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             UnhoveredBackground;                               // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FButtonStyle                           HoveredArrow;                                      // 0x02C0(0x0470)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FButtonStyle                           UnHoveredArrow;                                    // 0x0730(0x0470)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FProgressBarStyle                      HoveredSlider;                                     // 0x0BA0(0x02F0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FProgressBarStyle                      UnHoveredSlider;                                   // 0x0E90(0x02F0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSliderStyle                           HoveredThumbSlider;                                // 0x1180(0x05C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSliderStyle                           UnHoveredThumbSlider;                              // 0x1740(0x05C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UTextWidget*                            NameText;                                          // 0x1D00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextWidget*                            ValueText;                                         // 0x1D08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                LeftButton;                                        // 0x1D10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RightButton;                                       // 0x1D18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                LeftButtonImage;                                   // 0x1D20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                RightButtonImage;                                  // 0x1D28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProgressBar*                           ProgressBar;                                       // 0x1D30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USlider*                                Slider;                                            // 0x1D38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 NameLocSID;                                        // 0x1D40(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DescriptionLocSID;                                 // 0x1D50(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USettingElement*>                WidgetDependencies;                                // 0x1D60(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	EInputTypeForButtons                          InputTypeToDisplayButton;                          // 0x1D70(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D71[0x1];                                     // 0x1D71(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsSpecialButton;                                  // 0x1D72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D73[0x5];                                     // 0x1D73(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USettingsMenuSubView*                   Settings;                                          // 0x1D78(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnLeftButtonClicked();
	void OnRightButtonClicked();

	bool GetIsEnabledElement() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SettingElement">();
	}
	static class USettingElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingElement>();
	}
};
static_assert(alignof(USettingElement) == 0x000010, "Wrong alignment on USettingElement");
static_assert(sizeof(USettingElement) == 0x001D80, "Wrong size on USettingElement");
static_assert(offsetof(USettingElement, bShouldHideOnShipping) == 0x000290, "Member 'USettingElement::bShouldHideOnShipping' has a wrong offset!");
static_assert(offsetof(USettingElement, bShouldHideOnPresentation) == 0x000291, "Member 'USettingElement::bShouldHideOnPresentation' has a wrong offset!");
static_assert(offsetof(USettingElement, HoveredTextStyle) == 0x000294, "Member 'USettingElement::HoveredTextStyle' has a wrong offset!");
static_assert(offsetof(USettingElement, TextStyle) == 0x00029C, "Member 'USettingElement::TextStyle' has a wrong offset!");
static_assert(offsetof(USettingElement, Background) == 0x0002A8, "Member 'USettingElement::Background' has a wrong offset!");
static_assert(offsetof(USettingElement, HoveredBackground) == 0x0002B0, "Member 'USettingElement::HoveredBackground' has a wrong offset!");
static_assert(offsetof(USettingElement, UnhoveredBackground) == 0x0002B8, "Member 'USettingElement::UnhoveredBackground' has a wrong offset!");
static_assert(offsetof(USettingElement, HoveredArrow) == 0x0002C0, "Member 'USettingElement::HoveredArrow' has a wrong offset!");
static_assert(offsetof(USettingElement, UnHoveredArrow) == 0x000730, "Member 'USettingElement::UnHoveredArrow' has a wrong offset!");
static_assert(offsetof(USettingElement, HoveredSlider) == 0x000BA0, "Member 'USettingElement::HoveredSlider' has a wrong offset!");
static_assert(offsetof(USettingElement, UnHoveredSlider) == 0x000E90, "Member 'USettingElement::UnHoveredSlider' has a wrong offset!");
static_assert(offsetof(USettingElement, HoveredThumbSlider) == 0x001180, "Member 'USettingElement::HoveredThumbSlider' has a wrong offset!");
static_assert(offsetof(USettingElement, UnHoveredThumbSlider) == 0x001740, "Member 'USettingElement::UnHoveredThumbSlider' has a wrong offset!");
static_assert(offsetof(USettingElement, NameText) == 0x001D00, "Member 'USettingElement::NameText' has a wrong offset!");
static_assert(offsetof(USettingElement, ValueText) == 0x001D08, "Member 'USettingElement::ValueText' has a wrong offset!");
static_assert(offsetof(USettingElement, LeftButton) == 0x001D10, "Member 'USettingElement::LeftButton' has a wrong offset!");
static_assert(offsetof(USettingElement, RightButton) == 0x001D18, "Member 'USettingElement::RightButton' has a wrong offset!");
static_assert(offsetof(USettingElement, LeftButtonImage) == 0x001D20, "Member 'USettingElement::LeftButtonImage' has a wrong offset!");
static_assert(offsetof(USettingElement, RightButtonImage) == 0x001D28, "Member 'USettingElement::RightButtonImage' has a wrong offset!");
static_assert(offsetof(USettingElement, ProgressBar) == 0x001D30, "Member 'USettingElement::ProgressBar' has a wrong offset!");
static_assert(offsetof(USettingElement, Slider) == 0x001D38, "Member 'USettingElement::Slider' has a wrong offset!");
static_assert(offsetof(USettingElement, NameLocSID) == 0x001D40, "Member 'USettingElement::NameLocSID' has a wrong offset!");
static_assert(offsetof(USettingElement, DescriptionLocSID) == 0x001D50, "Member 'USettingElement::DescriptionLocSID' has a wrong offset!");
static_assert(offsetof(USettingElement, WidgetDependencies) == 0x001D60, "Member 'USettingElement::WidgetDependencies' has a wrong offset!");
static_assert(offsetof(USettingElement, InputTypeToDisplayButton) == 0x001D70, "Member 'USettingElement::InputTypeToDisplayButton' has a wrong offset!");
static_assert(offsetof(USettingElement, bIsSpecialButton) == 0x001D72, "Member 'USettingElement::bIsSpecialButton' has a wrong offset!");
static_assert(offsetof(USettingElement, Settings) == 0x001D78, "Member 'USettingElement::Settings' has a wrong offset!");

// Class Stalker2.AnimNotify_ResetControlRotation
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_ResetControlRotation final : public UAnimNotifyBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_ResetControlRotation">();
	}
	static class UAnimNotify_ResetControlRotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_ResetControlRotation>();
	}
};
static_assert(alignof(UAnimNotify_ResetControlRotation) == 0x000008, "Wrong alignment on UAnimNotify_ResetControlRotation");
static_assert(sizeof(UAnimNotify_ResetControlRotation) == 0x000040, "Wrong size on UAnimNotify_ResetControlRotation");

// Class Stalker2.AchievementTracker_HoarderBase
// 0x0058 (0x0090 - 0x0038)
class UAchievementTracker_HoarderBase : public UAchievementTracker
{
public:
	uint8                                         Pad_38[0x58];                                      // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementTracker_HoarderBase">();
	}
	static class UAchievementTracker_HoarderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementTracker_HoarderBase>();
	}
};
static_assert(alignof(UAchievementTracker_HoarderBase) == 0x000008, "Wrong alignment on UAchievementTracker_HoarderBase");
static_assert(sizeof(UAchievementTracker_HoarderBase) == 0x000090, "Wrong size on UAchievementTracker_HoarderBase");

// Class Stalker2.AchievementTracker_ArtifactBaseHoarder
// 0x0000 (0x0090 - 0x0090)
class UAchievementTracker_ArtifactBaseHoarder : public UAchievementTracker_HoarderBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementTracker_ArtifactBaseHoarder">();
	}
	static class UAchievementTracker_ArtifactBaseHoarder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementTracker_ArtifactBaseHoarder>();
	}
};
static_assert(alignof(UAchievementTracker_ArtifactBaseHoarder) == 0x000008, "Wrong alignment on UAchievementTracker_ArtifactBaseHoarder");
static_assert(sizeof(UAchievementTracker_ArtifactBaseHoarder) == 0x000090, "Wrong size on UAchievementTracker_ArtifactBaseHoarder");

// Class Stalker2.AchievementTrigger
// 0x0018 (0x02B0 - 0x0298)
class AAchievementTrigger final : public AActor
{
public:
	class UBoxComponent*                          TriggerArea;                                       // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AchievementSID;                                    // 0x02A0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementTrigger">();
	}
	static class AAchievementTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAchievementTrigger>();
	}
};
static_assert(alignof(AAchievementTrigger) == 0x000008, "Wrong alignment on AAchievementTrigger");
