#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tether

#include "Basic.hpp"

#include "Tether_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Tether.TetherCableActor
// 0x01B8 (0x0450 - 0x0298)
class ATetherCableActor final : public AActor
{
public:
	struct FTetherCableProperties                 CableProperties;                                   // 0x0298(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bLockCurrentState;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousRealtime;                              // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RealtimeInEditorTimeDilation;                      // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeSimulationParticles;                // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeSimulationCollision;                // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeBuiltStaticMeshPoints;              // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeContactPoints;                      // 0x034B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeComponentLocations;                 // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugVisualizeTangents;                           // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneRoot;                                         // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              TimeCreated;                                       // 0x0360(0x0008)(ZeroConstructor, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTetherGuideSplineComponent*            GuideSpline;                                       // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTetherSimulationModel                 ActiveSimulationModel;                             // 0x0370(0x0080)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMesh*                            StaticMesh;                                        // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCableMeshGenerationCurveDescription   BuiltCurveDescriptionLocalSpaceSimplified;         // 0x03F8(0x0040)(NativeAccessSpecifierPrivate)
	class UTetherCableMeshComponent*              DynamicPreviewMesh;                                // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTetherMeshGenerator*                   MeshGenerator;                                     // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherCableActor">();
	}
	static class ATetherCableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATetherCableActor>();
	}
};
static_assert(alignof(ATetherCableActor) == 0x000010, "Wrong alignment on ATetherCableActor");
static_assert(sizeof(ATetherCableActor) == 0x000450, "Wrong size on ATetherCableActor");
static_assert(offsetof(ATetherCableActor, CableProperties) == 0x000298, "Member 'ATetherCableActor::CableProperties' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bLockCurrentState) == 0x000340, "Member 'ATetherCableActor::bLockCurrentState' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bSynchronousRealtime) == 0x000341, "Member 'ATetherCableActor::bSynchronousRealtime' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, RealtimeInEditorTimeDilation) == 0x000344, "Member 'ATetherCableActor::RealtimeInEditorTimeDilation' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeSimulationParticles) == 0x000348, "Member 'ATetherCableActor::bDebugVisualizeSimulationParticles' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeSimulationCollision) == 0x000349, "Member 'ATetherCableActor::bDebugVisualizeSimulationCollision' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeBuiltStaticMeshPoints) == 0x00034A, "Member 'ATetherCableActor::bDebugVisualizeBuiltStaticMeshPoints' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeContactPoints) == 0x00034B, "Member 'ATetherCableActor::bDebugVisualizeContactPoints' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeComponentLocations) == 0x00034C, "Member 'ATetherCableActor::bDebugVisualizeComponentLocations' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bDebugVisualizeTangents) == 0x00034D, "Member 'ATetherCableActor::bDebugVisualizeTangents' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, bVisible) == 0x00034E, "Member 'ATetherCableActor::bVisible' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, SceneRoot) == 0x000350, "Member 'ATetherCableActor::SceneRoot' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, StaticMeshComponent) == 0x000358, "Member 'ATetherCableActor::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, TimeCreated) == 0x000360, "Member 'ATetherCableActor::TimeCreated' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, GuideSpline) == 0x000368, "Member 'ATetherCableActor::GuideSpline' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, ActiveSimulationModel) == 0x000370, "Member 'ATetherCableActor::ActiveSimulationModel' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, StaticMesh) == 0x0003F0, "Member 'ATetherCableActor::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, BuiltCurveDescriptionLocalSpaceSimplified) == 0x0003F8, "Member 'ATetherCableActor::BuiltCurveDescriptionLocalSpaceSimplified' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, DynamicPreviewMesh) == 0x000438, "Member 'ATetherCableActor::DynamicPreviewMesh' has a wrong offset!");
static_assert(offsetof(ATetherCableActor, MeshGenerator) == 0x000440, "Member 'ATetherCableActor::MeshGenerator' has a wrong offset!");

// Class Tether.TetherCableMeshComponent
// 0x0050 (0x05F0 - 0x05A0)
class UTetherCableMeshComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_598[0x58];                                     // 0x0598(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherCableMeshComponent">();
	}
	static class UTetherCableMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherCableMeshComponent>();
	}
};
static_assert(alignof(UTetherCableMeshComponent) == 0x000010, "Wrong alignment on UTetherCableMeshComponent");
static_assert(sizeof(UTetherCableMeshComponent) == 0x0005F0, "Wrong size on UTetherCableMeshComponent");

// Class Tether.TetherGuideSplineMetadata
// 0x0010 (0x0038 - 0x0028)
class UTetherGuideSplineMetadata final : public USplineMetadata
{
public:
	TArray<class UTetherPointSegmentDefinition*>  PointSegmentDefinitions;                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherGuideSplineMetadata">();
	}
	static class UTetherGuideSplineMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherGuideSplineMetadata>();
	}
};
static_assert(alignof(UTetherGuideSplineMetadata) == 0x000008, "Wrong alignment on UTetherGuideSplineMetadata");
static_assert(sizeof(UTetherGuideSplineMetadata) == 0x000038, "Wrong size on UTetherGuideSplineMetadata");
static_assert(offsetof(UTetherGuideSplineMetadata, PointSegmentDefinitions) == 0x000028, "Member 'UTetherGuideSplineMetadata::PointSegmentDefinitions' has a wrong offset!");

// Class Tether.TetherGuideSplineComponent
// 0x0030 (0x06B0 - 0x0680)
class UTetherGuideSplineComponent final : public USplineComponent
{
public:
	uint8                                         Pad_678[0x30];                                     // 0x0678(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UTetherGuideSplineMetadata*             MetaData;                                          // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherGuideSplineComponent">();
	}
	static class UTetherGuideSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherGuideSplineComponent>();
	}
};
static_assert(alignof(UTetherGuideSplineComponent) == 0x000010, "Wrong alignment on UTetherGuideSplineComponent");
static_assert(sizeof(UTetherGuideSplineComponent) == 0x0006B0, "Wrong size on UTetherGuideSplineComponent");
static_assert(offsetof(UTetherGuideSplineComponent, MetaData) == 0x0006A8, "Member 'UTetherGuideSplineComponent::MetaData' has a wrong offset!");

// Class Tether.TetherMeshGenerator
// 0x0000 (0x0028 - 0x0028)
class UTetherMeshGenerator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherMeshGenerator">();
	}
	static class UTetherMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherMeshGenerator>();
	}
};
static_assert(alignof(UTetherMeshGenerator) == 0x000008, "Wrong alignment on UTetherMeshGenerator");
static_assert(sizeof(UTetherMeshGenerator) == 0x000028, "Wrong size on UTetherMeshGenerator");

// Class Tether.TetherPointSegmentDefinition
// 0x0008 (0x0030 - 0x0028)
class UTetherPointSegmentDefinition final : public UObject
{
public:
	float                                         Slack;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTetherSegmentSimulationOptions        SimulationOptions;                                 // 0x002C(0x0002)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TetherPointSegmentDefinition">();
	}
	static class UTetherPointSegmentDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTetherPointSegmentDefinition>();
	}
};
static_assert(alignof(UTetherPointSegmentDefinition) == 0x000008, "Wrong alignment on UTetherPointSegmentDefinition");
static_assert(sizeof(UTetherPointSegmentDefinition) == 0x000030, "Wrong size on UTetherPointSegmentDefinition");
static_assert(offsetof(UTetherPointSegmentDefinition, Slack) == 0x000028, "Member 'UTetherPointSegmentDefinition::Slack' has a wrong offset!");
static_assert(offsetof(UTetherPointSegmentDefinition, SimulationOptions) == 0x00002C, "Member 'UTetherPointSegmentDefinition::SimulationOptions' has a wrong offset!");

// Class Tether.TMG_Basic
// 0x0020 (0x0048 - 0x0028)
class UTMG_Basic final : public UTetherMeshGenerator
{
public:
	struct FBasicMeshProperties                   Properties;                                        // 0x0028(0x001C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TMG_Basic">();
	}
	static class UTMG_Basic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTMG_Basic>();
	}
};
static_assert(alignof(UTMG_Basic) == 0x000008, "Wrong alignment on UTMG_Basic");
static_assert(sizeof(UTMG_Basic) == 0x000048, "Wrong size on UTMG_Basic");
static_assert(offsetof(UTMG_Basic, Properties) == 0x000028, "Member 'UTMG_Basic::Properties' has a wrong offset!");

// Class Tether.TMG_CustomMesh
// 0x0040 (0x0068 - 0x0028)
class UTMG_CustomMesh final : public UTetherMeshGenerator
{
public:
	struct FCustomMeshProperties                  Properties;                                        // 0x0028(0x0040)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TMG_CustomMesh">();
	}
	static class UTMG_CustomMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTMG_CustomMesh>();
	}
};
static_assert(alignof(UTMG_CustomMesh) == 0x000008, "Wrong alignment on UTMG_CustomMesh");
static_assert(sizeof(UTMG_CustomMesh) == 0x000068, "Wrong size on UTMG_CustomMesh");
static_assert(offsetof(UTMG_CustomMesh, Properties) == 0x000028, "Member 'UTMG_CustomMesh::Properties' has a wrong offset!");

}

