#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Attaches

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Attaches.W_Attaches_C.AddAttach
// 0x0010 (0x0010 - 0x0000)
struct W_Attaches_C_AddAttach final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Attaches_C_AddAttach) == 0x000008, "Wrong alignment on W_Attaches_C_AddAttach");
static_assert(sizeof(W_Attaches_C_AddAttach) == 0x000010, "Wrong size on W_Attaches_C_AddAttach");
static_assert(offsetof(W_Attaches_C_AddAttach, NewParam) == 0x000000, "Member 'W_Attaches_C_AddAttach::NewParam' has a wrong offset!");
static_assert(offsetof(W_Attaches_C_AddAttach, Texture) == 0x000008, "Member 'W_Attaches_C_AddAttach::Texture' has a wrong offset!");

// Function W_Attaches.W_Attaches_C.ExecuteUbergraph_W_Attaches
// 0x0020 (0x0020 - 0x0000)
struct W_Attaches_C_ExecuteUbergraph_W_Attaches final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewParam;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_AttachImage_C*                       K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Attaches_C_ExecuteUbergraph_W_Attaches) == 0x000008, "Wrong alignment on W_Attaches_C_ExecuteUbergraph_W_Attaches");
static_assert(sizeof(W_Attaches_C_ExecuteUbergraph_W_Attaches) == 0x000020, "Wrong size on W_Attaches_C_ExecuteUbergraph_W_Attaches");
static_assert(offsetof(W_Attaches_C_ExecuteUbergraph_W_Attaches, EntryPoint) == 0x000000, "Member 'W_Attaches_C_ExecuteUbergraph_W_Attaches::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Attaches_C_ExecuteUbergraph_W_Attaches, Temp_int_Variable) == 0x000004, "Member 'W_Attaches_C_ExecuteUbergraph_W_Attaches::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_Attaches_C_ExecuteUbergraph_W_Attaches, K2Node_CustomEvent_NewParam) == 0x000008, "Member 'W_Attaches_C_ExecuteUbergraph_W_Attaches::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(W_Attaches_C_ExecuteUbergraph_W_Attaches, K2Node_CustomEvent_Texture) == 0x000010, "Member 'W_Attaches_C_ExecuteUbergraph_W_Attaches::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(W_Attaches_C_ExecuteUbergraph_W_Attaches, K2Node_Select_Default) == 0x000018, "Member 'W_Attaches_C_ExecuteUbergraph_W_Attaches::K2Node_Select_Default' has a wrong offset!");

}

