#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Attaches

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Attaches.W_Attaches_C
// 0x0028 (0x02A0 - 0x0278)
class UW_Attaches_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_AttachImage_C*                       W_AttachImage;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AttachImage_C*                       W_AttachImage_1;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AttachImage_C*                       W_AttachImage_2;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_AttachImage_C*                       W_AttachImage_3;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddAttach(int32 NewParam, class UTexture2D* Texture);
	void ClearImages();
	void ExecuteUbergraph_W_Attaches(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Attaches_C">();
	}
	static class UW_Attaches_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Attaches_C>();
	}
};
static_assert(alignof(UW_Attaches_C) == 0x000008, "Wrong alignment on UW_Attaches_C");
static_assert(sizeof(UW_Attaches_C) == 0x0002A0, "Wrong size on UW_Attaches_C");
static_assert(offsetof(UW_Attaches_C, UberGraphFrame) == 0x000278, "Member 'UW_Attaches_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Attaches_C, W_AttachImage) == 0x000280, "Member 'UW_Attaches_C::W_AttachImage' has a wrong offset!");
static_assert(offsetof(UW_Attaches_C, W_AttachImage_1) == 0x000288, "Member 'UW_Attaches_C::W_AttachImage_1' has a wrong offset!");
static_assert(offsetof(UW_Attaches_C, W_AttachImage_2) == 0x000290, "Member 'UW_Attaches_C::W_AttachImage_2' has a wrong offset!");
static_assert(offsetof(UW_Attaches_C, W_AttachImage_3) == 0x000298, "Member 'UW_Attaches_C::W_AttachImage_3' has a wrong offset!");

}

