#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassMarker

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CompassMarker.W_CompassMarker_C
// 0x0018 (0x02E0 - 0x02C8)
class UW_CompassMarker_C final : public UMarkerCompassWidget
{
public:
	class UWidgetAnimation*                       HideShowAnim;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BattleModScaleAndOpacityAnim;                      // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BackStateAnim;                                     // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void Get_IconImage_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CompassMarker_C">();
	}
	static class UW_CompassMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CompassMarker_C>();
	}
};
static_assert(alignof(UW_CompassMarker_C) == 0x000008, "Wrong alignment on UW_CompassMarker_C");
static_assert(sizeof(UW_CompassMarker_C) == 0x0002E0, "Wrong size on UW_CompassMarker_C");
static_assert(offsetof(UW_CompassMarker_C, HideShowAnim) == 0x0002C8, "Member 'UW_CompassMarker_C::HideShowAnim' has a wrong offset!");
static_assert(offsetof(UW_CompassMarker_C, BattleModScaleAndOpacityAnim) == 0x0002D0, "Member 'UW_CompassMarker_C::BattleModScaleAndOpacityAnim' has a wrong offset!");
static_assert(offsetof(UW_CompassMarker_C, BackStateAnim) == 0x0002D8, "Member 'UW_CompassMarker_C::BackStateAnim' has a wrong offset!");

}

