#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Compass

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Compass.W_Compass_C
// 0x0018 (0x0408 - 0x03F0)
class UW_Compass_C final : public UCompassWidget
{
public:
	class UImage*                                 Image_79;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Compass_C">();
	}
	static class UW_Compass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Compass_C>();
	}
};
static_assert(alignof(UW_Compass_C) == 0x000008, "Wrong alignment on UW_Compass_C");
static_assert(sizeof(UW_Compass_C) == 0x000408, "Wrong size on UW_Compass_C");
static_assert(offsetof(UW_Compass_C, Image_79) == 0x0003F0, "Member 'UW_Compass_C::Image_79' has a wrong offset!");
static_assert(offsetof(UW_Compass_C, RetainerBox) == 0x0003F8, "Member 'UW_Compass_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UW_Compass_C, RetainerBox_0) == 0x000400, "Member 'UW_Compass_C::RetainerBox_0' has a wrong offset!");

}

