#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ControlSettingsPopup

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ControlSettingsPopup.W_ControlSettingsPopup_C
// 0x0020 (0x0390 - 0x0370)
class UW_ControlSettingsPopup_C final : public UControlSettingsPopup
{
public:
	class UW_PopupBackground_C*                   Background;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C_2;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C_3;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ControlSettingsPopup_C">();
	}
	static class UW_ControlSettingsPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ControlSettingsPopup_C>();
	}
};
static_assert(alignof(UW_ControlSettingsPopup_C) == 0x000008, "Wrong alignment on UW_ControlSettingsPopup_C");
static_assert(sizeof(UW_ControlSettingsPopup_C) == 0x000390, "Wrong size on UW_ControlSettingsPopup_C");
static_assert(offsetof(UW_ControlSettingsPopup_C, Background) == 0x000370, "Member 'UW_ControlSettingsPopup_C::Background' has a wrong offset!");
static_assert(offsetof(UW_ControlSettingsPopup_C, W_Image_C) == 0x000378, "Member 'UW_ControlSettingsPopup_C::W_Image_C' has a wrong offset!");
static_assert(offsetof(UW_ControlSettingsPopup_C, W_Image_C_2) == 0x000380, "Member 'UW_ControlSettingsPopup_C::W_Image_C_2' has a wrong offset!");
static_assert(offsetof(UW_ControlSettingsPopup_C, W_Image_C_3) == 0x000388, "Member 'UW_ControlSettingsPopup_C::W_Image_C_3' has a wrong offset!");

}

