#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crosshair

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Crosshair.W_Crosshair_C
// 0x0020 (0x0380 - 0x0360)
class UW_Crosshair_C final : public UCrosshairWidgetSwitcher
{
public:
	class UW_CrosshairArc_C*                      W_CrosshairArc;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CrosshairCirle_C*                    W_CrosshairCirle;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CrosshairCross_C*                    W_CrosshairCross;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CrosshairPoint_C*                    W_CrosshairPoint;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Crosshair_C">();
	}
	static class UW_Crosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Crosshair_C>();
	}
};
static_assert(alignof(UW_Crosshair_C) == 0x000008, "Wrong alignment on UW_Crosshair_C");
static_assert(sizeof(UW_Crosshair_C) == 0x000380, "Wrong size on UW_Crosshair_C");
static_assert(offsetof(UW_Crosshair_C, W_CrosshairArc) == 0x000360, "Member 'UW_Crosshair_C::W_CrosshairArc' has a wrong offset!");
static_assert(offsetof(UW_Crosshair_C, W_CrosshairCirle) == 0x000368, "Member 'UW_Crosshair_C::W_CrosshairCirle' has a wrong offset!");
static_assert(offsetof(UW_Crosshair_C, W_CrosshairCross) == 0x000370, "Member 'UW_Crosshair_C::W_CrosshairCross' has a wrong offset!");
static_assert(offsetof(UW_Crosshair_C, W_CrosshairPoint) == 0x000378, "Member 'UW_Crosshair_C::W_CrosshairPoint' has a wrong offset!");

}

