#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FirstTimeSettingsView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FirstTimeSettingsView.W_FirstTimeSettingsView_C
// 0x0080 (0x04D0 - 0x0450)
class UW_FirstTimeSettingsView_C final : public USettingsView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_1;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FirstTimeSettings_C*                 FirstTimeSettings;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintInputController_C*               HintNavLeft;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintInputController_C*               HintNavRight;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              MainMenuOptionsText;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              MainMenuText;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              GammaTexture;                                      // 0x04A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_FirstTimeSettingsView(int32 EntryPoint);
	void Construct();
	void BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature(const bool InSelected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FirstTimeSettingsView_C">();
	}
	static class UW_FirstTimeSettingsView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FirstTimeSettingsView_C>();
	}
};
static_assert(alignof(UW_FirstTimeSettingsView_C) == 0x000008, "Wrong alignment on UW_FirstTimeSettingsView_C");
static_assert(sizeof(UW_FirstTimeSettingsView_C) == 0x0004D0, "Wrong size on UW_FirstTimeSettingsView_C");
static_assert(offsetof(UW_FirstTimeSettingsView_C, UberGraphFrame) == 0x000450, "Member 'UW_FirstTimeSettingsView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, Background_1) == 0x000458, "Member 'UW_FirstTimeSettingsView_C::Background_1' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, FirstTimeSettings) == 0x000460, "Member 'UW_FirstTimeSettingsView_C::FirstTimeSettings' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, HintNavLeft) == 0x000468, "Member 'UW_FirstTimeSettingsView_C::HintNavLeft' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, HintNavRight) == 0x000470, "Member 'UW_FirstTimeSettingsView_C::HintNavRight' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, MainMenuOptionsText) == 0x000478, "Member 'UW_FirstTimeSettingsView_C::MainMenuOptionsText' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, MainMenuText) == 0x000480, "Member 'UW_FirstTimeSettingsView_C::MainMenuText' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, MainOverlay) == 0x000488, "Member 'UW_FirstTimeSettingsView_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, MainSwitcher) == 0x000490, "Member 'UW_FirstTimeSettingsView_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, VerticalBox_0) == 0x000498, "Member 'UW_FirstTimeSettingsView_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UW_FirstTimeSettingsView_C, GammaTexture) == 0x0004A0, "Member 'UW_FirstTimeSettingsView_C::GammaTexture' has a wrong offset!");

}

