#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FirstTimeSettingsView

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_FirstTimeSettingsView.W_FirstTimeSettingsView_C.ExecuteUbergraph_W_FirstTimeSettingsView
// 0x000C (0x000C - 0x0000)
struct W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_InSelected;             // 0x0007(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView) == 0x000004, "Wrong alignment on W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView");
static_assert(sizeof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView) == 0x00000C, "Wrong size on W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, EntryPoint) == 0x000000, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, Temp_bool_Variable) == 0x000004, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, Temp_byte_Variable) == 0x000005, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, Temp_byte_Variable_1) == 0x000006, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, K2Node_ComponentBoundEvent_InSelected) == 0x000007, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::K2Node_ComponentBoundEvent_InSelected' has a wrong offset!");
static_assert(offsetof(W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView, K2Node_Select_Default) == 0x000008, "Member 'W_FirstTimeSettingsView_C_ExecuteUbergraph_W_FirstTimeSettingsView::K2Node_Select_Default' has a wrong offset!");

// Function W_FirstTimeSettingsView.W_FirstTimeSettingsView_C.BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature final
{
public:
	bool                                          InSelected;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature) == 0x000001, "Wrong alignment on W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature");
static_assert(sizeof(W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature) == 0x000001, "Wrong size on W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature");
static_assert(offsetof(W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature, InSelected) == 0x000000, "Member 'W_FirstTimeSettingsView_C_BndEvt__W_FirstTimeSettingsView_FirstTimeSettings_K2Node_ComponentBoundEvent_0_OnGammaSelected__DelegateSignature::InSelected' has a wrong offset!");

}

