#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hint_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Hint_PC.W_Hint_PC_C
// 0x0018 (0x0448 - 0x0430)
class UW_Hint_PC_C final : public UHintKey
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnRunActionAnim;                                   // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlaydClickAnim;                                 // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Hint_PC(int32 EntryPoint);
	void SequenceEvent_0();
	void SequenceEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Hint_PC_C">();
	}
	static class UW_Hint_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Hint_PC_C>();
	}
};
static_assert(alignof(UW_Hint_PC_C) == 0x000008, "Wrong alignment on UW_Hint_PC_C");
static_assert(sizeof(UW_Hint_PC_C) == 0x000448, "Wrong size on UW_Hint_PC_C");
static_assert(offsetof(UW_Hint_PC_C, UberGraphFrame) == 0x000430, "Member 'UW_Hint_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Hint_PC_C, OnRunActionAnim) == 0x000438, "Member 'UW_Hint_PC_C::OnRunActionAnim' has a wrong offset!");
static_assert(offsetof(UW_Hint_PC_C, bIsPlaydClickAnim) == 0x000440, "Member 'UW_Hint_PC_C::bIsPlaydClickAnim' has a wrong offset!");

}

