#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hint_Console

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Hint_Console.W_Hint_Console_C
// 0x0038 (0x0468 - 0x0430)
class UW_Hint_Console_C final : public UHintKey
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnRunActionAnim;                                   // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SingleCliskAnim;                                   // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Image_C*                             circle;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             CircleBeck;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HintSizeBox;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsPlaydClickAnim;                                 // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Hint_Console(int32 EntryPoint);
	void FinishAnimation();
	TArray<class UImageWidget*> GetAllBackgroundsImage();
	TArray<class UImageWidget*> GetAllFirstPlanImage();
	void PlayHintAnimation_1(bool IsSingleClick);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Hint_Console_C">();
	}
	static class UW_Hint_Console_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Hint_Console_C>();
	}
};
static_assert(alignof(UW_Hint_Console_C) == 0x000008, "Wrong alignment on UW_Hint_Console_C");
static_assert(sizeof(UW_Hint_Console_C) == 0x000468, "Wrong size on UW_Hint_Console_C");
static_assert(offsetof(UW_Hint_Console_C, UberGraphFrame) == 0x000430, "Member 'UW_Hint_Console_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, OnRunActionAnim) == 0x000438, "Member 'UW_Hint_Console_C::OnRunActionAnim' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, SingleCliskAnim) == 0x000440, "Member 'UW_Hint_Console_C::SingleCliskAnim' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, circle) == 0x000448, "Member 'UW_Hint_Console_C::circle' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, CircleBeck) == 0x000450, "Member 'UW_Hint_Console_C::CircleBeck' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, HintSizeBox) == 0x000458, "Member 'UW_Hint_Console_C::HintSizeBox' has a wrong offset!");
static_assert(offsetof(UW_Hint_Console_C, bIsPlaydClickAnim) == 0x000460, "Member 'UW_Hint_Console_C::bIsPlaydClickAnim' has a wrong offset!");

}

