#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_IdleScreenView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_IdleScreenView.W_IdleScreenView_C
// 0x0058 (0x0370 - 0x0318)
class UW_IdleScreenView_C final : public UIdleScreenView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomImage;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              HeaderShaderCompiling;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_178;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RadiationImage;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              Text_PressAnyKey;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                              Text_SettingUp;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_IdleScreenView(int32 EntryPoint);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_SpaceBar_K2Node_InputKeyEvent_0(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_IdleScreenView_C">();
	}
	static class UW_IdleScreenView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_IdleScreenView_C>();
	}
};
static_assert(alignof(UW_IdleScreenView_C) == 0x000008, "Wrong alignment on UW_IdleScreenView_C");
static_assert(sizeof(UW_IdleScreenView_C) == 0x000370, "Wrong size on UW_IdleScreenView_C");
static_assert(offsetof(UW_IdleScreenView_C, UberGraphFrame) == 0x000318, "Member 'UW_IdleScreenView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Background) == 0x000320, "Member 'UW_IdleScreenView_C::Background' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, BackgroundImage) == 0x000328, "Member 'UW_IdleScreenView_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, BottomImage) == 0x000330, "Member 'UW_IdleScreenView_C::BottomImage' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, HeaderShaderCompiling) == 0x000338, "Member 'UW_IdleScreenView_C::HeaderShaderCompiling' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Image) == 0x000340, "Member 'UW_IdleScreenView_C::Image' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Image_1) == 0x000348, "Member 'UW_IdleScreenView_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Image_178) == 0x000350, "Member 'UW_IdleScreenView_C::Image_178' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, RadiationImage) == 0x000358, "Member 'UW_IdleScreenView_C::RadiationImage' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Text_PressAnyKey) == 0x000360, "Member 'UW_IdleScreenView_C::Text_PressAnyKey' has a wrong offset!");
static_assert(offsetof(UW_IdleScreenView_C, Text_SettingUp) == 0x000368, "Member 'UW_IdleScreenView_C::Text_SettingUp' has a wrong offset!");

}

