#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_IdleScreenView

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function W_IdleScreenView.W_IdleScreenView_C.ExecuteUbergraph_W_IdleScreenView
// 0x0038 (0x0038 - 0x0000)
struct W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0020(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView) == 0x000008, "Wrong alignment on W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView");
static_assert(sizeof(W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView) == 0x000038, "Wrong size on W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView");
static_assert(offsetof(W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView, EntryPoint) == 0x000000, "Member 'W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView, K2Node_InputKeyEvent_Key) == 0x000008, "Member 'W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView, K2Node_InputKeyEvent_Key_1) == 0x000020, "Member 'W_IdleScreenView_C_ExecuteUbergraph_W_IdleScreenView::K2Node_InputKeyEvent_Key_1' has a wrong offset!");

// Function W_IdleScreenView.W_IdleScreenView_C.InpActEvt_AnyKey_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1");
static_assert(sizeof(W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1");
static_assert(offsetof(W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'W_IdleScreenView_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function W_IdleScreenView.W_IdleScreenView_C.InpActEvt_SpaceBar_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0");
static_assert(sizeof(W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0");
static_assert(offsetof(W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'W_IdleScreenView_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

}

