#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InteractHint_Console

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_InteractHint_Console.W_InteractHint_Console_C.GetAllBackgroundsImage
// 0x0020 (0x0020 - 0x0000)
struct W_InteractHint_Console_C_GetAllBackgroundsImage final
{
public:
	TArray<class UImageWidget*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UImageWidget*>                   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(W_InteractHint_Console_C_GetAllBackgroundsImage) == 0x000008, "Wrong alignment on W_InteractHint_Console_C_GetAllBackgroundsImage");
static_assert(sizeof(W_InteractHint_Console_C_GetAllBackgroundsImage) == 0x000020, "Wrong size on W_InteractHint_Console_C_GetAllBackgroundsImage");
static_assert(offsetof(W_InteractHint_Console_C_GetAllBackgroundsImage, ReturnValue) == 0x000000, "Member 'W_InteractHint_Console_C_GetAllBackgroundsImage::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InteractHint_Console_C_GetAllBackgroundsImage, K2Node_MakeArray_Array) == 0x000010, "Member 'W_InteractHint_Console_C_GetAllBackgroundsImage::K2Node_MakeArray_Array' has a wrong offset!");

// Function W_InteractHint_Console.W_InteractHint_Console_C.GetAllFirstPlanImage
// 0x0020 (0x0020 - 0x0000)
struct W_InteractHint_Console_C_GetAllFirstPlanImage final
{
public:
	TArray<class UImageWidget*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UImageWidget*>                   K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(W_InteractHint_Console_C_GetAllFirstPlanImage) == 0x000008, "Wrong alignment on W_InteractHint_Console_C_GetAllFirstPlanImage");
static_assert(sizeof(W_InteractHint_Console_C_GetAllFirstPlanImage) == 0x000020, "Wrong size on W_InteractHint_Console_C_GetAllFirstPlanImage");
static_assert(offsetof(W_InteractHint_Console_C_GetAllFirstPlanImage, ReturnValue) == 0x000000, "Member 'W_InteractHint_Console_C_GetAllFirstPlanImage::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_InteractHint_Console_C_GetAllFirstPlanImage, K2Node_MakeArray_Array) == 0x000010, "Member 'W_InteractHint_Console_C_GetAllFirstPlanImage::K2Node_MakeArray_Array' has a wrong offset!");

}

