#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemStatProgress

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemStatProgress.W_ItemStatProgress_C
// 0x0028 (0x0300 - 0x02D8)
class UW_ItemStatProgress_C final : public UItemStatProgress
{
public:
	class UImage*                                 Image_62;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ParamImage;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   NameText;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ItemStatProgress_C">();
	}
	static class UW_ItemStatProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemStatProgress_C>();
	}
};
static_assert(alignof(UW_ItemStatProgress_C) == 0x000008, "Wrong alignment on UW_ItemStatProgress_C");
static_assert(sizeof(UW_ItemStatProgress_C) == 0x000300, "Wrong size on UW_ItemStatProgress_C");
static_assert(offsetof(UW_ItemStatProgress_C, Image_62) == 0x0002D8, "Member 'UW_ItemStatProgress_C::Image_62' has a wrong offset!");
static_assert(offsetof(UW_ItemStatProgress_C, ParamImage) == 0x0002E0, "Member 'UW_ItemStatProgress_C::ParamImage' has a wrong offset!");
static_assert(offsetof(UW_ItemStatProgress_C, NameText) == 0x0002E8, "Member 'UW_ItemStatProgress_C::NameText' has a wrong offset!");

}

