#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemInfo

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemInfo.W_ItemInfo_C
// 0x0060 (0x0DA0 - 0x0D40)
class UW_ItemInfo_C final : public UItemInfo
{
public:
	class UImage*                                 AmmoTypeUnderline;                                 // 0x0D40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       BackgroundInvalidationBox;                         // 0x0D48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           DurabilityRetainerBox;                             // 0x0D50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FittingWeaponsUnderline;                           // 0x0D58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullBack_Bottom_Left;                              // 0x0D60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullBack_Bottom_Right;                             // 0x0D68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullBack_Top_Left;                                 // 0x0D70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullBack_Top_Right;                                // 0x0D78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0D80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_191;                                         // 0x0D88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_323;                                         // 0x0D90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Stroke_Center_Top;                                 // 0x0D98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ItemInfo_C">();
	}
	static class UW_ItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ItemInfo_C>();
	}
};
static_assert(alignof(UW_ItemInfo_C) == 0x000010, "Wrong alignment on UW_ItemInfo_C");
static_assert(sizeof(UW_ItemInfo_C) == 0x000DA0, "Wrong size on UW_ItemInfo_C");
static_assert(offsetof(UW_ItemInfo_C, AmmoTypeUnderline) == 0x000D40, "Member 'UW_ItemInfo_C::AmmoTypeUnderline' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, BackgroundInvalidationBox) == 0x000D48, "Member 'UW_ItemInfo_C::BackgroundInvalidationBox' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, DurabilityRetainerBox) == 0x000D50, "Member 'UW_ItemInfo_C::DurabilityRetainerBox' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, FittingWeaponsUnderline) == 0x000D58, "Member 'UW_ItemInfo_C::FittingWeaponsUnderline' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, FullBack_Bottom_Left) == 0x000D60, "Member 'UW_ItemInfo_C::FullBack_Bottom_Left' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, FullBack_Bottom_Right) == 0x000D68, "Member 'UW_ItemInfo_C::FullBack_Bottom_Right' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, FullBack_Top_Left) == 0x000D70, "Member 'UW_ItemInfo_C::FullBack_Top_Left' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, FullBack_Top_Right) == 0x000D78, "Member 'UW_ItemInfo_C::FullBack_Top_Right' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image) == 0x000D80, "Member 'UW_ItemInfo_C::Image' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image_191) == 0x000D88, "Member 'UW_ItemInfo_C::Image_191' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Image_323) == 0x000D90, "Member 'UW_ItemInfo_C::Image_323' has a wrong offset!");
static_assert(offsetof(UW_ItemInfo_C, Stroke_Center_Top) == 0x000D98, "Member 'UW_ItemInfo_C::Stroke_Center_Top' has a wrong offset!");

}

