#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadingScreen

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadingScreen.W_LoadingScreen_C
// 0x0018 (0x0368 - 0x0350)
class UW_LoadingScreen_C final : public ULoadingScreenWidget
{
public:
	class UImage*                                 Background;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Template;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadingScreenVignette_C*             W_LoadingScreenVignette;                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadingScreen_C">();
	}
	static class UW_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadingScreen_C>();
	}
};
static_assert(alignof(UW_LoadingScreen_C) == 0x000008, "Wrong alignment on UW_LoadingScreen_C");
static_assert(sizeof(UW_LoadingScreen_C) == 0x000368, "Wrong size on UW_LoadingScreen_C");
static_assert(offsetof(UW_LoadingScreen_C, Background) == 0x000350, "Member 'UW_LoadingScreen_C::Background' has a wrong offset!");
static_assert(offsetof(UW_LoadingScreen_C, Template) == 0x000358, "Member 'UW_LoadingScreen_C::Template' has a wrong offset!");
static_assert(offsetof(UW_LoadingScreen_C, W_LoadingScreenVignette) == 0x000360, "Member 'UW_LoadingScreen_C::W_LoadingScreenVignette' has a wrong offset!");

}

