#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MapTooltipBodyBackground

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MapTooltipBodyBackground.W_MapTooltipBodyBackground_C
// 0x0018 (0x0290 - 0x0278)
class UW_MapTooltipBodyBackground_C final : public UWidgetBase
{
public:
	class UImage*                                 Bottom;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Middle;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top;                                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MapTooltipBodyBackground_C">();
	}
	static class UW_MapTooltipBodyBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MapTooltipBodyBackground_C>();
	}
};
static_assert(alignof(UW_MapTooltipBodyBackground_C) == 0x000008, "Wrong alignment on UW_MapTooltipBodyBackground_C");
static_assert(sizeof(UW_MapTooltipBodyBackground_C) == 0x000290, "Wrong size on UW_MapTooltipBodyBackground_C");
static_assert(offsetof(UW_MapTooltipBodyBackground_C, Bottom) == 0x000278, "Member 'UW_MapTooltipBodyBackground_C::Bottom' has a wrong offset!");
static_assert(offsetof(UW_MapTooltipBodyBackground_C, Middle) == 0x000280, "Member 'UW_MapTooltipBodyBackground_C::Middle' has a wrong offset!");
static_assert(offsetof(UW_MapTooltipBodyBackground_C, Top) == 0x000288, "Member 'UW_MapTooltipBodyBackground_C::Top' has a wrong offset!");

}

