#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PDAQuestDetails

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PDAQuestDetails.W_PDAQuestDetails_C
// 0x0080 (0x0560 - 0x04E0)
class UW_PDAQuestDetails_C final : public UPDAQuestDetails
{
public:
	class UImage*                                 Image_197;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_356;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_456;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_606;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineHorizontal;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineLeft;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineRight;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineRight_1;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_1;                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_2;                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_3;                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_4;                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_5;                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_6;                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestRewardSlot_C*                W_PDAQuestRewardSlot_7;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PDAQuestDetails_C">();
	}
	static class UW_PDAQuestDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PDAQuestDetails_C>();
	}
};
static_assert(alignof(UW_PDAQuestDetails_C) == 0x000008, "Wrong alignment on UW_PDAQuestDetails_C");
static_assert(sizeof(UW_PDAQuestDetails_C) == 0x000560, "Wrong size on UW_PDAQuestDetails_C");
static_assert(offsetof(UW_PDAQuestDetails_C, Image_197) == 0x0004E0, "Member 'UW_PDAQuestDetails_C::Image_197' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, Image_356) == 0x0004E8, "Member 'UW_PDAQuestDetails_C::Image_356' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, Image_456) == 0x0004F0, "Member 'UW_PDAQuestDetails_C::Image_456' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, Image_606) == 0x0004F8, "Member 'UW_PDAQuestDetails_C::Image_606' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, LineHorizontal) == 0x000500, "Member 'UW_PDAQuestDetails_C::LineHorizontal' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, LineLeft) == 0x000508, "Member 'UW_PDAQuestDetails_C::LineLeft' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, LineRight) == 0x000510, "Member 'UW_PDAQuestDetails_C::LineRight' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, LineRight_1) == 0x000518, "Member 'UW_PDAQuestDetails_C::LineRight_1' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot) == 0x000520, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_1) == 0x000528, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_1' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_2) == 0x000530, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_2' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_3) == 0x000538, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_3' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_4) == 0x000540, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_4' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_5) == 0x000548, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_5' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_6) == 0x000550, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_6' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestDetails_C, W_PDAQuestRewardSlot_7) == 0x000558, "Member 'UW_PDAQuestDetails_C::W_PDAQuestRewardSlot_7' has a wrong offset!");

}

