#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PDAQuestTaskContainer

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PDAQuestTaskContainer.W_PDAQuestTaskContainer_C
// 0x0048 (0x0340 - 0x02F8)
class UW_PDAQuestTaskContainer_C final : public UPDAQuestTaskContainer
{
public:
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_1;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_2;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_3;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_4;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_5;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_6;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_7;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAQuestTaskSlot_C*                  W_PDAQuestTaskSlot_8;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PDAQuestTaskContainer_C">();
	}
	static class UW_PDAQuestTaskContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PDAQuestTaskContainer_C>();
	}
};
static_assert(alignof(UW_PDAQuestTaskContainer_C) == 0x000008, "Wrong alignment on UW_PDAQuestTaskContainer_C");
static_assert(sizeof(UW_PDAQuestTaskContainer_C) == 0x000340, "Wrong size on UW_PDAQuestTaskContainer_C");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot) == 0x0002F8, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_1) == 0x000300, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_1' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_2) == 0x000308, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_2' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_3) == 0x000310, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_3' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_4) == 0x000318, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_4' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_5) == 0x000320, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_5' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_6) == 0x000328, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_6' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_7) == 0x000330, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_7' has a wrong offset!");
static_assert(offsetof(UW_PDAQuestTaskContainer_C, W_PDAQuestTaskSlot_8) == 0x000338, "Member 'UW_PDAQuestTaskContainer_C::W_PDAQuestTaskSlot_8' has a wrong offset!");

}

