#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayVideoMainMenu

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayVideoMainMenu.W_PlayVideoMainMenu_C
// 0x0020 (0x0370 - 0x0350)
class UW_PlayVideoMainMenu_C final : public UMenuMainBackgroundVideo
{
public:
	class UImage*                                 VideoImage;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           Media_Player;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_Cursor_Value;                               // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayVideoMainMenu_C">();
	}
	static class UW_PlayVideoMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayVideoMainMenu_C>();
	}
};
static_assert(alignof(UW_PlayVideoMainMenu_C) == 0x000008, "Wrong alignment on UW_PlayVideoMainMenu_C");
static_assert(sizeof(UW_PlayVideoMainMenu_C) == 0x000370, "Wrong size on UW_PlayVideoMainMenu_C");
static_assert(offsetof(UW_PlayVideoMainMenu_C, VideoImage) == 0x000350, "Member 'UW_PlayVideoMainMenu_C::VideoImage' has a wrong offset!");
static_assert(offsetof(UW_PlayVideoMainMenu_C, Media_Player) == 0x000358, "Member 'UW_PlayVideoMainMenu_C::Media_Player' has a wrong offset!");
static_assert(offsetof(UW_PlayVideoMainMenu_C, MediaSound) == 0x000360, "Member 'UW_PlayVideoMainMenu_C::MediaSound' has a wrong offset!");
static_assert(offsetof(UW_PlayVideoMainMenu_C, Cached_Cursor_Value) == 0x000368, "Member 'UW_PlayVideoMainMenu_C::Cached_Cursor_Value' has a wrong offset!");

}

