#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayVideo

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayVideo.W_PlayVideo_C
// 0x0028 (0x0308 - 0x02E0)
class UW_PlayVideo_C final : public UPlayVideoWidget
{
public:
	class UImage*                                 Image_172;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VideoImage;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           Media_Player;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_Cursor_Value;                               // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayVideo_C">();
	}
	static class UW_PlayVideo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayVideo_C>();
	}
};
static_assert(alignof(UW_PlayVideo_C) == 0x000008, "Wrong alignment on UW_PlayVideo_C");
static_assert(sizeof(UW_PlayVideo_C) == 0x000308, "Wrong size on UW_PlayVideo_C");
static_assert(offsetof(UW_PlayVideo_C, Image_172) == 0x0002E0, "Member 'UW_PlayVideo_C::Image_172' has a wrong offset!");
static_assert(offsetof(UW_PlayVideo_C, VideoImage) == 0x0002E8, "Member 'UW_PlayVideo_C::VideoImage' has a wrong offset!");
static_assert(offsetof(UW_PlayVideo_C, Media_Player) == 0x0002F0, "Member 'UW_PlayVideo_C::Media_Player' has a wrong offset!");
static_assert(offsetof(UW_PlayVideo_C, MediaSound) == 0x0002F8, "Member 'UW_PlayVideo_C::MediaSound' has a wrong offset!");
static_assert(offsetof(UW_PlayVideo_C, Cached_Cursor_Value) == 0x000300, "Member 'UW_PlayVideo_C::Cached_Cursor_Value' has a wrong offset!");

}

