#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Popup

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Popup.W_Popup_C
// 0x0020 (0x0368 - 0x0348)
class UW_Popup_C final : public UPopupBase
{
public:
	class UW_PopupBackground_C*                   Background;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C_2;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             W_Image_C_3;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Popup_C">();
	}
	static class UW_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Popup_C>();
	}
};
static_assert(alignof(UW_Popup_C) == 0x000008, "Wrong alignment on UW_Popup_C");
static_assert(sizeof(UW_Popup_C) == 0x000368, "Wrong size on UW_Popup_C");
static_assert(offsetof(UW_Popup_C, Background) == 0x000348, "Member 'UW_Popup_C::Background' has a wrong offset!");
static_assert(offsetof(UW_Popup_C, W_Image_C) == 0x000350, "Member 'UW_Popup_C::W_Image_C' has a wrong offset!");
static_assert(offsetof(UW_Popup_C, W_Image_C_2) == 0x000358, "Member 'UW_Popup_C::W_Image_C_2' has a wrong offset!");
static_assert(offsetof(UW_Popup_C, W_Image_C_3) == 0x000360, "Member 'UW_Popup_C::W_Image_C_3' has a wrong offset!");

}

