#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PushOptionButton

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PushOptionButton.W_PushOptionButton_C
// 0x0020 (0x0320 - 0x0300)
class UW_PushOptionButton_C final : public UPushOptionButton
{
public:
	class UImage*                                 HoverBackground;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverLineBottom;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverLineUp;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PushBorder;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PushOptionButton_C">();
	}
	static class UW_PushOptionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PushOptionButton_C>();
	}
};
static_assert(alignof(UW_PushOptionButton_C) == 0x000008, "Wrong alignment on UW_PushOptionButton_C");
static_assert(sizeof(UW_PushOptionButton_C) == 0x000320, "Wrong size on UW_PushOptionButton_C");
static_assert(offsetof(UW_PushOptionButton_C, HoverBackground) == 0x000300, "Member 'UW_PushOptionButton_C::HoverBackground' has a wrong offset!");
static_assert(offsetof(UW_PushOptionButton_C, HoverLineBottom) == 0x000308, "Member 'UW_PushOptionButton_C::HoverLineBottom' has a wrong offset!");
static_assert(offsetof(UW_PushOptionButton_C, HoverLineUp) == 0x000310, "Member 'UW_PushOptionButton_C::HoverLineUp' has a wrong offset!");
static_assert(offsetof(UW_PushOptionButton_C, PushBorder) == 0x000318, "Member 'UW_PushOptionButton_C::PushBorder' has a wrong offset!");

}

