#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SaveLoadNotificationBackground

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SaveLoadNotificationBackground.W_SaveLoadNotificationBackground_C
// 0x0018 (0x0290 - 0x0278)
class UW_SaveLoadNotificationBackground_C final : public UWidgetBase
{
public:
	class UW_Image_C*                             X1y0_1;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             X1y1_1;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Image_C*                             X1y2_1;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SaveLoadNotificationBackground_C">();
	}
	static class UW_SaveLoadNotificationBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SaveLoadNotificationBackground_C>();
	}
};
static_assert(alignof(UW_SaveLoadNotificationBackground_C) == 0x000008, "Wrong alignment on UW_SaveLoadNotificationBackground_C");
static_assert(sizeof(UW_SaveLoadNotificationBackground_C) == 0x000290, "Wrong size on UW_SaveLoadNotificationBackground_C");
static_assert(offsetof(UW_SaveLoadNotificationBackground_C, X1y0_1) == 0x000278, "Member 'UW_SaveLoadNotificationBackground_C::X1y0_1' has a wrong offset!");
static_assert(offsetof(UW_SaveLoadNotificationBackground_C, X1y1_1) == 0x000280, "Member 'UW_SaveLoadNotificationBackground_C::X1y1_1' has a wrong offset!");
static_assert(offsetof(UW_SaveLoadNotificationBackground_C, X1y2_1) == 0x000288, "Member 'UW_SaveLoadNotificationBackground_C::X1y2_1' has a wrong offset!");

}

