#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingElementPercent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingElementPercent.W_SettingElementPercent_C
// 0x0020 (0x1DF0 - 0x1DD0)
class UW_SettingElementPercent_C final : public USettingsElementPercent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 TapZone;                                           // 0x1DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Down;                                              // 0x1DE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnMouseTapZoneDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_W_SettingElementPercent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingElementPercent_C">();
	}
	static class UW_SettingElementPercent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingElementPercent_C>();
	}
};
static_assert(alignof(UW_SettingElementPercent_C) == 0x000010, "Wrong alignment on UW_SettingElementPercent_C");
static_assert(sizeof(UW_SettingElementPercent_C) == 0x001DF0, "Wrong size on UW_SettingElementPercent_C");
static_assert(offsetof(UW_SettingElementPercent_C, UberGraphFrame) == 0x001DD0, "Member 'UW_SettingElementPercent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SettingElementPercent_C, TapZone) == 0x001DD8, "Member 'UW_SettingElementPercent_C::TapZone' has a wrong offset!");
static_assert(offsetof(UW_SettingElementPercent_C, Down) == 0x001DE0, "Member 'UW_SettingElementPercent_C::Down' has a wrong offset!");

}

