#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemNotificationItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SystemNotificationItem.W_SystemNotificationItem_C
// 0x0028 (0x04E8 - 0x04C0)
class UW_SystemNotificationItem_C final : public USystemNotificationItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Description_1;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        LTimestamp;                                        // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         LMin;                                              // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         LSec;                                              // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SystemNotificationItem(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SystemNotificationItem_C">();
	}
	static class UW_SystemNotificationItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SystemNotificationItem_C>();
	}
};
static_assert(alignof(UW_SystemNotificationItem_C) == 0x000008, "Wrong alignment on UW_SystemNotificationItem_C");
static_assert(sizeof(UW_SystemNotificationItem_C) == 0x0004E8, "Wrong size on UW_SystemNotificationItem_C");
static_assert(offsetof(UW_SystemNotificationItem_C, UberGraphFrame) == 0x0004C0, "Member 'UW_SystemNotificationItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SystemNotificationItem_C, Description_1) == 0x0004C8, "Member 'UW_SystemNotificationItem_C::Description_1' has a wrong offset!");
static_assert(offsetof(UW_SystemNotificationItem_C, LTimestamp) == 0x0004D0, "Member 'UW_SystemNotificationItem_C::LTimestamp' has a wrong offset!");
static_assert(offsetof(UW_SystemNotificationItem_C, LMin) == 0x0004D8, "Member 'UW_SystemNotificationItem_C::LMin' has a wrong offset!");
static_assert(offsetof(UW_SystemNotificationItem_C, LSec) == 0x0004E0, "Member 'UW_SystemNotificationItem_C::LSec' has a wrong offset!");

}

