#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SystemNotificationItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_SystemNotificationItem.W_SystemNotificationItem_C.ExecuteUbergraph_W_SystemNotificationItem
// 0x0120 (0x0120 - 0x0000)
struct W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentAudiologDuration_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0018(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_1;           // 0x0078(0x0018)()
	float                                         CallFunc_GetCurrentAudiologPlayedTime_ReturnValue; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_5;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_3;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem) == 0x000008, "Wrong alignment on W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem");
static_assert(sizeof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem) == 0x000120, "Wrong size on W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, EntryPoint) == 0x000000, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_GetCurrentAudiologDuration_ReturnValue) == 0x000004, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_GetCurrentAudiologDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000018, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, K2Node_Event_MyGeometry) == 0x000030, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, K2Node_Event_InDeltaTime) == 0x000070, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Conv_Int64ToText_ReturnValue_1) == 0x000078, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Conv_Int64ToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_GetCurrentAudiologPlayedTime_ReturnValue) == 0x000090, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_GetCurrentAudiologPlayedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000094, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000A0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000A8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x0000B8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x0000C0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_FClamp_ReturnValue) == 0x0000C8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_ReturnValue_5) == 0x0000D0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Conv_DoubleToInt64_ReturnValue_1) == 0x0000E0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Conv_DoubleToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000E8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000100, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x000108, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_Divide_DoubleDouble_A_ImplicitCast_3) == 0x000110, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_Divide_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000118, "Member 'W_SystemNotificationItem_C_ExecuteUbergraph_W_SystemNotificationItem::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function W_SystemNotificationItem.W_SystemNotificationItem_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct W_SystemNotificationItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SystemNotificationItem_C_Tick) == 0x000008, "Wrong alignment on W_SystemNotificationItem_C_Tick");
static_assert(sizeof(W_SystemNotificationItem_C_Tick) == 0x000048, "Wrong size on W_SystemNotificationItem_C_Tick");
static_assert(offsetof(W_SystemNotificationItem_C_Tick, MyGeometry) == 0x000000, "Member 'W_SystemNotificationItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SystemNotificationItem_C_Tick, InDeltaTime) == 0x000040, "Member 'W_SystemNotificationItem_C_Tick::InDeltaTime' has a wrong offset!");

}

