#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TutorialSlotPanel

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TutorialSlotPanel.W_TutorialSlotPanel_C
// 0x0058 (0x03C8 - 0x0370)
class UW_TutorialSlotPanel_C final : public UPDATutorialPanel
{
public:
	class UW_Text_C*                              W_AbsentTutorialText;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_1;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_2;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_3;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_4;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_80;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_155;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_239;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_305;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDATutorialsSlot_C*                  W_PDATutorialsSlot_360;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TutorialSlotPanel_C">();
	}
	static class UW_TutorialSlotPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TutorialSlotPanel_C>();
	}
};
static_assert(alignof(UW_TutorialSlotPanel_C) == 0x000008, "Wrong alignment on UW_TutorialSlotPanel_C");
static_assert(sizeof(UW_TutorialSlotPanel_C) == 0x0003C8, "Wrong size on UW_TutorialSlotPanel_C");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_AbsentTutorialText) == 0x000370, "Member 'UW_TutorialSlotPanel_C::W_AbsentTutorialText' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot) == 0x000378, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_1) == 0x000380, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_1' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_2) == 0x000388, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_2' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_3) == 0x000390, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_3' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_4) == 0x000398, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_4' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_80) == 0x0003A0, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_80' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_155) == 0x0003A8, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_155' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_239) == 0x0003B0, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_239' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_305) == 0x0003B8, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_305' has a wrong offset!");
static_assert(offsetof(UW_TutorialSlotPanel_C, W_PDATutorialsSlot_360) == 0x0003C0, "Member 'UW_TutorialSlotPanel_C::W_PDATutorialsSlot_360' has a wrong offset!");

}

