#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpgradeMenuNew

#include "Basic.hpp"

#include "Stalker2_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_UpgradeMenuNew.W_UpgradeMenuNew_C.DrawAttaches
// 0x0010 (0x0010 - 0x0000)
struct W_UpgradeMenuNew_C_DrawAttaches final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AttachIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UpgradeMenuNew_C_DrawAttaches) == 0x000008, "Wrong alignment on W_UpgradeMenuNew_C_DrawAttaches");
static_assert(sizeof(W_UpgradeMenuNew_C_DrawAttaches) == 0x000010, "Wrong size on W_UpgradeMenuNew_C_DrawAttaches");
static_assert(offsetof(W_UpgradeMenuNew_C_DrawAttaches, Texture) == 0x000000, "Member 'W_UpgradeMenuNew_C_DrawAttaches::Texture' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_DrawAttaches, AttachIndex) == 0x000008, "Member 'W_UpgradeMenuNew_C_DrawAttaches::AttachIndex' has a wrong offset!");

// Function W_UpgradeMenuNew.W_UpgradeMenuNew_C.ExecuteUbergraph_W_UpgradeMenuNew
// 0x00B0 (0x00B0 - 0x0000)
struct W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUpgradeSection*>                CallFunc_Map_Values_Values;                        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TMap<EUpgradeTargetPartType, class UUpgradeSection*> K2Node_MakeMap_Map;                                // 0x0018(0x0050)(ContainsInstancedReference)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture2D*                             K2Node_Event_Texture;                              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AttachIndex;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew) == 0x000008, "Wrong alignment on W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew");
static_assert(sizeof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew) == 0x0000B0, "Wrong size on W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, EntryPoint) == 0x000000, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, CallFunc_Map_Values_Values) == 0x000008, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_MakeMap_Map) == 0x000018, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_Event_IsDesignTime) == 0x000068, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000070, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_MakeStruct_Margin) == 0x000078, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000088, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_MakeStruct_Margin_1) == 0x000090, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_Event_Texture) == 0x0000A0, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_Event_Texture' has a wrong offset!");
static_assert(offsetof(W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew, K2Node_Event_AttachIndex) == 0x0000A8, "Member 'W_UpgradeMenuNew_C_ExecuteUbergraph_W_UpgradeMenuNew::K2Node_Event_AttachIndex' has a wrong offset!");

// Function W_UpgradeMenuNew.W_UpgradeMenuNew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_UpgradeMenuNew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UpgradeMenuNew_C_PreConstruct) == 0x000001, "Wrong alignment on W_UpgradeMenuNew_C_PreConstruct");
static_assert(sizeof(W_UpgradeMenuNew_C_PreConstruct) == 0x000001, "Wrong size on W_UpgradeMenuNew_C_PreConstruct");
static_assert(offsetof(W_UpgradeMenuNew_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_UpgradeMenuNew_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

