#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpdatedStatPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_UpdatedStatPanel.W_UpdatedStatPanel_C.ExecuteUbergraph_W_UpdatedStatPanel
// 0x0050 (0x0050 - 0x0000)
struct W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel) == 0x000008, "Wrong alignment on W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel");
static_assert(sizeof(W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel) == 0x000050, "Wrong size on W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel");
static_assert(offsetof(W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel, EntryPoint) == 0x000000, "Member 'W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel, K2Node_Event_InDeltaTime) == 0x000048, "Member 'W_UpdatedStatPanel_C_ExecuteUbergraph_W_UpdatedStatPanel::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function W_UpdatedStatPanel.W_UpdatedStatPanel_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct W_UpdatedStatPanel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_UpdatedStatPanel_C_Tick) == 0x000008, "Wrong alignment on W_UpdatedStatPanel_C_Tick");
static_assert(sizeof(W_UpdatedStatPanel_C_Tick) == 0x000048, "Wrong size on W_UpdatedStatPanel_C_Tick");
static_assert(offsetof(W_UpdatedStatPanel_C_Tick, MyGeometry) == 0x000000, "Member 'W_UpdatedStatPanel_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_UpdatedStatPanel_C_Tick, InDeltaTime) == 0x000040, "Member 'W_UpdatedStatPanel_C_Tick::InDeltaTime' has a wrong offset!");

}

