#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpgradeSlotPanel

#include "Basic.hpp"

#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UpgradeSlotPanel.W_UpgradeSlotPanel_C
// 0x0050 (0x03A0 - 0x0350)
class UW_UpgradeSlotPanel_C final : public UPDAUpgradePanel
{
public:
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_1;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_2;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_3;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_4;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_5;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_6;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_7;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_8;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PDAUpgradesSlot_C*                   W_PDAUpgradesSlot_9;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UpgradeSlotPanel_C">();
	}
	static class UW_UpgradeSlotPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UpgradeSlotPanel_C>();
	}
};
static_assert(alignof(UW_UpgradeSlotPanel_C) == 0x000008, "Wrong alignment on UW_UpgradeSlotPanel_C");
static_assert(sizeof(UW_UpgradeSlotPanel_C) == 0x0003A0, "Wrong size on UW_UpgradeSlotPanel_C");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot) == 0x000350, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_1) == 0x000358, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_1' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_2) == 0x000360, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_2' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_3) == 0x000368, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_3' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_4) == 0x000370, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_4' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_5) == 0x000378, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_5' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_6) == 0x000380, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_6' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_7) == 0x000388, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_7' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_8) == 0x000390, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_8' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSlotPanel_C, W_PDAUpgradesSlot_9) == 0x000398, "Member 'UW_UpgradeSlotPanel_C::W_PDAUpgradesSlot_9' has a wrong offset!");

}

