#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpgradeSectionDefault

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UpgradeSectionDefault.W_UpgradeSectionDefault_C
// 0x00A0 (0x0468 - 0x03C8)
class UW_UpgradeSectionDefault_C final : public UUpgradeSection
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HorizontalLine;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HorizontalLine_1;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModulesEndLine;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ModulesHorizontalLineHorizontalBox;                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModuleSlotVerticalBox;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModuleSlotVerticalBox1;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModuleSlotVerticalBox2;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpgradeEnLine;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UpgradesHorizontalLineHorizontalBox;               // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UpgradeSlotVerticalBox;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UpgradeSlotVerticalBox1;                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           UpgradeSlotVerticalBox2;                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        TempArray;                                         // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        LeftOrderUpgrades;                                 // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          UpgradesReverted;                                  // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ModulesReverted;                                   // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452[0x6];                                      // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        RightOrderModules;                                 // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_W_UpgradeSectionDefault(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RebuildSections();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UpgradeSectionDefault_C">();
	}
	static class UW_UpgradeSectionDefault_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UpgradeSectionDefault_C>();
	}
};
static_assert(alignof(UW_UpgradeSectionDefault_C) == 0x000008, "Wrong alignment on UW_UpgradeSectionDefault_C");
static_assert(sizeof(UW_UpgradeSectionDefault_C) == 0x000468, "Wrong size on UW_UpgradeSectionDefault_C");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UberGraphFrame) == 0x0003C8, "Member 'UW_UpgradeSectionDefault_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, HorizontalLine) == 0x0003D0, "Member 'UW_UpgradeSectionDefault_C::HorizontalLine' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, HorizontalLine_1) == 0x0003D8, "Member 'UW_UpgradeSectionDefault_C::HorizontalLine_1' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModulesEndLine) == 0x0003E0, "Member 'UW_UpgradeSectionDefault_C::ModulesEndLine' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModulesHorizontalLineHorizontalBox) == 0x0003E8, "Member 'UW_UpgradeSectionDefault_C::ModulesHorizontalLineHorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModuleSlotVerticalBox) == 0x0003F0, "Member 'UW_UpgradeSectionDefault_C::ModuleSlotVerticalBox' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModuleSlotVerticalBox1) == 0x0003F8, "Member 'UW_UpgradeSectionDefault_C::ModuleSlotVerticalBox1' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModuleSlotVerticalBox2) == 0x000400, "Member 'UW_UpgradeSectionDefault_C::ModuleSlotVerticalBox2' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradeEnLine) == 0x000408, "Member 'UW_UpgradeSectionDefault_C::UpgradeEnLine' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradesHorizontalLineHorizontalBox) == 0x000410, "Member 'UW_UpgradeSectionDefault_C::UpgradesHorizontalLineHorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradeSlotVerticalBox) == 0x000418, "Member 'UW_UpgradeSectionDefault_C::UpgradeSlotVerticalBox' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradeSlotVerticalBox1) == 0x000420, "Member 'UW_UpgradeSectionDefault_C::UpgradeSlotVerticalBox1' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradeSlotVerticalBox2) == 0x000428, "Member 'UW_UpgradeSectionDefault_C::UpgradeSlotVerticalBox2' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, TempArray) == 0x000430, "Member 'UW_UpgradeSectionDefault_C::TempArray' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, LeftOrderUpgrades) == 0x000440, "Member 'UW_UpgradeSectionDefault_C::LeftOrderUpgrades' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, UpgradesReverted) == 0x000450, "Member 'UW_UpgradeSectionDefault_C::UpgradesReverted' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, ModulesReverted) == 0x000451, "Member 'UW_UpgradeSectionDefault_C::ModulesReverted' has a wrong offset!");
static_assert(offsetof(UW_UpgradeSectionDefault_C, RightOrderModules) == 0x000458, "Member 'UW_UpgradeSectionDefault_C::RightOrderModules' has a wrong offset!");

}

