#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UpdatedStatPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Stalker2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UpdatedStatPanel.W_UpdatedStatPanel_C
// 0x00C0 (0x0498 - 0x03D8)
class UW_UpdatedStatPanel_C final : public UStatPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HPBack;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StatSlot_C*                          HPStatSlot;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StatSlot_C*                          StaminaStatSlot;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFloatCurve                            AnimCurve;                                         // 0x0400(0x0098)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_UpdatedStatPanel(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UpdatedStatPanel_C">();
	}
	static class UW_UpdatedStatPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UpdatedStatPanel_C>();
	}
};
static_assert(alignof(UW_UpdatedStatPanel_C) == 0x000008, "Wrong alignment on UW_UpdatedStatPanel_C");
static_assert(sizeof(UW_UpdatedStatPanel_C) == 0x000498, "Wrong size on UW_UpdatedStatPanel_C");
static_assert(offsetof(UW_UpdatedStatPanel_C, UberGraphFrame) == 0x0003D8, "Member 'UW_UpdatedStatPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_UpdatedStatPanel_C, Background) == 0x0003E0, "Member 'UW_UpdatedStatPanel_C::Background' has a wrong offset!");
static_assert(offsetof(UW_UpdatedStatPanel_C, HPBack) == 0x0003E8, "Member 'UW_UpdatedStatPanel_C::HPBack' has a wrong offset!");
static_assert(offsetof(UW_UpdatedStatPanel_C, HPStatSlot) == 0x0003F0, "Member 'UW_UpdatedStatPanel_C::HPStatSlot' has a wrong offset!");
static_assert(offsetof(UW_UpdatedStatPanel_C, StaminaStatSlot) == 0x0003F8, "Member 'UW_UpdatedStatPanel_C::StaminaStatSlot' has a wrong offset!");
static_assert(offsetof(UW_UpdatedStatPanel_C, AnimCurve) == 0x000400, "Member 'UW_UpdatedStatPanel_C::AnimCurve' has a wrong offset!");

}

